{
    "unarmoured": [
        {
            "name": "Illusory Wrap",
            "source": "wizard - illusion",
            "mods": [
                "You learn the Minor Illusion cantrip. When you cast it, you can create both sound and image with a single casting."
            ],
            "variables": []
        },
        {
            "name": "Gravity Wrap",
            "source": "wizard - graviturgy",
            "mods": [
                "As an action, you can alter the weight of an object or creature you can see within 30' of you. The target must be Large or smaller. Its weight it halved or doubled for up to 1 minute, or until your concentration on this power ends.",
                "While a creature's weight is halved, its speed increases by 10', its jump distance is doubled, and it has disadvantage on STR checks and saves.",
                "While a creature's weight is doubled, its speed is reduced by 10' and it has advantage on STR checks and saves."
            ],
            "variables": []
        },
        {
            "name": "Ascendant Garb",
            "source": "adept - ascendant dragon",
            "mods": [],
            "variables": [
                {
                    "mods": [
                        "Once per long rest, when you fail an Intimidation or Persuasion check, you may use your reaction to reroll the check.",
                        "When you damage a target with an unarmed strike, you can change the dmg type to $nonPhysType.",
                        "You gain proficiency in Draconic."
                    ]
                },
                {
                    "mods": [
                        "Whenever you take the Attack action on your turn, you can replace 1 of the attacks with an exhalation of draconic energy in a certain area. Each creature in that area must make a DEX save, taking 2d4 $nonPhysType spell dmg on a failed save, or half as much on a success.",
                        "You can use this breath attack twice, and regain all uses when you finish a short or long rest."
                    ],
                    "variables": [
                        "The exhalation's area is a 30' line.",
                        "The exhalation's area is a 20' cone."
                    ]
                }
            ]
        },
        {
            "name": "Drunken Silks",
            "source": "adept - drunken master",
            "mods": [],
            "variables": [
                {
                    "mods": [
                        "You gain an expertise die in Performance.",
                        "You gain an expertise die in Entertain Journey checks with the ability to magically produce ale."
                    ]
                },
                {
                    "mods": [
                        "Once per short or long rest, upon making an attack with your bonus action, you may gain the benefits of the Disengage action and your speed increases by 10' for the rest of the turn."
                    ]
                }
            ]
        },
        {
            "name": "Elemental Garb",
            "source": "adept - four elements",
            "mods": [],
            "variables": [
                {
                    "mods": [
                        "As an action, you can briefly control elemental forces within 30' of you."
                    ],
                    "variables": [
                        "When you do so, you create a harmless, instantaneous sensory effect related to air, earth, fire, or water, such as a shower of sparks, a puff of wind, a spray of light mist, or a gentle rumbling of stone.",
                        "When you do so, you instantaneously light or snuff out a candle, a torch, or a small campfire.",
                        "When you do so, you chill or warm up to 1 pound of non-living material for up to 1hr.",
                        "When you do so, you cause earth, fire, water, or mist that can fit within a 1'-cube to shape itself into a crude form you designate for 1 minute."
                    ]
                },
                {
                    "mods": [
                        "You can cast Thunderwave once per short or long rest."
                    ]
                },
                {
                    "mods": [
                        "You can cast Gust of Wind once per short or long rest."
                    ]
                },
                {
                    "mods": [
                        "As an action up to twice per short or long rest, you can choose an area of ice or water no larger than 30' on a side within 120' of you. You can change water to ice within the area and vice-versa, and you can reshape the ice in the area in any manner you choose. You can raise or lower the ice's elevation, create or fill a trench, erect or flatten a wall, or form a pillar. The extent of any such changes cannot exceed half the area's largest dimension. You cannot shape the ice to trap or injure a creature in the area."
                    ]
                },
                {
                    "mods": [
                        "You can cast Burning Hands once per short or long rest."
                    ]
                },
                {
                    "mods": [
                        "You can create a blast of compressed air that strikes like a mighty fist as an action once per short or long rest. Choose a creature within 30' of you. They must make a STR save or take 3d10 B spell dmg, and you can push the creature up to 20' away from you and knock it prone. On a success, it takes half as much damage and no other effect."
                    ]
                },
                {
                    "mods": [
                        "As an action once per short or long rest you can create a whipe of water that shoves and pulls a creature to unbalance it. A creature you can see within 30' must make a DEX save or take 3d10 B spell dmg and you can either knock it prone or pull it up to 25' closer to you. On a success, it takes half as much damage and no other effect."
                    ]
                }
            ]
        },
        {
            "name": "Tranquil Cloak",
            "source": "adept - tranquility",
            "mods": [],
            "variables": [
                {
                    "mods": [
                        "You can cast the Sanctuary spell on yourself once per minute with a duration of 8hrs. A creature that succeeds the save against the spell is immune to it for 1hr."
                    ]
                },
                {
                    "mods": [
                        "You have a pool of 30 healing points. It replenishes whenever you complete a long rest.",
                        "Your healing points cannot be used on undead or constructs.",
                        "The first 3 times per short or long rest that you use the following action, it only costs a bonus action."
                    ],
                    "variables": [
                        "As an action, you can touch a creature and expend any number of your healing points to restore that many hit points to that creature.",
                        "As an action, you can touch a creature and expend any multiple of 5 healing points to cure the target of one disease or poison affecting it per 5 points expended."
                    ]
                }
            ]
        },
        {
            "name": "Arcane Vest",
            "source": "wizard - arcanist",
            "mods": [],
            "variables": [
                {
                    "mods": [
                        "On casting a spell with instantaneous duration that deals dmg to an area, you can choose a number of creatures equal to your ability score mod in the area that you can see. Those creatures take no dmg from the spell."
                    ]
                },
                {
                    "mods": [
                        "1/SR as a bonus action, you can roll a d20, record the result, and choose a creature within 30'. The next time that creature makes a d20 roll, it takes that d20 result instead of rolling.",
                        "You may use this bonus action again while it is on cooldown if you expend a spell slot."
                    ]
                },
                {
                    "mods": [
                        "On casting a levelled spell, you can immediately move up to 15' without provoking opp atks."
                    ]
                }
            ]
        },
        {
            "name": "Magic Robes",
            "source": "wizard - mage",
            "mods": [
                "1/SR as an action, you can replace one of your prepared spells with another from your spellbook."
            ],
            "variables": []
        },
        {
            "name": "Dueling Wrap",
            "source": "fighter - duelist (a5e)",
            "mods": [],
            "variables": [
                {
                    "mods": [
                        "A number of times equal to your ability score mod between long rests, when you spend exertion, you can reduce the cost by 1pt."
                    ]
                },
                {
                    "mods": [
                        "While you are wielding a Finesse or Parrying wep, you have +1 AC."
                    ]
                }
            ]
        },
        {
            "name": "Clockwork Wrap",
            "source": "sorcerer - clockwork soul",
            "mods": [
                "2/LR, whenever you a creature you can see within 60' of you is about to roll a d20 with either adv or disadv, you can react to make the roll regular."
            ],
            "variables": []
        },
        {
            "name": "Lunar Cloak",
            "source": "sorcerer - lunar magic",
            "mods": [
                "You learn the Sacred Flame cantrip. When you cast this spell, you can target up to 2 creatures in range that are adj to each other."
            ],
            "variables": []
        },
        {
            "name": "Draconic Silks",
            "source": "sorcerer - draconist",
            "mods": [],
            "variables": [
                {
                    "mods": [
                        "+3 max HP."
                    ]
                },
                {
                    "mods": [
                        "You gain proficiency with Draconic.",
                        "You have adv on CHA checks while communicating with dragons in Draconic."
                    ]
                }
            ]
        },
        {
            "name": "Enigmatic Garb",
            "source": "sorcerer - enigma",
            "mods": [],
            "variables": [
                {
                    "mods": [
                        "You gain an expertise die on ability checks made to identify spells being cast or sense the presence of lingering magic in any form."
                    ]
                },
                {
                    "mods": [
                        "As a bonus action, you can attempt to replace one of your prepared spells with another spell of the same or lower lvl from your spell list. This lasts until your next long rest. The new spell cannot be replaced again. To do so, declare which spell you're trying to replace and make a save with your ability score (DC 10 + the spell's level).",
                        "If you fail the save, the spell you are attempting to replace is cast, expending no resources but targeting a creature or point within range of the DM's choice (possibly yourself). The spell is too wild to alter in any way (including from your equipment), and if it requires concentration it lasts its full duration with no concentration required instead. That spell is then unprepared until you finish a long rest."
                    ]
                }
            ]
        }
    ],
    "light": [
        {
            "name": "Stewarding Vest",
            "source": "savant - steward",
            "mods": [],
            "variables": [
                {
                    "mods": [
                        "You gain an expertise die in Persuasion.",
                        "You gain proficiency in Sylvan."
                    ]
                },
                {
                    "mods": [
                        "As a bonus action, you can communicate one of your features to a creature of your choice who can understand you within 10' of you. Before the end of your next turn, the first time that feature would be relevant for the target, it affects them as if it were their feature (still using your ability scores for any calculations). If the feature has a cooldown or resource cost, you expend it as usual even if only the target benefits from the feature."
                    ]
                }
            ]
        },
        {
            "name": "Vocal Tunic",
            "source": "savant - vox",
            "mods": [],
            "variables": [
                {
                    "mods": [
                        "You gain an expertise die in Insight.",
                        "You gain proficiency in Infernal."
                    ]
                },
                {
                    "mods": [
                        "As an action, you can trigger any effects that would usually trigger from a melee wep atk/hit on a creature that can understand you within 30'."
                    ]
                }
            ]
        },
        {
            "name": "Scouting Raiment",
            "source": "rogue - scout",
            "mods": [],
            "variables": [
                {
                    "mods": [
                        "You can move up to half your speed as a reaction when a hostile creature ends its turn adj to you. This movement does not provoke opp atks."
                    ]
                },
                {
                    "mods": [
                        "You gain a d6 expertise die in Nature and Survival."
                    ]
                }
            ]
        },
        {
            "name": "Soulful Jerkin",
            "source": "rogue - soulknife",
            "mods": [],
            "variables": [
                {
                    "mods": [
                        "You have 4 Energy dice, which are d6s. You regain all expended Energy dice whenever you finish a long rest.",
                        "As a bonus action, you may replenish 1 Energy die. You cannot do so again until you complete a short or long rest."
                    ],
                    "variables": [
                        "If you fail an ability check using a skill with which you have prof, you can roll an Energy die and add the result to the check. You expend the die only if the check succeeds.",
                        "As an action, choose a number of creatures you can see up to your prof bonus, then roll an Energy die. For a number of hrs equal to the result, the chosen creatures can speak telepathically with you while you are within 1 mile of each other, and vice-versa. A creature can only use this telepathy if it can speak a language, and a creature can end the connection at any time. The first time you use this power after each long rest, you don't expend the Energy die, but all other times it is expended."
                    ]
                },
                {
                    "mods": [
                        "Whenever you take the Attack action, you may replace the base properties of your onhand weapon with a psychic blade that shimmers over it.",
                        "The psychic blade deals 1d6 psy dmg, has the finesse and thrown (60'/60') traits, and leaves no signs of physical dmg on its targets.",
                        "After attacking with the psychic blade, you can replace the base properties of your offhand weapon with another one as a bonus action, making an offhand weapon attack with this new blade. It has the same properties as the onhand blade, but deals 1d4 dmg instead.",
                        "The blades disappear at the end of your turn."
                    ]
                }
            ]
        },
        {
            "name": "Swift Raiment",
            "source": "marshal - swift strategist",
            "mods": [],
            "variables": [
                {
                    "mods": [
                        "Whenever an ally starts its turn within 10' of you, their speed is increased by 5' until the end of their turn."
                    ]
                },
                {
                    "mods": [
                        "Once per round when you take the Attack action, you can forgo making 1 atk to allow an ally within 10' of you to move up to half its speed without provoking opp atks."
                    ]
                },
                {
                    "mods": [
                        "Your speed increases by 10' if you are not holding a shield.",
                        "Whenever your movement would provoke an opp atk, the atk has disadv."
                    ]
                }
            ]
        },
        {
            "name": "Inquisitive Garb",
            "source": "rogue - inquisitive",
            "mods": [],
            "variables": [
                {
                    "mods": [
                        "Whenever you make an Insight check to determine whether a creature is lying, treat a roll of 7 or lower on the d20 as an 8."
                    ]
                },
                {
                    "variables": [
                        "As a bonus action, you can make a Perception check to spot a hidden creature or object.",
                        "As a bonus action, you can make an Investigation check to uncover or decipher clues."
                    ]
                },
                {
                    "mods": [
                        "As a bonus action, you can make an Insight check against a creature you can see that is not incapacitated, contested by the target's Deception check. If you succeed, you treat that target as if you have adv with your atks against them, unless you have disadv on the atk.",
                        "This benefit lasts for 1 minute or until your successfully use this power against a different target."
                    ]
                }
            ]
        },
        {
            "name": "Arcane Raiment",
            "source": "rogue - arcane trickster",
            "mods": [
                "Whenever you cast Mage Hand, you can make the spectral hand invisible.",
                "You can use your Cunning Action to control the Mage Hand.",
                "You can perform the following task with Mage Hand. If you succeed on a Sleight of Hand check contested by another creature's Perception check, you can make the task unnoticed by that creature."
            ],
            "variables": [
                {
                    "mods": [
                        "You can stow one object the hand is holding in a container worn or carried by another creature."
                    ]
                },
                {
                    "mods": [
                        "You can retrieve an obj in a container worn or carried by another creature."
                    ]
                },
                {
                    "mods": [
                        "You can pick locks and disarm traps with the hand as if you were doing it yourself."
                    ]
                }
            ]
        },
        {
            "name": "Raven Vest",
            "source": "warlock - raven queen",
            "mods": [
                "You have a Raven spirit minion that you can command telepathically while within 100' of it.",
                "While the Raven is perched on your shoulder, you gain 30' of darkvision and a bonus to your Perception equal to your ability score mod. It also cannot take dmg or be targeted by any effect other than your spells, and is incap.",
                "You can see and hear through the Raven while it is within 100' of you.",
                "If the Raven is killed, you gain adv on all atk rolls against the killer until your next long rest.",
                "The Raven can awaken you from sleep as a bonus action, and doesn't need its own sleep.",
                "At the end of a rest, you can resurrect a dead Raven into an empty adj space."
            ],
            "variables": []
        },
        {
            "name": "Great Tunic",
            "source": "warlock - great old one",
            "mods": [
                "You can telepathically speak to any creature you can see within 30'. They must be able to understand at least one language to understand your communication."
            ],
            "variables": []
        },
        {
            "name": "Satirical Tunic",
            "source": "bard - satire",
            "mods": [],
            "variables": [
                {
                    "mods": [
                        "You gain an expertise die in Sleight of Hand and Persuasion."
                    ]
                },
                {
                    "mods": [
                        "As a bonus action, you can tumble to gain the following benefits for the rest of your turn:",
                        "You gain the benefits of the Dash and Disengage actions.",
                        "You gain a climb speed equal to your speed.",
                        "You gain 50% resistance to fall dmg."
                    ]
                }
            ]
        }
    ],
    "medium": [
        {
            "name": "Starlit Brigandine",
            "source": "druid - stars",
            "mods": [],
            "variables": [
                {
                    "mods": [
                        "You learn the Guidance cantrip.",
                        "You learn the Guiding Bolt spell and always have it prepared. You can also cast it twice without expending any resources. You recover these uses whenever you finish a long rest."
                    ]
                },
                {
                    "mods": [
                        "As a bonus action, you can shapeshift into a celestial form for 10 minutes, or until you dismiss it early or are incapacitated. You can do this once between long rests. While in your celestial form, you shed bright light in a 20' radius and dim light for an additional 20'."
                    ],
                    "variables": [
                        "While in your celestial form, a constellation of an archer appears above you. When you enter this form and as a bonus action on subsequent turns while it lasts, you can make a ranged spell attack using the archer's bow against a creature within 60' of you. On a hit, it deals radiant dmg equal to 1d8 + your ability score modifier.",
                        "While in your celestial form, a constellation of a chalice appears above you. Whenever you cast a levelled spell that restores hit points to a creature while in this form, you or another creature within 30' of you can regain hit points equal to 1d8 + your ability score modifier.",
                        "While in your celestial form, a constellation of a dragon appears above you. While in this form, whenever you make an INT or WIS check, or a CON save to maintain concentration on a spell, you can treat a roll of 9 or lower on the d20 as a 10."
                    ]
                }
            ]
        },
        {
            "name": "Lunar Chainmail",
            "source": "druid - moon",
            "mods": [],
            "variables": [
                {
                    "mods": [
                        "Shapeshifting powers you have that take a standard action now only take a bonus action.",
                        "While shapeshifted, you may spend a bonus action and 1 spell slot to heal 1d8 hit points per level of the slot expended."
                    ]
                },
                {
                    "mods": [
                        "When you shapeshift based on CR, you can shapeshift into a creature 2 CRs higher than usual."
                    ]
                }
            ]
        },
        {
            "name": "Spiked Hauberk",
            "source": "berserker - battlerager",
            "mods": [
                "This hauberk has 3 charges, all of which are recovered whenever you finish a long rest.",
                "Whenever you roll for initiative, you can choose to expend one of the hauberk's charges to have spikes portrude from it for 1 minute.",
                "While the spikes are active, you can use a bonus action to make a melee weapon attack with the hauberk against a target within 5' of you. If it hits, it deals piercing dmg equal to 1d4 + your ability score modifier.",
                "Whenever you successfully use the Grapple maneuver while the spikes are active, it deals 3 additional piercing damage."
            ],
            "variables": []
        },
        {
            "name": "Totemic Vest",
            "source": "berserker - totem warrior",
            "mods": [],
            "variables": [
                {
                    "mods": [
                        "You can cast the Speak with Animals spell at no cost."
                    ]
                },
                {
                    "mods": [
                        "This vest has 3 charges, all of which are recovered whenever you finish a long rest.",
                        "Whenever you roll for initiative, you can choose to expend one of the vest's charges to adopt a bestial form for 1 minute."
                    ],
                    "variables": [
                        "While in your bestial form, you have 50% resistance to all non-psychic damage.",
                        "While in your bestial form, opportunity attacks have disadvantage against you, and you can take the Dash action as a bonus action on your turns.",
                        "While in your bestial form, your speed increases by 15'.",
                        "While in your bestial form, add 10' to your long jump distance and 3' to your high jump distance.",
                        "While in your bestial form, melee attacks against any creatures of your choice adjacent to you have advantage."
                    ]
                }
            ]
        },
        {
            "name": "Vanguardian Ringmail",
            "source": "savant - vanguard",
            "mods": [],
            "variables": [
                {
                    "mods": [
                        "You have proficiency with all martial weapons."
                    ]
                },
                {
                    "mods": [
                        "Features and effects that trigger from your melee weapon attacks now also trigger from ranged weapon attacks against targets within 30'."
                    ]
                }
            ]
        },
        {
            "name": "Bestial Chainmail",
            "source": "ranger - beast trainer",
            "mods": [],
            "variables": [
                {
                    "mods": [
                        "You gain an expertise die in Animal Handling."
                    ]
                },
                {
                    "mods": [
                        "You have a CR 1/4 medium Beast minion. You must use a bonus action to command it, or an ally can do so as a bonus action with a successful DC 10 Animal Handling check.",
                        "If the minion dies, you can revive it as an action and a 1st-lvl spell slot. It returns to full hit points 1min later."
                    ]
                }
            ]
        },
        {
            "name": "Warding Brigandine",
            "source": "ranger - grove warden",
            "mods": [],
            "variables": [
                {
                    "mods": [
                        "Any effect that allows you to sense or detect certain creature types now also works on humanoids, and tells you their general direction, and roughly how many humanoids are together (1, 2-5, or 6+)."
                    ]
                },
                {
                    "mods": [
                        "As a bonus action, you can choose a creature you can see within 60' of you. Your next wep atk against that creature has adv as you draw on the essence of the land to hamper them.",
                        "If this enhanced atk hits, the target's sp is reduced by 10' until the start of your next turn."
                    ]
                }
            ]
        },
        {
            "name": "Engineered Hauberk",
            "source": "artificer - engineer",
            "mods": [],
            "variables": [
                {
                    "mods": [
                        "Gain proficiency in piloting air, land, and water vehicles."
                    ]
                },
                {
                    "mods": [
                        "With 8hrs of uninterrupted work, you can craft a custom vehicle. You can only have 1 at once (on creating a new one, the previous one crumbles from disrepair).",
                        "During any LR, you can restore your custom vehicle to full HP and remove any malfunctions.",
                        "The vehicle is your choice of Medium or Large, has AC equal to 10 + your ability score mod, 25 HP, and a speed of 30'. It can only carry 1 crew and has the Personal trait."
                    ],
                    "variables": [
                        "The vehicle's AC increases by 2.",
                        "The vehicle ignores diff terrain.",
                        "1/LR, as a bonus action while piloting the vehicle, you can increases its speed by 30' for 1min.",
                        "The vehicle can take the Stop action even with momentum, but loses all momentum upon doing so.",
                        "On LR end, you can expend a spell slot to give the vehicle the ability to cast one of your spells of that lvl. Instead of consuming the spell slot, the vehicle gains an Integrity malfunction each time it casts the spell.",
                        "The vehicle gains a climb sp of 30'.",
                        "The vehicle's sp increases to 50'.",
                        "The vehicle loses its Personal trait, and can carry you plus 1 Medium or smaller passenger.",
                        "Whenever a collision occurs with the vehicle, the dmg it takes is reduced by 1d6, and dmg dealt to other impacted objs and vehicles is increased by 2d6.",
                        "The vehicle becomes a water vehicle with a swim sp of 30' in addition to being a land vehicle. It swaps between types depending on the terrain it is travelling on.",
                        "You gain +2 AC while piloting the vehicle."
                    ]
                }
            ]
        },
        {
            "name": "Stiched Brigandine",
            "source": "artificer - stitcher",
            "mods": [],
            "variables": [
                {
                    "mods": [
                        "Gain an expertise die in Crafting Creation checks for helms, gloves, and boots."
                    ]
                },
                {
                    "mods": [
                        "With 8hrs of uninterrupted work on a humanoid corpse that has been dead no longer than 24hrs, you can create a flesh minion. You can only have 1 at a time.",
                        "The minion can only atk on its own as a reaction to being atk'd. It can take other actions as normal, and makes death saves on reaching 0 hit points instead of dying outright. As a bonus action, you can command the minion to take any action.",
                        "The minion uses the stats of a Zombie, but its type is Monstrosity, it gains 6 temp HP on init roll, its AC, AB, and dmg are each increased by 2, and it recovers all hit points at the end of a long rest."
                    ],
                    "variables": [
                        "The minion does not make death saves, and instead explodes and is destroyed upon going down. Creatures within 10' of the minion must make a DEX save or take 2d6 psn dmg, or half as much on a success.",
                        "The minion requires an additional similar humanoid corpse to be created, and it has 2 additional arms, granting it a climb sp of 20'. Additionally, its maneuver DC for escaping its grapples increases by your ability score mod.",
                        "The minion requires an additional similar humanoid corpse to be created, and it has 2 additional legs, granting it +15' of speed.",
                        "Make a sleight of hand check upon creating the minion. Creatures must make a Perception check of DC equal to your result to visually determine that the minion is a monstrosity and not a regular person.",
                        "On LR end, you can expend a spell slot to give the minion the ability to cast one of your spells with your commanding bonus action. It can only do so once.",
                        "On LR end, you can graft a 1h melee wep onto the minion to replace its basic Slam atk with that, which has the same AB. This replaces one of its hands, so it can no longer use the Grapple maneuver.",
                        "The minion's Slam inflicts a 1d6 nec DoT that persists until the target regains HP or an action is used on it to pass a DC 15 Medicine check.",
                        "Whenever the minion is hit by a melee atk, it inflicts 1d6 light thorns dmg on the offender.",
                        "The minion's AC increases by 2.",
                        "The minion can take the Dash action as its bonus action, but cannot do so again until it moves 0' on a turn."
                    ]
                }
            ]
        },
        {
            "name": "Sharp Vest",
            "source": "bard - swords",
            "mods": [],
            "variables": [
                {
                    "mods": [
                        "You gain proficiency with sword weapons.",
                        "All melee weapons you are proficient with gain the Conduit trait."
                    ]
                },
                {
                    "mods": [],
                    "variables": [
                        "While you are wielding a 1h melee wep and no other wep, you deal +2 dmg with that wep.",
                        "While dual-wielding, you can add your ability modifier to your offhand's dmg."
                    ]
                },
                {
                    "mods": [
                        "Whenever you take the Attack action on your turn, your speed increases by 10' until the end of the turn."
                    ],
                    "variables": [
                        "A number of times equal to half your ability score mod between long rests, on hit with an atk from your Attack action, you may roll a d6 and add its result to both the hit's dmg and your AC until your next turn.",
                        "A number of times equal to half your ability score mod between long rests, on hit with an atk from your Attack action, you may roll a d6 and add its result to the hit's dmg, then you may also push the target up to 5' away from you, plus a number of feet equal to the d6's result. You may then immediately use your reaction to move up to your speed to an empty space adj to the target.",
                        "A number of times equal to half your ability score mod between long rests, on hit with an atk from your Attack action, you may roll a d6 and add its result to the hit's dmg, then you may also deal that much dmg to another creature of your choice adj to you that you can see."
                    ]
                }
            ]
        },
        {
            "name": "Primeval Chainmail",
            "source": "druid - primeval",
            "mods": [],
            "variables": [
                {
                    "mods": [
                        "You gain an expertise die in History.",
                        "Whenever you make a History check, you can roll a d4 and add it to the check."
                    ]
                },
                {
                    "mods": [
                        "As an action 1/SR, you can summon a Primeval Companion, a CR 1/2 beast minion. The companion requires your bonus action to be commanded, otherwise just taking the Dodge action each turn. The exception to this is if you are unconscious, when the companion can be controlled without your bonus action."
                    ]
                }
            ]
        },
        {
            "name": "Shepharding Scale",
            "source": "druid - shepherd",
            "mods": [],
            "variables": [
                {
                    "mods": [
                        "You gain prof in Sylvan.",
                        "Beasts can understand your speech and you can decipher their noises and motions. Most beasts lack the INT to convey or understand sophisticated concepts, but a friendly beast could relay what it has seen or heard in the recent past."
                    ]
                },
                {
                    "mods": [
                        "As a bonus action 1/SR, you can conjure an incorporeal spirit in a space you can see within 60' of you.",
                        "As a bonus action, you can move the spirit up to 60' to a point you can see.",
                        "The spirit disappears if you are knocked unconscious, or after 1min."
                    ],
                    "variables": [
                        "The spirit is a bear's. You and your allies within 30' of the spirit when it appears gain 8 temp HP. In addition, while inside this area, you and your allies gain adv on STR checks and saves.",
                        "The spirit is a hawk's. Whenever a creature makes an atk roll against a target within 30' of the spirit, you can react to grant the atk adv. Additionally, you and your allies have adv on Perception checks while within this area.",
                        "The spirit is a unicorn's. You and your allies have adv on all ability checks made to detect creatures within 30' of the spirit. Additionally, if you cast a levelled spell that restores HP to a creature, each creature of your choice within this area also regains 3 HP."
                    ]
                }
            ]
        },
        {
            "name": "Bestial Ringmail",
            "source": "berserker - beast",
            "mods": [
                "As a bonus action 3/LR, you can shapeshift into a beast-hybrid form. This shapeshift lasts until you are knocked unconcscious, or for 1min.",
                "While shapeshifted in this way, you manifest a natural weapon based on STR."
            ],
            "variables": [
                {
                    "mods": [
                        "Your mouth becomes a bestial muzzle or great mandibles, which deal 1d8 P dmg.",
                        "Once per turn, when you dmg a creature with this bite atk while bloodied, you regain hit points equal to your prof bonus."
                    ]
                },
                {
                    "mods": [
                        "Your hands become claws, which subsume your weapons and take on their enchantments. They deal 1d6 S dmg.",
                        "Once per turn, whenever you atk with this claw as part of your Attack action, you can make an additional claw atk."
                    ]
                },
                {
                    "mods": [
                        "You grow a lashing, spiny tail, which deals 1d8 P dmg and has the Reach trait.",
                        "Whenever a creature you can see within 10' of you hits you with an atk, you can react to roll a d8 and add that amount to your AC for the atk, by defending with your tail."
                    ]
                }
            ]
        },
        {
            "name": "Wild Scale",
            "source": "berserker - wild magic",
            "mods": [],
            "variables": [
                {
                    "mods": [
                        "As an action 2/LR, you can know the location of any spell or magic item within 60' of you that isn't behind total cover, until the end of your next turn. When you sense a spell in this way, you learn which school of magic it belongs to."
                    ]
                },
                {
                    "mods": [
                        "As a bonus action 3/LR, you can trigger a random magical effect using the following results:",
                        "1. Shadowy tendrils lash around you. Each foe you can see within 30' must make a CON save or take 1d12 nec dmg. You then gain 1d12 temp HP.",
                        "2. You teleport up to 30' to an empty space you can see. For the next min, you can use this effect again on each of your turns as a bonus action.",
                        "3. An intangible spirit appears within 5' of a creature of your choice that you can see within 30' of you. At the end of the current turn, the spirit explodes, and each creature adj to it must pass a DEX save or take 1d6 force dmg. For the next minute, you can use this effect again on each of your turns as a bonus action. This counts as minion dmg.",
                        "4. Magic infuses 1 wep of your choice that you are wielding. For the next minute, the weapon's dmg type changes to force and it gains the Dual-wielding and Thrown (20'/60') traits.",
                        "5. Whenever a creature hits you with an atk during the next minute, that creature takes 1d6 force dmg as magic lashes out in retribution.",
                        "6. For the next minute, you are surrounded by multi-coloured, protective lights which grant you and allies within 10' of you +1 AC.",
                        "7. Flowers and vines temporarily grow around you. For the next minute, the ground within 15' of you is diff terrain for your foes.",
                        "8. A bolt of light shoots from your chest. Another creature of your choice that you can see within 30' of you must pass a CON save or take 1d6 rad dmg and be blinded until the start of your nest turn. For the next minute, you can repeat this effect on each of your turns as a bonus action."
                    ]
                }
            ]
        },
        {
            "name": "Subconscious Chainmail",
            "source": "druid - dreams",
            "mods": [
                "You have a pool of fey energy represented by 3 d6s, all of which you recover on a long rest.",
                "As a bonus action, you can choose a creature you can see within 120' of you and expend and roll a fey die. The target regains a number of hit points equal to the total, and 1 temporary hit point."
            ],
            "variables": []
        },
        {
            "name": "Fungal Chainmail",
            "source": "druid - dreams",
            "mods": [],
            "variables": [
                {
                    "mods": [
                        "You are surrounded by invisible, necrotic spores that are harmless until you unleash them. You have a 10' aura surrounding you. Whenever a creature you can see is in the aura, you can react to deal 1d4 nec spell dmg to them unless they succeed on a CON save."
                    ]
                },
                {
                    "mods": [
                        "As an action 1/SR, you can awaken invisible, necrotic spores surrounding you. You gain 12 temp HP, your auras always deal critical dmg, and your melee wep hits deal an additional 1d6 nec dmg. This lasts for 10mins, or until you lose all the temp HP."
                    ]
                }
            ]
        },
        {
            "name": "Gloaming Doublet",
            "source": "ranger - gloom stalker",
            "mods": [],
            "variables": [
                {
                    "mods": [
                        "You gain initiative equal to your ability score mod.",
                        "During your first turn of a combat, you have +10' speed.",
                        "If you take the Attack action during your first turn of a combat, you can make an additional wep atk as part of the action, which deals 1d8 additional base dmg."
                    ]
                },
                {
                    "mods": [
                        "+60' darkvision.",
                        "While in darkness, you are invis to creatures that rely on darkvision to see you."
                    ]
                }
            ]
        },
        {
            "name": "Hunting Vest",
            "source": "ranger - hunter",
            "mods": [],
            "variables": [
                {
                    "mods": [
                        "1/turn, +1d8 wep dmg vs bloodied targets."
                    ]
                },
                {
                    "mods": [
                        "On block vs an adj Large+ creature you can see, you can react to make an atk against the atker."
                    ]
                },
                {
                    "mods": [
                        "1/round, on making a wep atk on your turn, you can make another atk with the same wep against another target adj to the original, so long as you could have atk'd them with the original atk."
                    ]
                }
            ]
        }
    ],
    "heavy": [
        {
            "name": "Gambling Plate",
            "source": "marshal - gambling general",
            "mods": [],
            "variables": [
                {
                    "mods": [
                        "While you are conscious, any ally within 10' of you that atks may take a -5 penalty to their attack roll to give it 2d6 additional base damage on a hit."
                    ]
                },
                {
                    "mods": [
                        "While you are conscious, any ally that starts its turn within 10' of you may use an action to move up to twice its speed in a straight line and take the Attack action. Until the end of that ally's next turn, creatures they did not attack on their turn have advantage on attack rolls against them."
                    ]
                }
            ]
        },
        {
            "name": "Royal Plate",
            "source": "herald - crown",
            "mods": [],
            "variables": [
                {
                    "mods": [
                        "Once per short or long rest, as a bonus action, you can challenge any creatures of your choice that you can see within 30' of you by forcing them to make a WIS save. On a fail, they cannot willingly move more than 30' away from you. This effect ends on the creature if you are knocked unconscious, die, or if the creature is more than 30' away from you."
                    ]
                },
                {
                    "mods": [
                        "Once per short or long rest, as a bonus action, you can bolster bloodied creatures of your choice that can hear you within 30' of you, healing them for 1d6 + your ability score modifier."
                    ]
                }
            ]
        },
        {
            "name": "Heroic Plate",
            "source": "herald - heroism",
            "mods": [],
            "variables": [
                {
                    "mods": [
                        "Once per short or long rest, as a bonus action, you can augment your athleticism, gaining adv on all Athletics and Acrobatics checks for 10mins."
                    ]
                },
                {
                    "mods": [
                        "Once per short or long rest, as a bonus action, you can guide your atks for 1min, granting your wep atks +1 crit range."
                    ]
                }
            ]
        },
        {
            "name": "Talented Plate",
            "source": "marshal - talented tactician",
            "mods": [
                "Whenever you roll for initiative, you gain a talent die, which is a d4.",
                "While you have a talent die, any ally within 60' of you that can see or hear you can roll it as a bonus die when making an atk. The talent die is then lost until your next turn.",
                "Whenever you start your turn with an unspent talent die, you can increase the talent die's size by 1.",
                "You lose your talent die whenever combat ends."
            ],
            "variables": []
        },
        {
            "name": "Lionhearted Plate",
            "source": "marshal - lionheart",
            "mods": [
                "Once per round when you hit with a melee atk, you can inspire a number of creatures of your choice equal to half your ability score mod within 10' of you. The inspired creatures gain an expertise die on their first atk before your next turn."
            ],
            "variables": []
        },
        {
            "name": "Cavalier Plate",
            "source": "fighter - cavalier",
            "mods": [],
            "variables": [
                {
                    "mods": [],
                    "variables": [
                        "Gain an expertise die in Animal Handling.",
                        "Gain an expertise die in History.",
                        "Gain an expertise die in Insight.",
                        "Gain an expertise die in Performance.",
                        "Gain an expertise die in Persuasion.",
                        "Gain an expertise die in Orcish."
                    ]
                },
                {
                    "mods": [
                        "You have adv on saves to avoid falling off your mount.",
                        "Whenever you fall off your mount, you land of your feet if you are conscious.",
                        "Mounting or dismounting only costs 5' of movement instead of half your speed."
                    ]
                },
                {
                    "mods": [
                        "On melee wep hit, you may mark the target until the end of your next turn, or until you are knocked uncon.",
                        "While a creature marked in this way is adj to you, it has disadv on atks against creatures other than you.",
                        "If a creature marked in this way deals dmg to anyone other than you, you can make a melee wep atk against the marked creature as a bonus action on your next turn. You have adv on this atk and if it hits, it deals 1 additional base dmg. This special atk can only be made a number of times equal to your ability score mod between long rests."
                    ]
                }
            ]
        },
        {
            "name": "Sharpshooting Plate",
            "source": "fighter - sharpshooter",
            "mods": [
                "As a bonus action up to thrice between rests, you can take careful aim at a creature you can see that is within range of a ranged wep you are wielding. Until the end of this turn, your ranged atks with that wep gain the following benefits against the target:",
                "The atks ignore half and three-quarters cover.",
                "On each hit, the wep deals 3 additional base dmg."
            ],
            "variables": []
        },
        {
            "name": "Green Plate",
            "source": "herald - green knight",
            "mods": [],
            "variables": [
                {
                    "mods": [
                        "Once per short or long rest, as an action, you can touch a plant to be recognised by nature as one of its protectors for 1hr. During this time, you have adv on Persuasion checks made to influence druids and beasts.",
                        "Alternatively, you can end this effect early to gain adv on any Survival check for a journey activity."
                    ],
                    "variables": []
                },
                {
                    "mods": [
                        "Once per short or long rest, as a reaction to failing a Nature or Survival check, you can succeed instead."
                    ],
                    "variables": []
                },
                {
                    "mods": [
                        "You learn the Find Familiar spell and can cast it as a ritual.",
                        "Whenever you take the Attack action, you can forgo one of your atks to allow your Familiar to make an attack as its reaction."
                    ],
                    "variables": [
                        "Whenever you cast Find Familiar, you can choose for it to take the form of an Awakened Shrub.",
                        "Whenever you cast Find Familiar, you can choose for it to take the form of a Shrieker.",
                        "Whenever you cast Find Familiar, you can choose for it to take the form of a Sprite.",
                        "Whenever you cast Find Familiar, you can choose for it to take the form of a Violet Fungus."
                    ]
                }
            ]
        },
        {
            "name": "Holy Plate",
            "source": "herald - holy champion",
            "mods": [],
            "variables": [
                {
                    "mods": [
                        "Once per short or long rest, as an action, you can unleash a flood of negative energy on hostile creatures within 30' of you, forcing them to make a CON save. On a failed save, a creature takes 2d8 nec dmg and is pushed 5' away from you. On a success it takes half dmg and is not pushed back."
                    ],
                    "variables": []
                },
                {
                    "mods": [
                        "Once per short or long rest, as a bonus action, you can send out a flood of positive energy to heal friendly creatures (including yourself) within 30' of you, causing them to regain hit points equal to 2 + your ability score mod."
                    ],
                    "variables": []
                }
            ]
        },
        {
            "name": "Brutish Plate",
            "source": "fighter - brute (a5e)",
            "mods": [
                "On melee wep hit, you may expend up to 2 exertion to deal 1d8 additional B dmg per point spent."
            ],
            "variables": []
        }
    ]
}