{
    "unarmoured": [
        {
            "name": "Illusory Wrap",
            "source": "wizard - illusion",
            "mods": [
                "You learn the Minor Illusion cantrip. When you cast it, you can create both sound and image with a single casting."
            ],
            "variables": []
        },
        {
            "name": "Gravity Wrap",
            "source": "wizard - graviturgy",
            "mods": [
                "As an action, you can alter the weight of an object or creature you can see within 30' of you. The target must be Large or smaller. Its weight it halved or doubled for up to 1 minute, or until your concentration on this power ends.",
                "While a creature's weight is halved, its speed increases by 10', its jump distance is doubled, and it has disadvantage on STR checks and saves.",
                "While a creature's weight is doubled, its speed is reduced by 10' and it has advantage on STR checks and saves."
            ],
            "variables": []
        },
        {
            "name": "Ascendant Garb",
            "source": "adept - ascendant dragon",
            "mods": [],
            "variables": [
                {
                    "mods": [
                        "Once per long rest, when you fail an Intimidation or Persuasion check, you may use your reaction to reroll the check.",
                        "When you damage a target with an unarmed strike, you can change the dmg type to $nonPhysType.",
                        "You gain proficiency in Draconic."
                    ]
                },
                {
                    "mods": [
                        "Whenever you take the Attack action on your turn, you can replace 1 of the attacks with an exhalation of draconic energy in a certain area. Each creature in that area must make a DEX save, taking 2d4 $nonPhysType spell dmg on a failed save, or half as much on a success.",
                        "You can use this breath attack twice, and regain all uses when you finish a short or long rest."
                    ],
                    "variables": [
                        "The exhalation's area is a 30' line.",
                        "The exhalation's area is a 20' cone."
                    ]
                }
            ]
        },
        {
            "name": "Drunken Silks",
            "source": "adept - drunken master",
            "mods": [],
            "variables": [
                {
                    "mods": [
                        "You gain an expertise die in Performance.",
                        "You gain an expertise die in Entertain Journey checks with the ability to magically produce ale."
                    ]
                },
                {
                    "mods": [
                        "Once per short or long rest, upon making an attack with your bonus action, you may gain the benefits of the Disengage action and your speed increases by 10' for the rest of the turn."
                    ]
                }
            ]
        },
        {
            "name": "Elemental Garb",
            "source": "adept - four elements",
            "mods": [],
            "variables": [
                {
                    "mods": [
                        "As an action, you can briefly control elemental forces within 30' of you."
                    ],
                    "variables": [
                        "When you do so, you create a harmless, instantaneous sensory effect related to air, earth, fire, or water, such as a shower of sparks, a puff of wind, a spray of light mist, or a gentle rumbling of stone.",
                        "When you do so, you instantaneously light or snuff out a candle, a torch, or a small campfire.",
                        "When you do so, you chill or warm up to 1 pound of non-living material for up to 1hr.",
                        "When you do so, you cause earth, fire, water, or mist that can fit within a 1'-cube to shape itself into a crude form you designate for 1 minute."
                    ]
                },
                {
                    "mods": [
                        "You can cast Thunderwave once per short or long rest."
                    ]
                },
                {
                    "mods": [
                        "You can cast Gust of Wind once per short or long rest."
                    ]
                },
                {
                    "mods": [
                        "As an action up to twice per short or long rest, you can choose an area of ice or water no larger than 30' on a side within 120' of you. You can change water to ice within the area and vice-versa, and you can reshape the ice in the area in any manner you choose. You can raise or lower the ice's elevation, create or fill a trench, erect or flatten a wall, or form a pillar. The extent of any such changes cannot exceed half the area's largest dimension. You cannot shape the ice to trap or injure a creature in the area."
                    ]
                },
                {
                    "mods": [
                        "You can cast Burning Hands once per short or long rest."
                    ]
                },
                {
                    "mods": [
                        "You can create a blast of compressed air that strikes like a mighty fist as an action once per short or long rest. Choose a creature within 30' of you. They must make a STR save or take 3d10 B spell dmg, and you can push the creature up to 20' away from you and knock it prone. On a success, it takes half as much damage and no other effect."
                    ]
                },
                {
                    "mods": [
                        "As an action once per short or long rest you can create a whipe of water that shoves and pulls a creature to unbalance it. A creature you can see within 30' must make a DEX save or take 3d10 B spell dmg and you can either knock it prone or pull it up to 25' closer to you. On a success, it takes half as much damage and no other effect."
                    ]
                }
            ]
        },
        {
            "name": "Tranquil Cloak",
            "source": "adept - tranquility",
            "mods": [],
            "variables": [
                {
                    "mods": [
                        "You can cast the Sanctuary spell on yourself once per minute with a duration of 8hrs. A creature that succeeds the save against the spell is immune to it for 1hr."
                    ]
                },
                {
                    "mods": [
                        "You have a pool of 30 healing points. It replenishes whenever you complete a long rest.",
                        "Your healing points cannot be used on undead or constructs.",
                        "The first 3 times per short or long rest that you use the following action, it only costs a bonus action."
                    ],
                    "variables": [
                        "As an action, you can touch a creature and expend any number of your healing points to restore that many hit points to that creature.",
                        "As an action, you can touch a creature and expend any multiple of 5 healing points to cure the target of one disease or poison affecting it per 5 points expended."
                    ]
                }
            ]
        },
        {
            "name": "Arcane Vest",
            "source": "wizard - arcanist (a5e)",
            "mods": [],
            "variables": [
                {
                    "mods": [
                        "On casting a spell with instantaneous duration that deals dmg to an area, you can choose a number of creatures equal to your ability mod in the area that you can see. Those creatures take no dmg from the spell."
                    ]
                },
                {
                    "mods": [
                        "1/SR as a bonus action, you can roll a d20, record the result, and choose a creature within 30'. The next time that creature makes a d20 roll, it takes that d20 result instead of rolling.",
                        "You may use this bonus action again while it is on cooldown if you expend a spell slot."
                    ]
                },
                {
                    "mods": [
                        "On casting a levelled spell, you can immediately move up to 15' without provoking opp atks."
                    ]
                }
            ]
        },
        {
            "name": "Magic Robes",
            "source": "wizard - mage (a5e)",
            "mods": [
                "1/SR as an action, you can replace one of your prepared spells with another from your spellbook."
            ],
            "variables": []
        },
        {
            "name": "Dueling Wrap",
            "source": "fighter - duelist (a5e)",
            "mods": [],
            "variables": [
                {
                    "mods": [
                        "A number of times equal to your ability mod between long rests, when you spend exertion, you can reduce the cost by 1pt."
                    ]
                },
                {
                    "mods": [
                        "While you are wielding a Finesse or Parrying wep, you have +1 AC."
                    ]
                }
            ]
        },
        {
            "name": "Clockwork Wrap",
            "source": "sorcerer - clockwork soul",
            "mods": [
                "2/LR, whenever you a creature you can see within 60' of you is about to roll a d20 with either adv or disadv, you can react to make the roll regular."
            ],
            "variables": []
        },
        {
            "name": "Lunar Cloak",
            "source": "sorcerer - lunar magic",
            "mods": [
                "You learn the Sacred Flame cantrip. When you cast this spell, you can target up to 2 creatures in range that are adj to each other."
            ],
            "variables": []
        },
        {
            "name": "Draconic Silks",
            "source": "sorcerer - draconist (a5e)",
            "mods": [],
            "variables": [
                {
                    "mods": [
                        "+3 max HP."
                    ]
                },
                {
                    "mods": [
                        "You gain proficiency with Draconic.",
                        "You have adv on CHA checks while communicating with dragons in Draconic."
                    ]
                }
            ]
        },
        {
            "name": "Enigmatic Garb",
            "source": "sorcerer - enigma (a5e)",
            "mods": [],
            "variables": [
                {
                    "mods": [
                        "You gain an expertise die on ability checks made to identify spells being cast or sense the presence of lingering magic in any form."
                    ]
                },
                {
                    "mods": [
                        "As a bonus action, you can attempt to replace one of your prepared spells with another spell of the same or lower lvl from your spell list. This lasts until your next long rest. The new spell cannot be replaced again. To do so, declare which spell you're trying to replace and make a save with your ability (DC 10 + the spell's level).",
                        "If you fail the save, the spell you are attempting to replace is cast, expending no resources but targeting a creature or point within range of the DM's choice (possibly yourself). The spell is too wild to alter in any way (including from your equipment), and if it requires concentration it lasts its full duration with no concentration required instead. That spell is then unprepared until you finish a long rest."
                    ]
                }
            ]
        },
        {
            "name": "Divine Jacket",
            "source": "sorcerer - divine soul",
            "mods": [
                "1/SR, if you fail a save or atk, you can roll 2d4 and add it to the result, potentially changing the outcome."
            ],
            "variables": []
        },
        {
            "name": "Pyromantic Jacket",
            "source": "sorcerer - divine soul",
            "mods": [
                "On casting a lvl'd spell that can deal fire dmg, fiery magic erupts from you, causing all foes you can see within 10' of you to take 1 spell fire dmg."
            ],
            "variables": []
        },
        {
            "name": "Shadowed Cloak",
            "source": "adept - shadow",
            "mods": [
                "You learn the Minor Illusion cantrip."
            ],
            "variables": [
                {
                    "mods": [],
                    "variables": [
                        "As an action 1/SR, you can cast the Darkness spell.",
                        "As an action 1/SR, you can cast the Darkvision spell.",
                        "As an action 1/SR, you can cast the Pass Without Trace spell.",
                        "As an action 1/SR, you can cast the Silence spell."
                    ]
                }
            ]
        },
        {
            "name": "Sharp Wrap",
            "source": "adept - kensei",
            "mods": [
                "Gain proficiency in all weps that don't have the Heavy trait.",
                "Whenever you make an unarmed atk as part of the Attack action on your turn, you gain +2 AC until the start of your next turn.",
                "As a bonus action, you can grant your ranged wep atks with proficient weps +1d4 base dmg with their hits until the end of the turn."
            ],
            "variables": [
                {
                    "mods": [
                        "You gain an expertise die in Chronicle journey activities."
                    ]
                },
                {
                    "mods": [
                        "You gain an expertise die in Busk journey activities."
                    ]
                }
            ]
        },
        {
            "name": "Brawling Wrap",
            "source": "adept - brawler (a5e)",
            "mods": [
                "You gain proficiency with improvised weapons."
            ],
            "variables": [
                {
                    "mods": [
                        "On hit with an improvised weapon, you can spend 1 exertion to deal 1d4 additional base dmg."
                    ]
                },
                {
                    "mods": [
                        "On hit with an improvised weapon, you can spend 1 exertion to also use a basic maneuver against the target."
                    ]
                }
            ]
        },
        {
            "name": "Exalted Regalia",
            "source": "adept - exalted athlete (a5e)",
            "mods": [
                "+1d4 to physical ability checks.",
                "Whenever you fail a physical save, you can react to spend 2 exertion to reroll it."
            ],
            "variables": []
        },
        {
            "name": "Open Garb",
            "source": "adept - open hand",
            "mods": [
                "1/SR, on hit with an offhand weapon:"
            ],
            "variables": [
                {
                    "mods": [
                        "The target must make a DEX save or fall prone."
                    ]
                },
                {
                    "mods": [
                        "The target must make a STR save or be pushed 15' away from you."
                    ]
                },
                {
                    "mods": [
                        "The target cannot take reactions until the end of your next turn."
                    ]
                }
            ]
        },
        {
            "name": "Astral Vestment",
            "source": "adept - astral self",
            "mods": [
                "As a bonus action 1/SR, you can manifest astral energy around your arms. When you do so, all foes you can see within 10' of you must make a DEX save or take 2d4 force dmg. The energy remains for 10mins, or until you are knocked unconscious.",
                "You gain the following benefits while the energy surrounds your arms:",
                "- You can use your ability mod in place of your Strength mod for Strength checks and saves.",
                "- Your unarmed atks gain the Reach trait and their base dmg is converted to force.",
                "- You can use your ability for the atk and dmg rolls of your unarmed atks."
            ],
            "variables": []
        },
        {
            "name": "Solar Robes",
            "source": "adept - sun soul",
            "mods": [
                "In place of any number of your Attack action atks, you can make a ranged spell atk with 30' range, adding your ability mod to its atk and dmg rolls. It deals 1d4 rad dmg.",
                "As a bonus action 1/SR, after using this atk as part of your Attack action, you can use the atk again."
            ],
            "variables": []
        },
        {
            "name": "Long Robes",
            "source": "adept - long death",
            "mods": [
                "On KB vs adj creature, gain temp HP equal to 3 + your ability mod."
            ],
            "variables": []
        },
        {
            "name": "Pyromantic Wrap",
            "source": "wizard - pyromancer (a5e)",
            "mods": [],
            "variables": [
                {
                    "mods": [
                        "Whenever you cast a lvl'd spell that can deal fire dmg, you can choose one creature that would take dmg from the spell. Instead of taking dmg from the spell, the creature is healed for a number of hit points equal to 2 + the spell's lvl."
                    ]
                },
                {
                    "mods": [
                        "You can spend 10mins meditating while staring into a flame that fills at least a 5' cube to cast Augury for free."
                    ]
                }
            ]
        },
        {
            "name": "Legacy Vest",
            "source": "wizard - last raven (a5e)",
            "mods": [],
            "variables": [
                {
                    "mods": [
                        "You gain an expertise die in Sleight of Hand checks to pick locks.",
                        "1/LR, you can cast the Hex spell for free at the highest spell level you can cast.",
                        "Whenever you cast Hex, you may choose an ally within 120' of you. The cursed target takes extra damage from that ally's atks instead of your own."
                    ],
                    "variables": [
                        "You gain an expertise die in Deception and Intimidation.",
                        "You gain an expertise die in Sleight of Hand and Stealth."
                    ]
                },
                {
                    "mods": [
                        "You can prepare 1 additional spell at a time.",
                        "At the end of a rest, you can choose a creature within 60' that you are aware of, even through solid barriers. You gain knowledge of all spells the creature has prepared, and you can replace your bonus prepared spell with one of those spells.",
                        "Whenever a creature within 60' of you casts a spell, loses concentration on a spell, or has their spell countered/dispelled, you can replace your bonus prepared spell with that spell."
                    ]
                }
            ]
        },
        {
            "name": "Traveling Regalia",
            "source": "sorcerer - traveler (a5e)",
            "mods": [],
            "variables": [
                {
                    "mods": [
                        "You gain proficiency in Primordial.",
                        "You can use your ability for Survival and History checks to navigate, survive in, or remember information about non-Material planes."
                    ]
                },
                {
                    "mods": [
                        "After casting a levelled spell, you can teleport up to a number of feet to an unoccupied space you can see, equal to 5 + 5 times the level of the spell."
                    ]
                }
            ]
        },
        {
            "name": "Annihilating Silks",
            "source": "sorcerer - annihilator (a5e)",
            "mods": [],
            "variables": [
                {
                    "mods": [
                        "As an action, you can attempt to destroy a small obj you are touching, and that no one else is touching. Magic and adamantine objs are immune to this. To do so, make an ability check to smash the obj with your ability."
                    ]
                },
                {
                    "mods": [
                        "At the end of each of your turns, if any creature was reduced to 0 HP within 30' of you since your last turn, you can choose another creature within that range, and deal 1d10 force dmg to it."
                    ]
                }
            ]
        },
        {
            "name": "Ghetto Vestment",
            "source": "wizard - enclavist (a5e)",
            "mods": [],
            "variables": [
                {
                    "mods": [
                        "You gain an expertise die in Stealth.",
                        "You have the Sanctuary spell prepared."
                    ]
                },
                {
                    "mods": [
                        "As a bonus action 1/SR, you can magically bond yourself to an area extending in a 15' radius, declaring it your domain. The area shidts slightly into the Feywild, making it count as both its actual plane and the Feywild. The environment becomes imbued with your mysticism, sprouting glowing, shimmering flowers of exaggerated colours. You may suppress this visual quality if neither you nor any of your allies are taking hostile actions within the domain. When this is done, the domain's presence cannot be detected.",
                        "The area remains your domain until you move more than 3 miles away from it, or until you end it as an action. If you declare a new domain, your previous one is lost.",
                        "You and your allies have adv on Stealth checks within your domain. Non-allied creatures that cast Divination spells that would affect or learn about the domain or creatures within it must succeed on an ability check with their casting ability. If they fail, the spell reveals an innocuous result.",
                        "You can use your reaction to either grant advantage to a creature that you can see within your domain making a save, or cause a creature that you can see within the domain making an attack roll to do so with disadv.",
                        "Whenever you use an action, you may have the environment within your domain briefly come alive to deal 2 spell B dmg to a creature within your domain."
                    ]
                }
            ]
        },
        {
            "name": "Oozing Garb",
            "source": "wizard - oozemancer (a5e)",
            "mods": [],
            "variables": [
                {
                    "mods": [
                        "You have the Find Familiar spell prepared. When you cast it, in addition to its usual options, you can choose a Grey Ooze for the familiar's form.",
                        "Whenever you take the Attack aciton, you can forgo one of your own attacks to allow your familiar to make an attack of its own.",
                        "Your ooze minions have a minimum speed of 25'."
                    ]
                },
                {
                    "mods": [
                        "Whenever you receive a critical hit, the hit is treated as a normal hit instead.",
                        "You are immune to Sneak Attack damage.",
                        "You have advantage on ability checks and saves made to escape grapples."
                    ]
                }
            ]
        },
        {
            "name": "Warring Cloak",
            "source": "adept - warrior monk (a5e)",
            "mods": [
                "Whenever you use a maneuver that requires a weapon with a particular trait, your unarmed attacks count as having that trait."
            ],
            "variables": []
        },
        {
            "name": "Running Silks",
            "source": "adept - durala carao (a5e)",
            "mods": [],
            "variables": [
                {
                    "mods": [
                        "You gain proficiency with bow weapons.",
                        "You can use any melee-requiring maneuver with attacks from bow weapons.",
                        "Being adj to a foe doesn't impose disadv on your bow weapon atks."
                    ]
                },
                {
                    "mods": [
                        "You can reroll crit fails on any bow weapon atk.",
                        "You can draw and stow bow weapons as a free action.",
                        "You ignore the Loading trait on bow weapons."
                    ]
                }
            ]
        },
        {
            "name": "Arachnid Robes",
            "source": "adept - arachnid guardian (a5e)",
            "mods": [
                "You gain an expertise die in Stealth and Perception.",
                "You can move through any webs without treating them as diff terrain or risking becoming stuck.",
                "You gain +10' of tremorsense."
            ],
            "variables": []
        },
        {
            "name": "Quickstepping Robes",
            "source": "adept - quickstepper (a5e)",
            "mods": [],
            "variables": [
                {
                    "mods": [
                        "The robes have a number of charges equal to your ability mod, all of which are recovered after a long rest.",
                        "After observing a creature in combat for at least 1 round, you can expend a charge to make a quip at it. Make an Intimidation check opposed by the WIS save of a creature within 30' that can hear and understand you. On a fail, it is taunted by you and must take offensive actions when possible. On a sub fail, the creature also has disadv Offence while taunted in this way.",
                        "While a creature is taunted in this way, you can also take the Dodge action as a bonus action.",
                        "The taunt ends after the creature hits you, when you offensively target a different creature, or if the creature is unable to take an offensive action against you."
                    ]
                },
                {
                    "mods": [
                        "You gain an expertise die in Intimidation.",
                        "You can always use your ability for Intimidation checks."
                    ]
                }
            ]
        }
    ],
    "light": [
        {
            "name": "Stewarding Vest",
            "source": "savant - steward",
            "mods": [
                "As a bonus action, you can communicate one of your features to a creature of your choice who can understand you within 10' of you. Before the end of your next turn, the first time that feature would be relevant for the target, it affects them as if it were their feature (still using your abilities for any calculations). If the feature has a cooldown or resource cost, you expend it as usual even if only the target benefits from the feature."
            ]
        },
        {
            "name": "Vocal Tunic",
            "source": "savant - vox",
            "mods": [
                "As an action, you can trigger any effects that would usually trigger from a melee wep atk/hit on a creature that can understand you within 30'."
            ],
            "variables": []
        },
        {
            "name": "Scouting Raiment",
            "source": "rogue - scout",
            "mods": [
                "You can move up to half your speed as a reaction when a hostile creature ends its turn adj to you. This movement does not provoke opp atks."
            ],
            "variables": []
        },
        {
            "name": "Soulful Jerkin",
            "source": "rogue - soulknife",
            "mods": [],
            "variables": [
                {
                    "mods": [
                        "You have 4 Energy dice, which are d6s. You regain all expended Energy dice whenever you finish a long rest.",
                        "As a bonus action, you may replenish 1 Energy die. You cannot do so again until you complete a short or long rest."
                    ],
                    "variables": [
                        "If you fail an ability check using a skill with which you have prof, you can roll an Energy die and add the result to the check. You expend the die only if the check succeeds.",
                        "As an action, choose a number of creatures you can see up to your prof bonus, then roll an Energy die. For a number of hrs equal to the result, the chosen creatures can speak telepathically with you while you are within 1 mile of each other, and vice-versa. A creature can only use this telepathy if it can speak a language, and a creature can end the connection at any time. The first time you use this power after each long rest, you don't expend the Energy die, but all other times it is expended."
                    ]
                },
                {
                    "mods": [
                        "Whenever you take the Attack action, you may replace the base properties of your onhand weapon with a psychic blade that shimmers over it.",
                        "The psychic blade deals 1d6 psy dmg, has the finesse and thrown (60'/60') traits, and leaves no signs of physical dmg on its targets.",
                        "After attacking with the psychic blade, you can replace the base properties of your offhand weapon with another one as a bonus action, making an offhand weapon attack with this new blade. It has the same properties as the onhand blade, but deals 1d4 dmg instead.",
                        "The blades disappear at the end of your turn."
                    ]
                }
            ]
        },
        {
            "name": "Swift Raiment",
            "source": "marshal - swift strategist",
            "mods": [],
            "variables": [
                {
                    "mods": [
                        "Whenever an ally starts its turn within 10' of you, their speed is increased by 5' until the end of their turn."
                    ]
                },
                {
                    "mods": [
                        "Once per round when you take the Attack action, you can forgo making 1 atk to allow an ally within 10' of you to move up to half its speed without provoking opp atks."
                    ]
                },
                {
                    "mods": [
                        "Your speed increases by 10' if you are not holding a shield.",
                        "Whenever your movement would provoke an opp atk, the atk has disadv."
                    ]
                }
            ]
        },
        {
            "name": "Inquisitive Garb",
            "source": "rogue - inquisitive",
            "mods": [],
            "variables": [
                {
                    "mods": [
                        "Whenever you make an Insight check to determine whether a creature is lying, treat a roll of 7 or lower on the d20 as an 8."
                    ]
                },
                {
                    "variables": [
                        "You have advantage on Perception checks to spot a hidden creature or object.",
                        "You have advantage on Investigation checks to uncover or decipher clues."
                    ]
                },
                {
                    "mods": [
                        "As a bonus action, you can make an Insight check against a creature you can see that is not incapacitated, contested by the target's Deception check. If you succeed, you count as flanking them.",
                        "This benefit lasts for 1 minute or until your successfully use this power against a different target."
                    ]
                }
            ]
        },
        {
            "name": "Arcane Raiment",
            "source": "rogue - arcane trickster",
            "mods": [
                "Whenever you cast Mage Hand, you can make the spectral hand invisible.",
                "You can use your Cunning Action to control the Mage Hand.",
                "You can perform the following task with Mage Hand. If you succeed on a Sleight of Hand check contested by another creature's Perception check, you can make the task unnoticed by that creature."
            ],
            "variables": [
                {
                    "mods": [
                        "You can stow one object the hand is holding in a container worn or carried by another creature."
                    ]
                },
                {
                    "mods": [
                        "You can retrieve an obj in a container worn or carried by another creature."
                    ]
                },
                {
                    "mods": [
                        "You can pick locks and disarm traps with the hand as if you were doing it yourself."
                    ]
                }
            ]
        },
        {
            "name": "Ravenplume Vest",
            "source": "warlock - raven queen",
            "mods": [
                "You have a Raven spirit minion that you can command telepathically while within 100' of it.",
                "While the Raven is perched on your shoulder, you gain 30' of darkvision and a bonus to your Perception equal to your ability mod. It also cannot take dmg or be targeted by any effect other than your spells, and is incap.",
                "You can see and hear through the Raven while it is within 100' of you.",
                "If the Raven is killed, you gain adv on all atk rolls against the killer until your next long rest.",
                "The Raven can awaken you from sleep as a bonus action, and doesn't need its own sleep.",
                "At the end of a rest, you can resurrect a dead Raven into an empty adj space."
            ],
            "variables": []
        },
        {
            "name": "Great Tunic",
            "source": "warlock - great old one",
            "mods": [
                "You can telepathically speak to any creature you can see within 30'. They must be able to understand at least one language to understand your communication."
            ],
            "variables": []
        },
        {
            "name": "Satirical Tunic",
            "source": "bard - satire",
            "mods": [],
            "variables": [
                {
                    "mods": [
                        "You gain an expertise die in Sleight of Hand and Persuasion."
                    ]
                },
                {
                    "mods": [
                        "As a bonus action, you can tumble to gain the following benefits for the rest of your turn:",
                        "You gain the benefits of the Dash and Disengage actions.",
                        "You gain a climb speed equal to your speed.",
                        "You gain 50% resistance to fall dmg."
                    ]
                }
            ]
        },
        {
            "name": "Spiritual Garb",
            "source": "bard - spirits",
            "mods": [],
            "variables": [
                {
                    "mods": [
                        "You learn the Guidance cantrip, which gains a range of 60'."
                    ]
                },
                {
                    "mods": [
                        "As a bonus action a number of times between long rests equal to half your ability mod while you are holding a conduit weapon, you can roll a d6 to hear a tale from the spirits around you. You then retain the tale in your memory until you complete a short or long rest, or you grant the tale's effects to a creature. You can only retain 1 tale at a time.",
                        "As an action, you can grant a creature of your choice within 30' of you the effects of the tale in your mind.",
                        "1. Tale of the Clever Animal: for the next 10mins, whenever the target makes a mental ability check, they can roll an additional d6 after rolling the d20 to add to the result.",
                        "2. Tale of the Renowned Duelist: make a touch spell atk against the target, dealing force dmg equal to 2d6 + your ability mod.",
                        "3. Tale of the Beloved Friends: The target and another creature of its choice it can see adj to it gains temp HP equal to 1d6 + your ability mod.",
                        "4. Tale of the Runaway: The target can immediately react to teleport up to 30' to an empty space it can see. When it does so, it can choose a number of creatures it can see within 30' of it up to half your ability mod to immediately use the same reaction.",
                        "5. Tale of the Avenger: For 1min, any creature that hits the target with a melee atk takes 1d6 force dmg.",
                        "6. Tale of the Traveler: The target gains 1d6 + 3 temp HP. While it has this temp HP, its speed increases by 10' and it gains +1 AC."
                    ]
                }
            ]
        },
        {
            "name": "Alien Garb",
            "source": "warlock - alienist (a5e)",
            "mods": [],
            "variables": [
                {
                    "mods": [
                        "As a bonus action 1/SR, you can curse a creature you can see within 30' of you for 1min or until you go down.",
                        "Whenever you deal dmg to the cursed target, it takes +1d4 psy dmg.",
                        "You gain a pool of beyond points, which begins empty and is emptied when you complete a short or long rest. Whenever the cursed creature fails a save, gain 1 beyond point.",
                        "Whenever you make a save, you can spend 1 beyond point to add 1d4 to the roll."
                    ]
                },
                {
                    "mods": [
                        "+30' telepathy.",
                        "1/SR, on casting a spell, you can do so psionically, removing the need for verbal and somatic components."
                    ]
                }
            ]
        },
        {
            "name": "Diabolical Coat",
            "source": "warlock - diabolist (a5e)",
            "mods": [],
            "variables": [
                {
                    "mods": [
                        "On KB, or a creature under one of your spell effects is reduced to 0 HP, you gain temp HP equal to 3 + your ability mod."
                    ]
                },
                {
                    "mods": [
                        "As a bonus action 1/SR, you can curse a creature you can see within 30' of you for 1min or until you go down.",
                        "When the cursed creature dies, you heal HP equal to 3 + your ability mod.",
                        "Whenever you deal dmg to the cursed target, it takes +1d4 $nonPhysType dmg."
                    ]
                }
            ]
        },
        {
            "name": "Legendary Tunic",
            "source": "bard - lore",
            "mods": [],
            "variables": [
                {
                    "mods": [],
                    "variables": [
                        "You gain an expertise die in Stealth, Medicine, and Arcana.",
                        "You gain an expertise die in Sleight of Hand, Animal Handling, and Survival.",
                        "You gain an expertise die in Survival, History, and Medicine."
                    ]
                },
                {
                    "mods": [
                        "The tunic has a number of charges equal to half your ability mod, all of which are recovered after a long rest.",
                        "Whenever a creature that can hear you and that you can see within 60' of you makes an atk roll, ability check, or dmg roll, you can react and expend a charge to use your wit to distract, confuse, or otherwise sap the confidence and competence from them, rolling a d6 and subtracting the amount rolled from the creature's roll. You can choose to do this after the roll is made, but before its result is announced. Creatures immune to charm are unaffected by this."
                    ]
                }
            ]
        },
        {
            "name": "Glamorous Vest",
            "source": "bard - glamour",
            "mods": [],
            "variables": [
                {
                    "mods": [
                        "The vest has a number of charges equal to half your ability mod, all of which are recovered after a long rest.",
                        "As a bonus action, you can expend a charge to grant yourself a wondrous appearance. When you do so, choose a number of creatures you can see and that can see you within 60' of you, up to a number equal to your ability mod. Each of them gains 5 temp HP and can immediately use its reaction to shift up to its speed."
                    ]
                },
                {
                    "mods": [
                        "1/SR, after performing for at least 1min, you can attempt to inspire wonder in your audience by singing, reciting a poem, or dancing. At the end of the performance, choose a number of humanoids within 60' of you who watched and listened to all of it, up to a number equal to your ability mod. Each target must succeed on a WIS save or be charmed by you. On a success, a creature does not know you tried to charm it.",
                        "While charmed in this way, a creature idolises you, speaks glowingly of you to anyone who talks to it, and hinders anyone who opposes you, although it avoids violence unless it was already inclined to fight on your behalf. This ends on a target after 1hr, if it takes any dmg, if you atk it, or if it witnesses you atking or dmging any of its allies."
                    ]
                }
            ]
        },
        {
            "name": "Eloquent Jerkin",
            "source": "bard - eloquence",
            "mods": [],
            "variables": [
                {
                    "mods": [
                        "Whenever you make a Persuasion or Deception check, you can treat a d20 roll of 9 or lower as a 10."
                    ]
                },
                {
                    "mods": [
                        "The jerkin has a number of charges equal to half your ability mod, all of which are recovered after a LR.",
                        "As a bonus action, you can expend a charge to choose a creature you can see within 60' of you to be unsettled by your magic-laced words. The target must subtract 1d6 from the next save it makes before the start of your next turn."
                    ]
                }
            ]
        },
        {
            "name": "Creative Leather",
            "source": "bard - creation",
            "mods": [],
            "variables": [
                {
                    "mods": [
                        "The leather has a number of charges equal to your ability mod, all of which are recovered after a LR.",
                        "As a bonus action, you can expend a charge to grant an ally within 60' of you who can hear you a mote of potential. A creature can only have 1 mote of potential at a time."
                    ],
                    "variables": [
                        "Whenever a creature with a mote of potential makes an ability check, they can expend the mote to roll a d6 with adv to add to their check.",
                        "Whenever a creature with a mote of potential makes an atk, they can expend the mote to shatter it, causing all creatures of your choice adj to the target to pass a CON save or take 1d6 thunder dmg.",
                        "Whenever a creature with a mote of potential makes a save, they can expend the mote to gain temp HP equal to 1d6 + your ability mod."
                    ]
                },
                {
                    "mods": [
                        "As an action 1/LR, you can create a mundane obj of your choice in an empty space within 10' of you. It must appear on a surface or in a liquid that can support it. The item must be Medium or smaller, glimmers softly, and a creature can faintly hear music when touching it. The item disappears after 2hrs.",
                        "You can expend a spell slot of 2nd lvl or higher to recover the use of this power.",
                        "You can only have 1 item created in this way at a time."
                    ]
                }
            ]
        },
        {
            "name": "Legendary Leather",
            "source": "bard - loremaster (a5e)",
            "mods": [
                "The leather has a number of charges equal to half your ability mod, all of which are recovered after a long rest.",
                "Whenever a creature you can see within 60' of you makes a d20 roll, you can expend a charge to subtract a d6 from the roll. If you roll a 1 or 6 on this d6, the creature is rattled until the end of your next turn.",
                "You can choose to use this effect after the d20 roll is made, but before its result is announced.",
                "Creatures that cannot hear you or are immune to being charmed are unaffected by this effect."
            ],
            "variables": []
        },
        {
            "name": "Entertaining Jerkin",
            "source": "bard - minstrel (a5e)",
            "mods": [
                "The jerkin has a number of charges equal to your ability mod, all of which are recovered after a long rest.",
                "As a bonus action, you can expend a charge to grant entertainment to an ally within 60' of you who can hear you. A creature can only have entertainment once at a time.",
                "Whenever a creature with entertainment starts its turn with a debuff that it will make an ongoing save against at its turn's end, it can expend its entertainment to instead make the save now.",
                "You can grant yourself entertainment, but instead of its usual effects, it can be expended when you make a Performance check to add 1d6 to the check."
            ],
            "variables": []
        }
    ],
    "medium": [
        {
            "name": "Starlit Brigandine",
            "source": "druid - stars",
            "mods": [],
            "variables": [
                {
                    "mods": [
                        "You learn the Guidance cantrip.",
                        "You learn the Guiding Bolt spell and always have it prepared. You can also cast it twice without expending any resources. You recover these uses whenever you finish a long rest."
                    ]
                },
                {
                    "mods": [
                        "As a bonus action, you can shapeshift into a celestial form for 10 minutes, or until you dismiss it early or are incapacitated. You can do this once between long rests. While in your celestial form, you shed bright light in a 20' radius and dim light for an additional 20'."
                    ],
                    "variables": [
                        "While in your celestial form, a constellation of an archer appears above you. When you enter this form and as a bonus action on subsequent turns while it lasts, you can make a ranged spell attack using the archer's bow against a creature within 60' of you. On a hit, it deals radiant dmg equal to 1d8 + your ability modifier.",
                        "While in your celestial form, a constellation of a chalice appears above you. Whenever you cast a levelled spell that restores hit points to a creature while in this form, you or another creature within 30' of you can regain hit points equal to 1d8 + your ability modifier.",
                        "While in your celestial form, a constellation of a dragon appears above you. While in this form, whenever you make an INT or WIS check, or a CON save to maintain concentration on a spell, you can treat a roll of 9 or lower on the d20 as a 10."
                    ]
                }
            ]
        },
        {
            "name": "Lunar Chainmail",
            "source": "druid - moon",
            "mods": [],
            "variables": [
                {
                    "mods": [
                        "Shapeshifting powers you have that take a standard action now only take a bonus action.",
                        "While shapeshifted, you may spend a bonus action and 1 spell slot to heal 1d8 hit points per level of the slot expended."
                    ]
                },
                {
                    "mods": [
                        "When you shapeshift based on CR, you can shapeshift into a creature 2 CRs higher than usual."
                    ]
                }
            ]
        },
        {
            "name": "Spiked Hauberk",
            "source": "berserker - battlerager",
            "mods": [
                "This hauberk has 3 charges, all of which are recovered whenever you finish a long rest.",
                "Whenever you roll for initiative, you can choose to expend one of the hauberk's charges to have spikes portrude from it for 1 minute.",
                "While the spikes are active, you can use a bonus action to make a melee weapon attack with the hauberk against a target within 5' of you. If it hits, it deals piercing dmg equal to 1d4 + your ability modifier.",
                "Whenever you successfully use the Grapple maneuver while the spikes are active, it deals 3 additional piercing damage."
            ],
            "variables": []
        },
        {
            "name": "Totemic Vest",
            "source": "berserker - totem warrior",
            "mods": [],
            "variables": [
                {
                    "mods": [
                        "You can cast the Speak with Animals spell at no cost."
                    ]
                },
                {
                    "mods": [
                        "This vest has 3 charges, all of which are recovered whenever you finish a long rest.",
                        "Whenever you roll for initiative, you can choose to expend one of the vest's charges to adopt a bestial form for 1 minute."
                    ],
                    "variables": [
                        "While in your bestial form, you have 50% resistance to all non-psychic damage.",
                        "While in your bestial form, opportunity attacks have disadvantage against you, and you can take the Dash action as a bonus action on your turns.",
                        "While in your bestial form, your speed increases by 15'.",
                        "While in your bestial form, add 10' to your long jump distance and 3' to your high jump distance.",
                        "While in your bestial form, melee attacks against any creatures of your choice adjacent to you have advantage."
                    ]
                }
            ]
        },
        {
            "name": "Vanguardian Ringmail",
            "source": "savant - vanguard",
            "mods": [],
            "variables": [
                {
                    "mods": [
                        "You have proficiency with all martial weapons."
                    ]
                },
                {
                    "mods": [
                        "Features and effects that trigger from your melee weapon attacks now also trigger from ranged weapon attacks against targets within 30'."
                    ]
                }
            ]
        },
        {
            "name": "Bestial Chainmail",
            "source": "ranger - beast trainer",
            "mods": [],
            "variables": [
                {
                    "mods": [
                        "You gain an expertise die in Animal Handling."
                    ]
                },
                {
                    "mods": [
                        "You have a CR 1/4 medium Beast minion. You must use a bonus action to command it, or an ally can do so as a bonus action with a successful DC 10 Animal Handling check.",
                        "If the minion dies, you can revive it as an action and a 1st-lvl spell slot. It returns to full hit points 1min later."
                    ]
                }
            ]
        },
        {
            "name": "Warding Brigandine",
            "source": "ranger - grove warden",
            "mods": [],
            "variables": [
                {
                    "mods": [
                        "Any effect that allows you to sense or detect certain creature types now also works on humanoids, and tells you their general direction, and roughly how many humanoids are together (1, 2-5, or 6+)."
                    ]
                },
                {
                    "mods": [
                        "As a bonus action, you can choose a creature you can see within 60' of you. Your next wep atk against that creature has adv as you draw on the essence of the land to hamper them.",
                        "If this enhanced atk hits, the target's sp is reduced by 10' until the start of your next turn."
                    ]
                }
            ]
        },
        {
            "name": "Engineered Hauberk",
            "source": "artificer - engineer (a5e)",
            "mods": [],
            "variables": [
                {
                    "mods": [
                        "Gain proficiency in piloting air, land, and water vehicles."
                    ]
                },
                {
                    "mods": [
                        "With 8hrs of uninterrupted work, you can craft a custom vehicle. You can only have 1 at once (on creating a new one, the previous one crumbles from disrepair).",
                        "During any LR, you can restore your custom vehicle to full HP and remove any malfunctions.",
                        "The vehicle is your choice of Medium or Large, has AC equal to 10 + your ability mod, 25 HP, and a speed of 30'. It can only carry 1 crew and has the Personal trait."
                    ],
                    "variables": [
                        "The vehicle's AC increases by 2.",
                        "The vehicle ignores diff terrain.",
                        "1/LR, as a bonus action while piloting the vehicle, you can increases its speed by 30' for 1min.",
                        "The vehicle can take the Stop action even with momentum, but loses all momentum upon doing so.",
                        "On LR end, you can expend a spell slot to give the vehicle the ability to cast one of your spells of that lvl. Instead of consuming the spell slot, the vehicle gains an Integrity malfunction each time it casts the spell.",
                        "The vehicle gains a climb sp of 30'.",
                        "The vehicle's sp increases to 50'.",
                        "The vehicle loses its Personal trait, and can carry you plus 1 Medium or smaller passenger.",
                        "Whenever a collision occurs with the vehicle, the dmg it takes is reduced by 1d6, and dmg dealt to other impacted objs and vehicles is increased by 2d6.",
                        "The vehicle becomes a water vehicle with a swim sp of 30' in addition to being a land vehicle. It swaps between types depending on the terrain it is travelling on.",
                        "You gain +2 AC while piloting the vehicle."
                    ]
                }
            ]
        },
        {
            "name": "Stiched Brigandine",
            "source": "artificer - stitcher",
            "mods": [],
            "variables": [
                {
                    "mods": [
                        "Gain an expertise die in Crafting Creation checks for helms, gloves, and boots."
                    ]
                },
                {
                    "mods": [
                        "With 8hrs of uninterrupted work on a humanoid corpse that has been dead no longer than 24hrs, you can create a flesh minion. You can only have 1 at a time.",
                        "The minion can only atk on its own as a reaction to being atk'd. It can take other actions as normal, and makes death saves on reaching 0 hit points instead of dying outright. As a bonus action, you can command the minion to take any action.",
                        "The minion uses the stats of a Zombie, but its type is Monstrosity, it gains 6 temp HP on init roll, its AC, AB, and dmg are each increased by 2, and it recovers all hit points at the end of a long rest."
                    ],
                    "variables": [
                        "The minion does not make death saves, and instead explodes and is destroyed upon going down. Creatures within 10' of the minion must make a DEX save or take 2d6 psn dmg, or half as much on a success.",
                        "The minion requires an additional similar humanoid corpse to be created, and it has 2 additional arms, granting it a climb sp of 20'. Additionally, its maneuver DC for escaping its grapples increases by your ability mod.",
                        "The minion requires an additional similar humanoid corpse to be created, and it has 2 additional legs, granting it +15' of speed.",
                        "Make a sleight of hand check upon creating the minion. Creatures must make a Perception check of DC equal to your result to visually determine that the minion is a monstrosity and not a regular person.",
                        "On LR end, you can expend a spell slot to give the minion the ability to cast one of your spells with your commanding bonus action. It can only do so once.",
                        "On LR end, you can graft a 1h melee wep onto the minion to replace its basic Slam atk with that, which has the same AB. This replaces one of its hands, so it can no longer use the Grapple maneuver.",
                        "The minion's Slam inflicts a 1d6 nec DoT that persists until the target regains HP or an action is used on it to pass a DC 15 Medicine check.",
                        "Whenever the minion is hit by a melee atk, it inflicts 1d6 light thorns dmg on the offender.",
                        "The minion's AC increases by 2.",
                        "The minion can take the Dash action as its bonus action, but cannot do so again until it moves 0' on a turn."
                    ]
                }
            ]
        },
        {
            "name": "Sharp Vest",
            "source": "bard - swords",
            "mods": [],
            "variables": [
                {
                    "mods": [
                        "You gain proficiency with sword weapons.",
                        "All melee weapons you are proficient with gain the Conduit trait."
                    ]
                },
                {
                    "mods": [],
                    "variables": [
                        "While you are wielding a 1h melee wep and no other wep, you deal +2 dmg with that wep.",
                        "While dual-wielding, you can add your ability modifier to your offhand's dmg."
                    ]
                },
                {
                    "mods": [
                        "Whenever you take the Attack action on your turn, your speed increases by 10' until the end of the turn."
                    ],
                    "variables": [
                        "A number of times equal to half your ability mod between long rests, on hit with an atk from your Attack action, you may roll a d6 and add its result to both the hit's dmg and your AC until your next turn.",
                        "A number of times equal to half your ability mod between long rests, on hit with an atk from your Attack action, you may roll a d6 and add its result to the hit's dmg, then you may also push the target up to 5' away from you, plus a number of feet equal to the d6's result. You may then immediately use your reaction to move up to your speed to an empty space adj to the target.",
                        "A number of times equal to half your ability mod between long rests, on hit with an atk from your Attack action, you may roll a d6 and add its result to the hit's dmg, then you may also deal that much dmg to another creature of your choice adj to you that you can see."
                    ]
                }
            ]
        },
        {
            "name": "Primeval Chainmail",
            "source": "druid - primeval",
            "mods": [],
            "variables": [
                {
                    "mods": [
                        "You gain an expertise die in History.",
                        "Whenever you make a History check, you can roll a d4 and add it to the check."
                    ]
                },
                {
                    "mods": [
                        "As an action 1/SR, you can summon a Primeval Companion, a CR 1/2 beast minion. The companion requires your bonus action to be commanded, otherwise just taking the Dodge action each turn. The exception to this is if you are unconscious, when the companion can be controlled without your bonus action."
                    ]
                }
            ]
        },
        {
            "name": "Shepharding Scale",
            "source": "druid - shepherd",
            "mods": [],
            "variables": [
                {
                    "mods": [
                        "You gain prof in Sylvan.",
                        "Beasts can understand your speech and you can decipher their noises and motions. Most beasts lack the INT to convey or understand sophisticated concepts, but a friendly beast could relay what it has seen or heard in the recent past."
                    ]
                },
                {
                    "mods": [
                        "As a bonus action 1/SR, you can conjure an incorporeal spirit in a space you can see within 60' of you.",
                        "As a bonus action, you can move the spirit up to 60' to a point you can see.",
                        "The spirit disappears if you are knocked unconscious, or after 1min."
                    ],
                    "variables": [
                        "The spirit is a bear's. You and your allies within 30' of the spirit when it appears gain 8 temp HP. In addition, while inside this area, you and your allies gain adv on STR checks and saves.",
                        "The spirit is a hawk's. Whenever a creature makes an atk roll against a target within 30' of the spirit, you can react to grant the atk adv. Additionally, you and your allies have adv on Perception checks while within this area.",
                        "The spirit is a unicorn's. You and your allies have adv on all ability checks made to detect creatures within 30' of the spirit. Additionally, if you cast a levelled spell that restores HP to a creature, each creature of your choice within this area also regains 3 HP."
                    ]
                }
            ]
        },
        {
            "name": "Bestial Ringmail",
            "source": "berserker - beast",
            "mods": [
                "As a bonus action 3/LR, you can shapeshift into a beast-hybrid form. This shapeshift lasts until you are knocked unconcscious, or for 1min.",
                "While shapeshifted in this way, you manifest a natural weapon based on STR."
            ],
            "variables": [
                {
                    "mods": [
                        "Your mouth becomes a bestial muzzle or great mandibles, which deal 1d8 P dmg.",
                        "Once per turn, when you dmg a creature with this bite atk while bloodied, you regain hit points equal to your prof bonus."
                    ]
                },
                {
                    "mods": [
                        "Your hands become claws, which subsume your weapons and take on their enchantments. They deal 1d6 S dmg.",
                        "Once per turn, whenever you atk with this claw as part of your Attack action, you can make an additional claw atk."
                    ]
                },
                {
                    "mods": [
                        "You grow a lashing, spiny tail, which deals 1d8 P dmg and has the Reach trait.",
                        "Whenever a creature you can see within 10' of you hits you with an atk, you can react to roll a d8 and add that amount to your AC for the atk, by defending with your tail."
                    ]
                }
            ]
        },
        {
            "name": "Wild Scale",
            "source": "berserker - wild magic",
            "mods": [],
            "variables": [
                {
                    "mods": [
                        "As an action 2/LR, you can know the location of any spell or magic item within 60' of you that isn't behind total cover, until the end of your next turn. When you sense a spell in this way, you learn which school of magic it belongs to."
                    ]
                },
                {
                    "mods": [
                        "As a bonus action 3/LR, you can trigger a random magical effect using the following results:",
                        "1. Shadowy tendrils lash around you. Each foe you can see within 30' must make a CON save or take 1d12 nec dmg. You then gain 1d12 temp HP.",
                        "2. You teleport up to 30' to an empty space you can see. For the next min, you can use this effect again on each of your turns as a bonus action.",
                        "3. An intangible spirit appears within 5' of a creature of your choice that you can see within 30' of you. At the end of the current turn, the spirit explodes, and each creature adj to it must pass a DEX save or take 1d6 force dmg. For the next minute, you can use this effect again on each of your turns as a bonus action. This counts as minion dmg.",
                        "4. Magic infuses 1 wep of your choice that you are wielding. For the next minute, the weapon's dmg type changes to force and it gains the Dual-wielding and Thrown (20'/60') traits.",
                        "5. Whenever a creature hits you with an atk during the next minute, that creature takes 1d6 force dmg as magic lashes out in retribution.",
                        "6. For the next minute, you are surrounded by multi-coloured, protective lights which grant you and allies within 10' of you +1 AC.",
                        "7. Flowers and vines temporarily grow around you. For the next minute, the ground within 15' of you is diff terrain for your foes.",
                        "8. A bolt of light shoots from your chest. Another creature of your choice that you can see within 30' of you must pass a CON save or take 1d6 rad dmg and be blinded until the start of your nest turn. For the next minute, you can repeat this effect on each of your turns as a bonus action."
                    ]
                }
            ]
        },
        {
            "name": "Subconscious Chainmail",
            "source": "druid - dreams",
            "mods": [
                "You have a pool of fey energy represented by 3 d6s, all of which you recover on a long rest.",
                "As a bonus action, you can choose a creature you can see within 120' of you and expend and roll a fey die. The target regains a number of hit points equal to the total, then gains 1 temporary hit point."
            ],
            "variables": []
        },
        {
            "name": "Fungal Chainmail",
            "source": "druid - spores",
            "mods": [],
            "variables": [
                {
                    "mods": [
                        "You are surrounded by invisible, necrotic spores that are harmless until you unleash them. You have a 10' aura surrounding you. Whenever a creature you can see is in the aura, you can react to deal 1d4 nec spell dmg to them unless they succeed on a CON save."
                    ]
                },
                {
                    "mods": [
                        "As an action 1/SR, you can awaken invisible, necrotic spores surrounding you. You gain 12 temp HP, your auras always deal critical dmg, and your melee wep hits deal an additional 1d6 nec dmg. This lasts for 10mins, or until you lose all the temp HP."
                    ]
                }
            ]
        },
        {
            "name": "Gloaming Doublet",
            "source": "ranger - gloom stalker",
            "mods": [],
            "variables": [
                {
                    "mods": [
                        "You gain initiative equal to your ability mod.",
                        "During your first turn of a combat, you have +10' speed.",
                        "If you take the Attack action during your first turn of a combat, you can make an additional wep atk as part of the action, which deals 1d8 additional base dmg."
                    ]
                },
                {
                    "mods": [
                        "+60' darkvision.",
                        "While in darkness, you are invis to creatures that rely on darkvision to see you."
                    ]
                }
            ]
        },
        {
            "name": "Hunting Vest",
            "source": "ranger - hunter",
            "mods": [],
            "variables": [
                {
                    "mods": [
                        "1/turn, +1d8 wep dmg vs bloodied targets."
                    ]
                },
                {
                    "mods": [
                        "On block vs an adj Large+ creature you can see, you can react to make an atk against the atker."
                    ]
                },
                {
                    "mods": [
                        "1/round, on making a wep atk on your turn, you can make another atk with the same wep against another target adj to the original, so long as you could have atk'd them with the original atk."
                    ]
                }
            ]
        },
        {
            "name": "Bestial Doublet",
            "source": "ranger - beastmaster (a5e)",
            "mods": [
                "After someone in your party scores a sub success on the Befriend Creature journey activity, you gain a random beast minion of CR 1/4. It acts of its own volition, but is an ally to you and your party. You can only have 1 at a time. The beast has 2 additional AC.",
                "On init, the beast gains 6 temp HP.",
                "As a bonus action on your turn, you can order the beast to take a specific action on its turn. If the action involves any attacks, they add 2 to their atk and dmg rolls for those atks."
            ],
            "variables": []
        },
        {
            "name": "Guarding Ringmail",
            "source": "druid - guardian (a5e)",
            "mods": [],
            "variables": [
                {
                    "mods": [
                        "You learn the Druidcraft cantrip, and whenever you cast it you can choose any of the following additional effects:",
                        "- You can magically convey a simple concept to a beast or plant.",
                        "- You can alter the weather within a 10' range of yourself by 1 step as per the Control Weather spell.",
                        "- You can make a Medicine check to stabilise a dying creature."
                    ]
                },
                {
                    "mods": [
                        "You gain an expertise die in Persuasion.",
                        "You may always use your ability when making Persuasion checks."
                    ]
                },
                {
                    "mods": [
                        "You gain an expertise die in Harvest journey activity checks and ignore any penalties from weather on them.",
                        "1/turn, you can drink a potion as a free action. Alternatively, you can administer a potion to another creature as a bonus action."
                    ]
                }
            ]
        },
        {
            "name": "Shifting Vest",
            "source": "druid - skinchanger (a5e)",
            "mods": [],
            "variables": [
                {
                    "mods": [
                        "Whenever you shapeshift into a creature with its own HP pool, you double its HP.",
                        "Add your ability mod to your AC while shapeshifted."
                    ]
                },
                {
                    "mods": [
                        "When you shapeshift based on CR, you can shapeshift into a creature 1 CR higher than usual."
                    ]
                }
            ]
        },
        {
            "name": "Terran Doublet",
            "source": "druid - land",
            "mods": [
                "1/LR, at the end of a short rest, you can recover 2 spell slot lvls."
            ],
            "variables": []
        },
        {
            "name": "Twilit Chainmail",
            "source": "druid - twilight",
            "mods": [
                "You have a pool of 3 energy points, all of which are recovered at the end of a long rest.",
                "Whenever you roll damage for a spell, you can expend an energy point to add 1d10 nec dmg to the spell.",
                "If a spell augmented in this way kills any number of creatures, you or an ally you can see within 30' of you heals 2 HP, or 5 HP if any of the killed creatures were undead."
            ],
            "variables": []
        },
        {
            "name": "Raging Vest",
            "source": "berserker - rager (a5e)",
            "mods": [],
            "variables": [
                {
                    "mods": [
                        "1/SR, on going down, you can immediately make a death save. On a succ, you instead gain a number of hit points equal to your CON mod and do not go down."
                    ]
                },
                {
                    "mods": [
                        "The vest has 3 charges, all of which are recovered after a long rest.",
                        "On init, you can expend 1 charge to gain an expertise die on your first atk each round. This lasts for 1 min or until you go down."
                    ]
                }
            ]
        },
        {
            "name": "Healing Doublet",
            "source": "cleric - healer (a5e)",
            "mods": [],
            "variables": [
                {
                    "mods": [
                        "You may add your ability mod to the healing of your lvl'd spells."
                    ]
                },
                {
                    "mods": [
                        "You learn the Spare the Dying cantrip."
                    ]
                }
            ]
        },
        {
            "name": "Prophetic Vest",
            "source": "cleric - oracle (a5e)",
            "mods": [
                "As an action 1/LR, you can touch a willing creature to grant them a premonition they will remember for 1hr.",
                "A creature with a premonition can expend it to reroll a d20."
            ],
            "variables": []
        },
        {
            "name": "Explosive Hauberk",
            "source": "artificer - bombardier (a5e)",
            "mods": [],
            "variables": [
                {
                    "mods": [
                        "As a bonus action, you can form an alchemical grenade in your onhand. These grenades inherit the affixes of your onhand weapon. A grenade will explode when it either hits a target or at the end of your next turn.",
                        "Alchemical grenades used your ability for attack and damage rolls, and are ranged weapons with the Thrown (20'/60') trait which deal 1d6 force dmg. When a grenade explodes, all creatures adj to the grenade make a DEX save or take half as much dmg as the grenade's attack hit deals. A creature can only take dmg once from a single grenade. If you miss an atk with a grenade, it explodes in a harmless location."
                    ],
                    "variables": [
                        "If you hit a creature with a grenade atk, they are inflcited with 1d4 acid DoT that doesn't stack and lasts until either the target is submerged in water or uses an action to wipe the acid off.",
                        "1/LR, on hit with a grenade atk, the target takes 1d12 additional force dmg and makes an INT save or is rattled until the end of its next turn.",
                        "If you hit a creature with a grenade atk, they take 1d6 additional fire dmg.",
                        "If you hit a creature with a grenade atk, they make a CON save or are blinded until the end of their next turn."
                    ]
                },
                {
                    "mods": [
                        "You gain an expertise die in Seek Shelter journey activities by using explosives to help create cavernous havens."
                    ]
                }
            ]
        },
        {
            "name": "Peaceful Lamellar",
            "source": "cleric - peace",
            "mods": [],
            "variables": [
                {
                    "mods": [],
                    "variables": [
                        "You gain an expertise die in Insight.",
                        "You gain an expertise die in Performance.",
                        "You gain an expertise die in Persuasion."
                    ]
                },
                {
                    "mods": [
                        "As an action 2/LR, choose up to 2 willing creatures within 30' of you, potentially including yourself. A magical bond is forged between them for 10mins or until you use this power again.",
                        "While any bonded creature is within 30' of another, the creature can roll a d4 and add the number rolled to a d20 roll once per turn."
                    ]
                }
            ]
        },
        {
            "name": "Arcane Ringmail",
            "source": "cleric - arcana",
            "mods": [
                "You gain an expertise die in Arcana."
            ],
            "variables": [
                {
                    "mods": [
                        "You learn the Frostbite and Acid Splash cantrips."
                    ]
                },
                {
                    "mods": [
                        "You learn the Mind Sliver and Sword Burst cantrips."
                    ]
                }
            ]
        },
        {
            "name": "Primeval Doublet",
            "source": "ranger - primeval guardian",
            "mods": [],
            "variables": [
                {
                    "mods": [
                        "As a bonus action, you can shapeshift into an ent. This lasts until you end it as a bonus action or are knocked unconscious.",
                        "The ent form makes the following modifications to your character:",
                        "- You become Large, unless you were already larger.",
                        "- All speeds you have become 5'.",
                        "- You gain +5' reach.",
                        "- You gain 1 temp HP at the start of each of your turns. When you revert, you lose any of this temp HP remaining."
                    ]
                },
                {
                    "mods": [
                        "Once during each of your turns, you can deal +1d6 P dmg with a wep hit."
                    ]
                }
            ]
        },
        {
            "name": "Monstrous Vest",
            "source": "ranger - monster slayer",
            "mods": [],
            "variables": [
                {
                    "mods": [
                        "As an action, choose a creature you can see within 60' of you. You learn all of their immunities, resistances, and vulnerabilities, unless they are hidden from divination magic. You can do this a number of times equal to your ability mod between long rests."
                    ]
                },
                {
                    "mods": [
                        "As a bonus action, you can designate a creature you can see within 60' of you as your prey. The first time each turn that you hit your prey with a wep atk, your wep deals +1d6 base dmg. They remain your prey until you finish a rest, or if you designate another creature as your prey."
                    ]
                }
            ]
        },
        {
            "name": "Alchemical Ringmail",
            "source": "artificer - alchemist",
            "mods": [
                "Whenever you complete a LR, roll a d6 and gain an Elixir based on the following results. The elixir's effects occur on consumption. Elixirs expire at the end of your next long rest.",
                "1. Healing: The drinker heals HP equal to 2d4 + your ability mod.",
                "2. Swiftness: The drinker's speed increases by 10' for 1hr.",
                "3. Resilience: The drinker's AC increases by 1 for 10mins.",
                "4. Boldness: The drinker adds 1d4 to each of their atks and saves for 1min.",
                "5. Flight: The drinker gains 10' of fly speed for 10mins.",
                "6. Transformation: The drinker targets themself with the Alter Self spell, which lasts for 10mins and doesn't require concentration.",
                "Additionally, you can expend spell slots of any level to create an equal number of additional elixirs as an action. When you do so, they must be of the following type:"
            ],
            "variables": [
                {
                    "mods": [
                        "Healing."
                    ]
                },
                {
                    "mods": [
                        "Swiftness."
                    ]
                },
                {
                    "mods": [
                        "Resilience."
                    ]
                },
                {
                    "mods": [
                        "Boldness."
                    ]
                },{
                    "mods": [
                        "Flight."
                    ]
                },
                {
                    "mods": [
                        "Transformation."
                    ]
                }
            ]
        },
        {
            "name": "Battle Hauberk",
            "source": "artificer - battle smith",
            "mods": [],
            "variables": [
                {
                    "mods": [
                        "You gain proficiency with martial weapons.",
                        "Whenever you atk with a relic weapon, you can use your ability instead of the weapon's usual primary ability."
                    ]
                },
                {
                    "mods": [
                        "You gain a Steel Defender minion (https://5e.tools/bestiary.html#steel%20defender_tce). You determine its appearance.",
                        "You must use your bonus action for the Defender to take any action other than the Dodge action on its subsequent turn, unless you are unconscious, in which case it can take any action of its choice.",
                        "If the Mending spell is cast on the Defender, it heals 2d6 HP. Additionally, you can revive a Defender that died in the past hour as an action and a spell slot, while adj to its corpse. It returns to life after 1 minute with all its HP.",
                        "You can replace a dead Defender at the end of a long rest."
                    ]
                },
                {
                    "mods": [
                        "Resilience."
                    ]
                },
                {
                    "mods": [
                        "Boldness."
                    ]
                },{
                    "mods": [
                        "Flight."
                    ]
                },
                {
                    "mods": [
                        "Transformation."
                    ]
                }
            ]
        },
        {
            "name": "Tempestuous Doublet",
            "source": "berserker - tempest",
            "mods": [
                "As a bonus action 3/LR, you can empower a melee wep you touch for the next minute. You can only empower 1 weapon at a time, though you can use a bonus action to transfer the effect to a different weapon."
            ],
            "variables": [
                {
                    "mods": [],
                    "variables": [
                        "While you are holding the empowered weapon, it deals 1d6 additional light dmg.",
                        "While you are holding the empowered weapon, it deals 1d6 additional thunder dmg."
                    ]
                },
                {
                    "mods": [],
                    "variables": [
                        "You gain 50% resistance to thunder dmg.",
                        "You gain 50% resistance to light dmg."
                    ]
                }
            ]
        },
        {
            "name": "Matriarchal Scale",
            "source": "berserker - queen bee",
            "mods": [],
            "variables": [
                {
                    "mods": [
                        "As a bonus action 3/LR, you can choose a creature within 10' of you to grow furious on your behalf for 1 minute. If the creature is unwilling, they make a WIS save. If it succeeds, they are immune to this power permanently. If it fails, it can repeat the save at the end of each of its turns.",
                        "As a bonus action during this time, you can move the fury from one creature to another within 10' of you. This revokes the rage from the previous creature, and retains the same remaining duration.",
                        "A furious creature has the following modifications:",
                        "It has adv on STR checks and saves.",
                        "It has disadv on Offence with spells and concentration saves.",
                        "It adds 2 to any melee wep atks it makes."
                    ]
                },
                {
                    "mods": [
                        "While you are holding a dual-wielding or finesse melee weapon and no shield, you treat that weapon's base dmg die as a d12, and you may give the weapon the Heavy trait while you hold it.",
                        "You cannot attack with 2 different held weapons during the same turn.",
                        "You cannot benefit from the Dueling fighting style."
                    ]
                }
            ]
        },
        {
            "name": "Planar Hauberk",
            "source": "ranger - horizon walker",
            "mods": [],
            "variables": [
                {
                    "mods": [
                        "As an action, you detect the distance and direction to the closest planar portal within 1 mile of you.",
                        "Once you use this feature, you cannot use it again until you finish a rest."
                    ]
                },
                {
                    "mods": [
                        "As a bonus action, choose a creature you can see within 30' of you. The next time you hit them this turn with a wep atk, all dmg dealt is converted to force, and the atk deals +1d8 force dmg."
                    ]
                }
            ]
        },
        {
            "name": "Swarming Doublet",
            "source": "ranger - swarmkeeper",
            "mods": [
                "While you are alive, a swarm of insects crawls over you, flies around you, and skitters on the ground around your feet."
            ],
            "variables": [
                {
                    "mods": [
                        "Once on each of your turns, immediately after you hit with an atk, you can have the swarm deal 1d6 P dmg to the target."
                    ]
                },
                {
                    "mods": [
                        "Once on each of your turns, immediately after you hit with an atk, you can have the target make a STR save or be moved by the swarm up to 15' horizontally in a direction of your choicce."
                    ]
                },
                {
                    "mods": [
                        "Once on each of your turns, immediately after you hit with an atk, you can have yourself moved 5' horizontally in a direction of your choice by the swarm."
                    ]
                }
            ]
        },
        {
            "name": "Wild Chainmail",
            "source": "ranger - wildborn (a5e)",
            "mods": [
                "You learn the Primal Savagery and Resistance cantrips."
            ],
            "variables": []
        },
        {
            "name": "Titanist Brigandine",
            "source": "ranger - titanist (a5e)",
            "mods": [],
            "variables": [
                {
                    "mods": [],
                    "variables": [
                        "You gain 50% resistance to fire dmg. You can safely breathe and see through smoke. You can speak with canine beasts. Your party leaves no tracks in forests unless you wish to.",
                        "You gain 50% resistance to light and thunder dmg. You cannot be deafened. You can speak with hooved animals. Your party leaves no tracks in plains unless you wish to.",
                        "+60' darkvision. You can speak with cave-dwelling animals. Your party leaves no tracks in caves and mountainous terrain unless you wish to.",
                        "You gain an expertise die in aths checks to swim. +2 to your Grapple maneuver DC. You do not suffer disadv with Offence while underwater. You can breathe underwater. You can speak with marine animals and animals with tentacles. Your party leaves no tracks in aquatic or coastal terrain unless you wish to.",
                        "You have adv on death saves. You have 50% resistance to nec dmg and dmg from effects that leech HP. You can speak with arachnid beasts. Your party leaves no tracks in swamps unless you wish to. You can cast Spider Climb at-will, though whenever you do so, you must self-inflict 1 hit die of dmg. When cast in this way, Spider Climb doesn't require concentration."
                    ]
                },
                {
                    "mods": [
                        "As a bonus action, you can designate a creature you can see within 60' as the target of your ire until your next rest, or if you designate a new target. Whenever you take the Attack action while the target of your ire is within 60' of you, you can make a ranged spell atk against it."
                    ],
                    "variables": [
                        "The spell deals 1d8 P dmg as a wolf-like figure of ash and cinders bite the target.",
                        "The spell deals 1d8 light dmg as a bolt of lightning falls from above.",
                        "The spell deals 1d4 B dmg as a random misfortune pelts the foe with whatever is at hand. The target also has disadv on the first atk roll it makes during its next turn.",
                        "The spell deals 1d4 psy dmg as a haunting song wriggles through the target's consciousness. The target also cannot take reactions until the start of its next turn.",
                        "The spell deals 1d6 P dmg as a swarm of insects bite and impale the target, and if the target is living, you gain temp HP equal to the P dmg dealt."
                    ]
                }
            ]
        },
        {
            "name": "Trollscale Armour",
            "source": "berserker - troll slayer (a5e)",
            "mods": [],
            "variables": [
                {
                    "mods": [
                        "As a bonus action 3/LR, you can acquire the fury of a troll for the next minute, or until you are knocked unconscious."
                    ],
                    "variables": [
                        "While you have this fury, +1d6 fire dmg to your melee wep hits.",
                        "While you have this fury, you gain long, sharp troll claws that are a natural wep with 1d6 S dmg and the Finesse and Dual-wielding traits. Additionally, your maneuvers have -1 exertion cost (min 1)."
                    ]
                },
                {
                    "mods": [
                        "You have adv on Percep checks for smell."
                    ]
                }
            ]
        },
        {
            "name": "Defiant Hauberk",
            "source": "berserker - defiant (a5e)",
            "mods": [],
            "variables": [
                {
                    "mods": [
                        "You gain adv on saves vs divination magic.",
                        "You gain imm to any effect that would force you to reroll a die against your will."
                    ]
                },
                {
                    "mods": [
                        "You gain an expertise die in any disadvantaged ability checks and saves.",
                        "+2 dmg with disadvantaged atks.",
                        "Whenever you have disadv on a d20 roll, you can spend 2 exertion to roll normally instead.",
                        "Whenever you roll the same number on a adv/disadv d20 roll, the first wep atk you make before the end of your next turn has +1 dmg die."
                    ]
                }
            ]
        },
        {
            "name": "Artillery Chainmail",
            "source": "artificer - artillerist",
            "mods": [
                "As an action 1/LR, you can create a small or tiny eldritch cannon in an empty, horizontal surface in an adj space. A small cannon occupies its space and a tiny one can be held in one hand. You can reset this cooldown by expending a spell slot. You can only have one active cannon at a time.",
                "The cannon is a construct minion with 18 AC and 15 HP. It is imm to psn and psy dmg, and all condis. All its ability scores are 10. If the mending spell is cast on it, it recovers 2d6 HP. It disappears when killed or after 1hr.",
                "As a bonus action, you can activate the cannon if you are within 60' of it. As part of the same bonus action, you can direct the cannon to sprout spider-like legs and walk or climb up to 15' to an unoccupied space."
            ],
            "variables": [
                {
                    "mods": [
                        "When activated, the cannon exhales fire in a 15' cone. Each creature in the area must make a DEX save or take 2d8 fire dmg, or half as much on a pass. This ignits any flammable objs in the area that aren't worn or carried."
                    ]
                },
                {
                    "mods": [
                        "When activated, the cannot makes a ranged spell atk against a creature or obj within 120' of it. On a hit, it deals 2d8 force dmg and the target is pushed 5' away from the cannon."
                    ]
                },
                {
                    "mods": [
                        "When activated, the cannon emits a burst of positive energy that grants itself and all allies within 10' of it an amount of temp HP equal to 1d8 + your ability mod."
                    ]
                }
            ]
        },
        {
            "name": "Knowledgeable Ringmail",
            "source": "cleric - knowledge",
            "mods": [
                "You become proficient in Sylvan and Primordial."
            ],
            "variables": [
                {
                    "mods": [
                        "You gain a d6 expertise die in History and Nature."
                    ]
                },
                {
                    "mods": [
                        "You gain a d6 expertise die in Arcana and Religion."
                    ]
                }
            ]
        }
    ],
    "heavy": [
        {
            "name": "Gambling Plate",
            "source": "marshal - gambling general",
            "mods": [],
            "variables": [
                {
                    "mods": [
                        "While you are conscious, any ally within 10' of you that atks may take a -5 penalty to their attack roll to give it 2d6 additional base damage on a hit."
                    ]
                },
                {
                    "mods": [
                        "While you are conscious, any ally that starts its turn within 10' of you may use an action to move up to twice its speed in a straight line and take the Attack action. Until the end of that ally's next turn, creatures they did not attack on their turn have advantage on attack rolls against them."
                    ]
                }
            ]
        },
        {
            "name": "Royal Plate",
            "source": "herald - crown",
            "mods": [],
            "variables": [
                {
                    "mods": [
                        "Once per short or long rest, as a bonus action, you can challenge any creatures of your choice that you can see within 30' of you by forcing them to make a WIS save. On a fail, they cannot willingly move more than 30' away from you. This effect ends on the creature if you are knocked unconscious, die, or if the creature is more than 30' away from you."
                    ]
                },
                {
                    "mods": [
                        "Once per short or long rest, as a bonus action, you can bolster bloodied creatures of your choice that can hear you within 30' of you, healing them for 1d6 + your ability modifier."
                    ]
                }
            ]
        },
        {
            "name": "Heroic Plate",
            "source": "herald - heroism",
            "mods": [],
            "variables": [
                {
                    "mods": [
                        "Once per short or long rest, as a bonus action, you can augment your athleticism, gaining adv on all Athletics and Acrobatics checks for 10mins."
                    ]
                },
                {
                    "mods": [
                        "Once per short or long rest, as a bonus action, you can guide your atks for 1min, granting your wep atks +1 crit range."
                    ]
                }
            ]
        },
        {
            "name": "Talented Plate",
            "source": "marshal - talented tactician",
            "mods": [
                "Whenever you roll for initiative, you gain a talent die, which is a d4.",
                "While you have a talent die, any ally within 60' of you that can see or hear you can roll it as a bonus die when making an atk. The talent die is then lost until your next turn.",
                "Whenever you start your turn with an unspent talent die, you can increase the talent die's size by 1.",
                "You lose your talent die whenever combat ends."
            ],
            "variables": []
        },
        {
            "name": "Lionhearted Plate",
            "source": "marshal - lionheart",
            "mods": [
                "Once per round when you hit with a melee atk, you can inspire a number of creatures of your choice equal to half your ability mod within 10' of you. The inspired creatures gain an expertise die on their first atk before your next turn."
            ],
            "variables": []
        },
        {
            "name": "Cavalier Plate",
            "source": "fighter - cavalier",
            "mods": [],
            "variables": [
                {
                    "mods": [],
                    "variables": [
                        "Gain an expertise die in Animal Handling.",
                        "Gain an expertise die in History.",
                        "Gain an expertise die in Insight.",
                        "Gain an expertise die in Performance.",
                        "Gain an expertise die in Persuasion.",
                        "Gain an expertise die in Orcish."
                    ]
                },
                {
                    "mods": [
                        "You have adv on saves to avoid falling off your mount.",
                        "Whenever you fall off your mount, you land on your feet if you are conscious.",
                        "Mounting or dismounting only costs 5' of movement instead of half your speed."
                    ]
                },
                {
                    "mods": [
                        "On melee wep hit, you may mark the target until the end of your next turn, or until you are knocked uncon.",
                        "While a creature marked in this way is adj to you, it has disadv on atks against creatures other than you.",
                        "If a creature marked in this way deals dmg to anyone other than you, you can make a melee wep atk against the marked creature as a bonus action on your next turn. You have adv on this atk and if it hits, it deals 1 additional base dmg. This special atk can only be made a number of times equal to your ability mod between long rests."
                    ]
                }
            ]
        },
        {
            "name": "Sharpshooting Plate",
            "source": "fighter - sharpshooter",
            "mods": [
                "As a bonus action up to thrice between rests, you can take careful aim at a creature you can see that is within range of a ranged wep you are wielding. Until the end of this turn, your ranged atks with that wep gain the following benefits against the target:",
                "The atks ignore half and three-quarters cover.",
                "On each hit, the wep deals 3 additional base dmg."
            ],
            "variables": []
        },
        {
            "name": "Green Plate",
            "source": "herald - green knight",
            "mods": [],
            "variables": [
                {
                    "mods": [
                        "Once per short or long rest, as an action, you can touch a plant to be recognised by nature as one of its protectors for 1hr. During this time, you have adv on Persuasion checks made to influence druids and beasts.",
                        "Alternatively, you can end this effect early to gain adv on a Seek Shelter journey activity."
                    ],
                    "variables": []
                },
                {
                    "mods": [
                        "Once per short or long rest, as a reaction to failing a Nature or Survival check, you can succeed instead."
                    ],
                    "variables": []
                },
                {
                    "mods": [
                        "You learn the Find Familiar spell and can cast it as a ritual.",
                        "Whenever you take the Attack action, you can forgo one of your atks to allow your Familiar to make an attack as its reaction."
                    ],
                    "variables": [
                        "Whenever you cast Find Familiar, you can choose for it to take the form of an Awakened Shrub.",
                        "Whenever you cast Find Familiar, you can choose for it to take the form of a Shrieker.",
                        "Whenever you cast Find Familiar, you can choose for it to take the form of a Sprite.",
                        "Whenever you cast Find Familiar, you can choose for it to take the form of a Violet Fungus."
                    ]
                }
            ]
        },
        {
            "name": "Holy Plate",
            "source": "herald - holy champion",
            "mods": [],
            "variables": [
                {
                    "mods": [
                        "Once per short or long rest, as an action, you can unleash a flood of negative energy on hostile creatures within 30' of you, forcing them to make a CON save. On a failed save, a creature takes 2d8 nec dmg and is pushed 5' away from you. On a success it takes half dmg and is not pushed back."
                    ],
                    "variables": []
                },
                {
                    "mods": [
                        "Once per short or long rest, as a bonus action, you can send out a flood of positive energy to heal friendly creatures (including yourself) within 30' of you, causing them to regain hit points equal to 2 + your ability mod."
                    ],
                    "variables": []
                }
            ]
        },
        {
            "name": "Brutish Plate",
            "source": "fighter - brute (a5e)",
            "mods": [
                "On melee wep hit, you may expend up to 2 exertion to deal 1d8 additional B dmg per point spent."
            ],
            "variables": []
        },
        {
            "name": "Warding Plate",
            "source": "ranger - warden (a5e)",
            "mods": [],
            "variables": [
                {
                    "mods": [],
                    "variables": [
                        "You gain an expertise die in Animal Handling.",
                        "You gain an expertise die in History."
                    ]
                },
                {
                    "mods": [
                        "Your mount can understand common and can act as a CR 1/8 beast minion outside of combat."
                    ]
                }
            ]
        },
        {
            "name": "Dreaded Plate",
            "source": "berserker - dreadnought (a5e)",
            "mods": [],
            "variables": [
                {
                    "mods": [
                        "On hit after a 20' charge, you can force the target to make a STR save or fall prone."
                    ]
                },
                {
                    "mods": [
                        "You gain adv on checks made to avoid being knocked prone.",
                        "Whenever a creature you can see atks a non-you creature adj to you, you can react to impose disadv on the atk roll"
                    ]
                }
            ]
        },
        {
            "name": "Psionic Plate",
            "source": "fighter - psi warrior",
            "mods": [
                "You have a pool of 4 psionic dice, each of which is a d6. All are recovered after a long rest. Additionally, as a bonus action 1/SR, you can recover 1 psionic die."
            ],
            "variables": [
                {
                    "mods": [
                        "Whenever a creature you can see within 30' of you takes dmg, you can react to expend 1 psionic die, roll it, and reduce the dmg taken by the number rolled plus your ability mod as you create a momentary shield of telekinetic force."
                    ]
                },
                {
                    "mods": [
                        "You can propel your weapons with psionic force. Once on each of your turns, immediately after you hit a target within 30' of you with an atk and deal wep dmg to it, you can expend 1 psionic die, roll it, and deal additional force dmg to the target equal to the number rolled + your ability mod."
                    ]
                },
                {
                    "mods": [
                        "You can move an obj or creature with your mind. As an action, target 1 loose obj that is Large or smaller, or 1 other willing creature. If you can see the target and it is within 30' of you, you can move it up to 30' to an empty space you can see. Alternatively, if a targeted obj is Tiny, you can move it to or from your hand. Either way, you can move the target horizontally, vertically, or both.",
                        "You can use this power 1/SR, but can replenish this usage by expending a psionic die."
                    ]
                }
            ]
        },
        {
            "name": "Arcane Plate",
            "source": "fighter - arcane archer",
            "mods": [],
            "variables": [
                {
                    "mods": [],
                    "variables": [
                        "You gain an expertise die in Arcana and learn the Prestidigitation cantrip.",
                        "You gain an expertise die in Nature and learn the Druidcraft cantrip."
                    ]
                },
                {
                    "mods": [
                        "The plate has 2 charges, both of which are recovered after a short or long rest.",
                        "Once per turn when you fire a proj from a bow wep as part of the Attack action, you can expend a charge to apply the following effect to the proj."
                    ],
                    "variables": [
                        "You use abjuration magic to try to banish your target to a harmless location in the Feywild. The target must succeed on a CHA save or be banished as per the banishment spell, except with a duration of only 1d4 rounds, without concentration.",
                        "Your enchantment magic causes this proj to temporarily beguile its target. The target takes an extra 2d6 psy dmg, and choose an ally within 30' of the target. The target must succeed on a WIS save, or it is charmed by the chosen ally until the start of your next turn. This effect ends early if the chosen ally atks the charmed target, deals dmg to it, or forces it to make a save.",
                        "You imbue the proj with force energy drawn from the school of evocation. The energy detonates after your attack. Immediately after the arrow hits its target, all creatures within 10' of the target take 2d6 force dmg each.",
                        "You weave necromantic magic into the proj. The target hit by it takes an extra 2d6 nec dmg and must succeed on a CON save or the dmg dealt by its wep atks it halved until the start of your next turn.",
                        "When the proj strikes its target, conjuration magic creates grasping poisonous brambles, which wrap around the target. The creature hit by the arrow takes an extra 2d6 psn dmg, its sp is reduced by 10', and it takes 2d6 S dmg the first time on each turn it moves without teleporting. The target or any creature that can reach it can use its action to remove the brambles with a successful Athletics check against your DC. Otherwise, the brambles last for 1min or until you use this effect again.",
                        "You use transmutation magic to give the proj an ethereal quality. When you use this option, you don't make an atk roll for the atk. Instead, the arrow shoots forward in a 30' line before disappearing. The arrow passes harmlessly through objs, ignoring all cover. Each creature in the line must make a DEX save. On a fail, they take the proj's dmg, plus an extra 1d6 P dmg. On a succcess, they take half as much dmg.",
                        "Using divination magic, you grant the proj the ability to seek out a target. When you use this option, you don't make an atk roll for the atk. Instead, choose 1 creature you have seen in the past min. The proj flies toward that creature, moving around corners if necessary and ignoring 3/4 and half cover. If the target is within the wep's range and there is a parth large enough for the proj to travel to the target, the target must make a DEX save. On a failed save, the target takes the proj's dmg, plus an extra 1d6 force dmg, and you learn the target's current location. On a success, the target takes half as much dmg and you don't learn its location.",
                        "You weave illusion magic into the proj, causing it to occlude your target's vision with shadows. The target hit by the proj takes an extra 2d6 psy dmg, and must succeed on a WIS save or be unable to see anything farther than 5' away until the start of your next turn."
                    ]
                },
                {
                    "mods": [
                        "You can move an obj or creature with your mind. As an action, target 1 loose obj that is Large or smaller, or 1 other willing creature. If you can see the target and it is within 30' of you, you can move it up to 30' to an empty space you can see. Alternatively, if a targeted obj is Tiny, you can move it to or from your hand. Either way, you can move the target horizontally, vertically, or both.",
                        "You can use this power 1/SR, but can replenish this usage by expending a psionic die."
                    ]
                }
            ]
        },
        {
            "name": "Ancient Plate",
            "source": "herald - ancients",
            "mods": [],
            "variables": [
                {
                    "mods": [
                        "Once per short or long rest, as an action, you can cause spectral vines to spring up and reach for a creature within 10' of you that you can see. They must pass a STR or DEX save (their choice) or be rest until save."
                    ]
                },
                {
                    "mods": [
                        "Once per short or long rest, as an action, you can utter ancient words that are painful for fey and fiends to hear. Each one within 30' of you that can hear you must make a WIS save. On a failed save, the creature is turned for 1min or until it takes dmg.",
                        "A turned creature must spend its turns trying to move as far away from you as it can, and it cannot willingly move to a space within 30' of you. It also cannot take reactions. For its actions, it can use only the Dash action or try to escape from an effet that prevents it from moving. If there is nowhere to move, the creature can take the Dodge action.",
                        "If a turned creature is concealed by an illusion, shapeshifting, or other effect, its true form is revealed while it is turned."
                    ]
                }
            ]
        },
        {
            "name": "Glorious Plate",
            "source": "herald - glory",
            "mods": [],
            "variables": [
                {
                    "mods": [
                        "Once per short or long rest, as a bonus action, you can augment your athleticism for 10mins. You gain adv on Aths and Acro checks, you can carry/push/drag/lift twice as much weight as normal, and the distance of your long and high jumps increases by 10'."
                    ]
                },
                {
                    "mods": [
                        "Once per short or long rest, as a bonus action after you deal damage with a levelled spell to a creature, you can distribute up to 2d8 + 3 temporary hit points, divided between any creatures of your choice within 30' of you however you wish."
                    ]
                }
            ]
        },
        {
            "name": "Gladiatorial Plate",
            "source": "fighter - gladiator (a5e)",
            "mods": [
                "You have advantage on Intimidation and Performance checks made with your weapon."
            ],
            "variables": [
                {
                    "mods": [
                        "Whenever you score a critical hit with a wep atk, you may make an Intimidation check. Each foe within 20' of you make a WIS save against a DC equal to the result of your check. On a fail, a creature becomes frightened of you until end of your next turn."
                    ]
                },
                {
                    "mods": [
                        "Whenever you score a critical hit with a wep atk, you may make a Performance check. Each foe within 20' of you makes a CHA save against a DC equal to the result of your check. On a fail, a creature becomes charmed by you until end of your next turn."
                    ]
                }
            ]
        },
        {
            "name": "Knightly Plate",
            "source": "fighter - knight (a5e)",
            "mods": [],
            "variables": [
                {
                    "mods": [
                        "You ignore all penalties of wearing heavy armour or targe shields."
                    ]
                },
                {
                    "mods": [],
                    "variables": [
                        "While you are in good standing with the leadership of your hometown (or equivalent) and are within their area of influence, creatures with a CR lower than yours that are also loyal to that authority may perform simple tasks at your request. You lose good standing with the authority if you go against their wishes.",
                        "You gain an expertise die on Persuasion checks, unless you have [harmed a creature that has surrendered/stolen from a living creature/spoken a lie] in the past 7 days, when you instead get disadvantage on Persuasion checks. Whenever you do so, you also suffer a level of strife."
                    ]
                }
            ]
        },
        {
            "name": "Armoured Chainmail",
            "source": "artificer - armourer",
            "mods": [],
            "variables": [
                {
                    "mods": [
                        "You ignore the Strength requirements of wearing heavy armour.",
                        "This chainmail replaces any limbs you may be missing, replacing them with armoured prosthetics."
                    ]
                },
                {
                    "mods": [],
                    "variables": [
                        "Your unarmed weapons have their base dmg replaced with 1d8 thunder. On unarmed wep hit, the target has disadv on atks against non-you targets until the start of your next turn. As a bonus action 2/LR, you can gain 3 temp HP.",
                        "Your unarmed weapons become ranged weapons (90'/300') and have their base dmg replaced with 1d6 light. 1/turn, your unarmed wep hits deal +1d6 light dmg. +5' sp. You have adv on Stealth checks and ignore the Stealth penalties of wearing heavy armour."
                    ]
                }
            ]
        },
        {
            "name": "Forged Plate",
            "source": "cleric - forge",
            "mods": [],
            "variables": [
                {
                    "mods": [
                        "On LR end, you can touch a body armour to grant it +1 AC until the end of your next long rest or your death."
                    ]
                },
                {
                    "mods": [
                        "On LR end, you can touch a weapon to grant it +1 to atk and dmg rolls, and cause its physical dmg to be considered magical, until the end of your next long rest or your death."
                    ]
                }
            ]
        },
        {
            "name": "Sharpshooting Plate",
            "source": "fighter - sharpshooter (a5e)",
            "mods": [
                "You do not get disadv on ranged atks due to being adj to a foe or atking at long range.",
                "Your ranged wep atks ignore half and three-quarters cover."
            ],
            "variables": []
        },
        {
            "name": "Technological Plate",
            "source": "fighter - gadgeteer (a5e)",
            "mods": [
                "At the end of a rest, you can craft a random uncommon wondrous item."
            ],
            "variables": []
        }
    ]
}