{
    "tome": [
        {
            "name": "Conductive Lightning Lure (0)",
            "description": "+1 damage per cantrip tier per active minion."
        },
        {
            "name": "Anchoring Lightning Lure (0)",
            "description": "Duration is now 'Concentration, up to 1 minute'. The on-cast effect remains the same. At the start of your turn while concentrating, you can pull the target up to 10' towards you, with no other effect."
        },
        {
            "name": "Eternal Frostbite (0)",
            "description": "The disadvantage is now for all attacks the target makes until it passes a passive save. Gains a 6+ recharge."
        },
        {
            "name": "Spreading Frostbite (0)",
            "description": "All creatures of your choice within 5' of the target also suffer the disadvantage effect."
        },
        {
            "name": "Dextrous Magic Stone (0)",
            "description": "If a stone's thrower has 15+ DEX, it has +1 AB."
        },
        {
            "name": "Heavy Magic Stone (0)",
            "description": "The stones can now only be used to make melee spell atks, but on a hit, the target makes a CON save or is debilitated until the end of the attacker's next turn."
        },
        {
            "name": "Possessive Mage Hand (0)",
            "description": "As an action, you can attach the hand to a creature within 5' of it. Whenever a creature starts their turn with the hand attached to them, they gain a stacking +1 spell damage bonus, which lasts until the hand is detached from them. Can detach as part of the hand's usual activity."
        },
        {
            "name": "Rapid Mage Hand (0)",
            "description": "The hand can now exist up to 60' away from you, and when it moves you can move it up to 60'."
        },
        {
            "name": "Empowering Minor Illusion (0)",
            "description": "For the duration, you gain +1 global damage for each foe who is currently tricked by the illusion."
        },
        {
            "name": "Distant Minor Illusion (0)",
            "description": "Range increases to 60'."
        },
        {
            "name": "Wintery Chill Touch (0)",
            "description": "Damage is converted to cold, heal block is converted to slow, and undead is converted to fiend. Damage die is increased to d10."
        },
        {
            "name": "Thorny Chill Touch (0)",
            "description": "1/min, when a condition is inflicted on you, you may cast the spell instantly."
        },
        {
            "name": "Greater True Strike (0)",
            "description": "Duration increases to Concentration, up to 1 minute and you gain advantage with 3 additional attack rolls of your choice that are made before the spell ends. Once per round, you can choose to use one of these 4 advantages when you make your first attack roll on your turn."
        },
        {
            "name": "Sapping True Strike (0)",
            "description": "If you score a Killing Blow with the enhanced attack roll, the spell lasts an additional round, granting your next turn's first attack advantage as well. This extra duration does not require Concentration."
        },
        {
            "name": "Taunting Vicious Mockery (0)",
            "description": "On hit, the target has disadvantage on all attack rolls made before the end of its next turn, and if it makes an attack, it must target you. Persuasion checks you make against the target have disadvantage permanently."
        },
        {
            "name": "Harrowing Vicious Mockery (0)",
            "description": "On cast, all foes within 30' of the target, except the target, become frightened until the end of their next turn."
        },
        {
            "name": "Rejuvenating Green-Flame Blade (0)",
            "description": "If the weapon attack critically hits, you recover a 1st-level spell slot."
        },
        {
            "name": "Sapping Green-Flame Blade (0)",
            "description": "Any creature that takes damage makes a CON save or is sluggish until the end of your next turn."
        },
        {
            "name": "Hasty Mending (0)",
            "description": "Casting time is reduced to a bonus action, but there is a 20% chance for the object to be disintegrated into a pile of ashes."
        },
        {
            "name": "Lasting Mending (0)",
            "description": "The object cannot be damaged for the next minute."
        },
        {
            "name": "Reverberating Altered Strike (0)",
            "description": "After damage is rolled, it is halved and instead applied as a DoT, stacking until the target makes a DEX save."
        },
        {
            "name": "Cataclysmic Altered Strike (0)",
            "description": "Damage dealt by the attack is converted to fire. Any resistance reductions applied by the attack are converted to fire DoTs of the same number, stacking until the target makes a DEX save. The attack deals 2 additional fire damage per cantrip tier."
        },
        {
            "name": "Exhaling Circular Breathing (0)",
            "description": "You can end the spell early as a free action on your turn to exhale, releasing a forceful breath in a 5' self-burst only affecting foes as a wep atk, dealing 1d4 B"
        },
        {
            "name": "Protective Circular Breathing (0)",
            "description": "+1 dmg res for the duration."
        },
        {
            "name": "Rushed Message (0)",
            "description": "Can be cast as a free action, but for the duration you have -1 dmg resistance"
        },
        {
            "name": "Volatile Message (0)",
            "description": "A psychic rift erupts from the target, and all foes within 5' of them receive a spell atk, dealing 1d4 psy per cantrip tier."
        },
        {
            "name": "Forceful Calculate (0)",
            "description": "On cast, creatures of your choice are pushed up to 5' away from you per cantrip tier."
        },
        {
            "name": "Energising Calculate (0)",
            "description": "For the duration, you have +1 passive temp HP gen per cantrip tier."
        },
        {
            "name": "Cautious Friends (0)",
            "description": "If the target becomes hostile from the spell, you have +1 dmg res per cantrip tier against them until your next rest"
        },
        {
            "name": "Deep Friends (0)",
            "description": "The bonus also applies to knowledge checks made about the target for the duration."
        },
        {
            "name": "Anchored Dancing Lights (0)",
            "description": "Duration becomes 1 hour, without concentration, but the lights can no longer be moved once cast."
        },
        {
            "name": "Plentiful Dancing Lights (0)",
            "description": "Creates up to 4 additional lights."
        },
        {
            "name": "Improved Prestidigitation (0)",
            "description": "All numeric values in effects increase by 1 per cantrip tier."
        },
        {
            "name": "Complex Prestidigitation (0)",
            "description": "On cast, you can choose 1 additional effect to occur per cantrip tier. The max effects active at once increases to 4."
        },
        {
            "name": "Decaying Create Bonfire (0)",
            "description": "On hit, target makes a CON save or gets -1 per cantrip tier to saves to end ongoing effects until the end of their next turn"
        },
        {
            "name": "Revolutionary Create Bonfire (0)",
            "description": "On boss hit, target makes a CON save or a 15x15' flaming ground pers area is left beneath them until the end of their next turn, making spell atks against foes dealing 1d4 fire per cantrip tier"
        },
        {
            "name": "Extended Poison Spray (0)",
            "description": "Range increases to 30'."
        },
        {
            "name": "Major Poison Spray (0)",
            "description": "Can target 1 additional target in range, but is now a 1st-lvl spell."
        },
        {
            "name": "Extended Thunderclap (0)",
            "description": "Range increases to 10'."
        },
        {
            "name": "Hexed Thunderclap (0)",
            "description": "Damage die increases to 1d8 vs cursed targets."
        },
        {
            "name": "Mobilising Toll the Dead (0)",
            "description": "On dealing the bonus dmg, gain +5' sp per cantrip tier until the end of the turn."
        },
        {
            "name": "Heavy Toll the Dead (0)",
            "description": "On hit, the target is slowed until the end of your next turn."
        },
        {
            "name": "Heavy Booming Blade (0)",
            "description": "On hit with the weapon atk, the target is slowed until the end of your next turn."
        },
        {
            "name": "Reverberating Booming Blade (0)",
            "description": "The dmg die of the on-move effect increases to 1d10."
        },
        {
            "name": "Handcasted Light (0)",
            "description": "Regardless of conditions, the bright light's radius is increased by 5' for each dmg res on your gloves."
        },
        {
            "name": "Tempting Light (0)",
            "description": "If a creature of your choice can see the bright light but is not inside it, they must move into the light as soon as possible. When forced to move in this way, a creature does not provoke opp atks."
        },
        {
            "name": "Friendly Sword Burst (0)",
            "description": "Now only targets creatures of your choice."
        },
        {
            "name": "Prismatic Sword Burst (0)",
            "description": "On 1+ hit, you have +1 non-phys res per cantrip tier until your next turn."
        },
        {
            "name": "Cruel Mind Sliver (0)",
            "description": "The damage is increased by 2 per cantrip tier if the target is suffering from a DoT."
        },
        {
            "name": "Exposing Mind Sliver (0)",
            "description": "On hit, the target gets -1 phys res per cantrip tier. If you cast the spell as a full turn action, this increases to -2 per cantrip tier."
        },
        {
            "name": "Commanded Infestation (0)",
            "description": "The spell's effects count as coming from a minion instead of you. Still counts as you casting a spell."
        },
        {
            "name": "Weaving Infestation (0)",
            "description": "If you have hit a target with this spell since the start of your last turn, your weapon hits against that target grant you 1 temp HP per cantrip tier."
        },
        {
            "name": "Chaotic Pestilence (0)",
            "description": "Becomes a 1st-lvl spell. When cast, has a 25% chance to have its dmg doubled, and a 25% chance for it to be tripled. Still scales with caster lvls."
        },
        {
            "name": "Draining Pestilence (0) [DONE]",
            "description": "Dmg is converted to necrotic. The CON save is converted into a CHA save. Dmg dice are increased to d6s."
        },
        {
            "name": "Major Cure Wounds (1)",
            "description": "Healing die is increased to 2d8. Gains a 6+ recharge."
        },
        {
            "name": "Staggered Cure Wounds (1)",
            "description": "At the start of your next turn, the target heals 1d4 hit points."
        },
        {
            "name": "Enduring Silent Image (1)",
            "description": "Maximum duration is increased to 24 hours."
        },
        {
            "name": "Empowering Silent Image (1)",
            "description": "Your other spells are always upcast 1 level for free for the duration."
        },
        {
            "name": "Precarious Longstrider (1)",
            "description": "Targets ignore non-magical difficult terrain for the duration."
        },
        {
            "name": "Cautious Longstrider (1)",
            "description": "Effect ends on a target when they become bloodied, and heals them for 2d8 hit points."
        },
        {
            "name": "Contaminating Searing Equation (1)",
            "description": "Deafen is converted to poison. Spell immunity replaced with creatures immune to poisons, or have a Constitution score higher than 20."
        },
        {
            "name": "Exposing Searing Equation (1)",
            "description": "On hit, target takes 1 additional psychic damage whenever they take psychic damage until the end of your next turn."
        },
        {
            "name": "Infectious Hideous Laughter (1)",
            "description": "Any creature that touches an affected creature must also succeed on a WIS save or be affected."
        },
        {
            "name": "Despairing Hideous Laughter (1)",
            "description": "When the mirth fades, the target is affected with crushing grief, sadness, and despair, causing it to sob uncontrollably. The target has disadvantage on the first d20 roll it makes after the spell ends."
        },
        {
            "name": "Exciting Healing Word (1)",
            "description": "Target has an additional bonus action during their next turn."
        },
        {
            "name": "Warding Healing Word (1)",
            "description": "If you roll at least one 4 on healing dice, gain 1d8 temporary hit points."
        },
        {
            "name": "Unnerving Bane (1)",
            "description": "Targets are rattled for the duration."
        },
        {
            "name": "Tormenting Bane (1)",
            "description": "Targets have disadvantage on their next saving throw against the frightened condition."
        },
        {
            "name": "Glowing Heroism (1)",
            "description": "Target glows with bright light in a 10' radius and dim light for an additional 5'. When a creature within the target's glow regains hit points, it regains 1d4 additional points."
        },
        {
            "name": "Inspiring Heroism (1)",
            "description": "Creatures of your choice within 60' of the target also cannot be frightened."
        },
        {
            "name": "Elongated Phantasmal Talons (1)",
            "description": "Your unarmed attacks also have +5' reach for the duration."
        },
        {
            "name": "Leeching Phantasmal Talons (1)",
            "description": "On scoring a critical hit with your unarmed attacks during the duration, heal 1 hit point."
        },
        {
            "name": "Rattling Faerie Fire (1)",
            "description": "When an affected creature is damaged by a weapon attack it takes 1d4 additional psychic damage and is rattled until the end of its next turn."
        },
        {
            "name": "Isolating Faerie Fire (1)",
            "description": "On hit, all creatures of your choice adjacent to the target are pushed 5' away from the target."
        },
        {
            "name": "Penetrating Detect Magic (1)",
            "description": "Your first cantrip cast after casting the spell ignores resistances."
        },
        {
            "name": "Refining Detect Magic (1)",
            "description": "Your minions you can see with a magic aura have -1 crit req."
        },
        {
            "name": "Ravaging Dissonant Whispers (1)",
            "description": "On sub hit, radiate an aura for the remainder of combat that gives you -1 passive regen and deals 3 psy spell dmg to foes"
        },
        {
            "name": "Hellish Dissonant Whispers (1)",
            "description": "Damage is converted to fire. Instead of using their reaction, the target gets 1 fire DoT, stacking until DEX save. The next instance of fire dmg you deal does 1d4 additional fire dmg."
        },
        {
            "name": "Vengeful Hellish Rebuke (1)",
            "description": "Deals additional fire dmg equal to the number of times you have been hit by the target in the past minute."
        },
        {
            "name": "Infernal Hellish Rebuke (1)",
            "description": "The next time the target hits you, it makes a DEX save or gets 6 fire DoT, stacking until DEX save."
        },
        {
            "name": "Intense Charm Person (1)",
            "description": "The target is extremely friendly towards you, but the duration is reduced to 1 minute."
        },
        {
            "name": "Enlightening Charm Person (1)",
            "description": "When the effect ends, you can cast a cantrip on the target (max cast time of action)."
        },
        {
            "name": "Glowing Heroism (1)",
            "description": "The target glows with bright light in a 10' radius and dim light for an additional 5'. When a creature within this glow regains hit points, it regains 1d4 additional hit points."
        },
        {
            "name": "Improved Heroism (1)",
            "description": "The temporary hit points granted is increased by 1."
        },
        {
            "name": "Shady Disguise Self (1)",
            "description": "You gain an expertise die in Stealth checks for the duration."
        },
        {
            "name": "Blinding Disguise Self (1)",
            "description": "On cast, all creatures of your choice within 30' of you are blinded until the end of your turn."
        },
        {
            "name": "Ebbing Arms of Hadar (1)",
            "description": "Every 2nd casting of the spell in a single combat doubles its radius."
        },
        {
            "name": "True Arms of Hadar (1)",
            "description": "Each target rolls a d20 if they don't crit fail the save. On a 1, the spell critically hits them."
        },
        {
            "name": "Liberating Protection From Evil and Good (1)",
            "description": "The target also gains the condition protection against restrained."
        },
        {
            "name": "Unstable Protection From Evil and Good (1)",
            "description": "If you lose concentration on the spell, a psychic rift erupts from the target, making a spell atk against all foes within 5' of them, dealing 1d4 psy."
        },
        {
            "name": "Signature Illusory Script (1)",
            "description": "20% chance to refund the spell slot cost, but casting time is increased to 1hr."
        },
        {
            "name": "General Illusory Script (1)",
            "description": "Instead of designating specific creatures to be able to read the true message, you can instead designate categories of creatures."
        },
        {
            "name": "Traumatic Hex (1)",
            "description": "Your next hit against the target prompts a CON save or debils them until the end of their next turn."
        },
        {
            "name": "Cleansing Hex (1)",
            "description": "On cast, remove all negative conditions, diseases, curses, and marks from yourself."
        },
        {
            "name": "Vengeful Armour of Agathys (1)",
            "description": "If the incoming atk is a crit, the thorns dmg increases to 8."
        },
        {
            "name": "Repelling Armour of Agathys (1)",
            "description": "After receiving a triggering hit, the atker is pushed 5' away from you."
        },
        {
            "name": "Replenishing Feather Fall (1)",
            "description": "While a creature is falling, it has +1 passive regen."
        },
        {
            "name": "Rapid Feather Fall (1)",
            "description": "The target's descent rate instead slows to 120' per round."
        },
        {
            "name": "Insightful Speak with Animals (1)",
            "description": "Whenever you start conversing with a beast, they must make an Insight check against your spell save DC. On a failure, you can use an action any time during the duration to view the memories of an event the beast is describing."
        },
        {
            "name": "Nostalgic Speak with Animals (1)",
            "description": "Beasts can now tell you about things they have perceived since their birth."
        },
        {
            "name": "Chaining Wind Up (1)",
            "description": "Is now a 2nd-lvl spell. On making the melee attack, also make the same form of atk against a creature adj to the target, dealing 1d4 dmg of the same type as the triggering atk."
        },
        {
            "name": "Major Wind Up (1)",
            "description": "Is now a 2nd-lvl spell. The melee attack now automatically hits and critically hits."
        },
        {
            "name": "Improved Silvery Barbs (1)",
            "description": "The triggering creature's additional roll is reduced by 1."
        },
        {
            "name": "Healing Silvery Barbs (1)",
            "description": "The secondary target is also healed for 1d4 hit points."
        },
        {
            "name": "Retreating Sleep (1)",
            "description": "While the spell is active, you have +5' sp."
        },
        {
            "name": "Isolating Sleep (1)",
            "description": "While there is at least 1 creature asleep from this spell, you have +1 to DEX saves."
        },
        {
            "name": "Massive Corpse Explosion (1)",
            "description": "The area is increased to 20'-radius."
        },
        {
            "name": "Focused Corpse Explosion (1)",
            "description": "The area is decreased to 5'-radius, but the dmg dice increase to d10s."
        },
        {
            "name": "Minor Distort Value (1)",
            "description": "Can be cast as a cantrip, but only for light items."
        },
        {
            "name": "Charming Distort Value (1)",
            "description": "As part of the casting, you may also cast Charm Person for free on a creature within 10' of the target as a free action."
        },
        {
            "name": "Dialectic Comprehend Languages (1)",
            "description": "Languages closely related to one you know are now trivial to understand."
        },
        {
            "name": "Casual Comprehend Languages (1)",
            "description": "The bonus increases to +16 during a rest."
        },
        {
            "name": "Mighty Force Punch (1)",
            "description": "The target is pushed 5' away from you for every 10 damage dealt."
        },
        {
            "name": "Strong Force Punch (1)",
            "description": "Deals additional force damage equal to double your STR mod (min 0)."
        },
        {
            "name": "Subtle Dramatic Sting (1)",
            "description": "On cast, make a Performance check contested by the target's Perception. On success, the target is affected by the spell but does not realise it is targeted by a spell. Each round at the start of its turn, the target gains an expertise die on a Perception check they make for free made against your original Performance check to realise it has been targeted by a spell."
        },
        {
            "name": "Critical Dramatic Sting (1)",
            "description": "If this spell's original application is critically failed against, the target has -7 DoT dmg res vs creatures other than you for the duration."
        },
        {
            "name": "Treasured Identify (1)",
            "description": "If a magic item you identify is a rare+ wondrous item, an aspect of it is improved."
        },
        {
            "name": "Disabling Identify (1)",
            "description": "After identifying something, you may temporarily disable the magical effects identified until the end of your turn."
        },
        {
            "name": "Unsettling Arcane Riposte (1)",
            "description": "When you deal 10+ damage, the target is rattled until the end of your next turn."
        },
        {
            "name": "Deflecting Arcane Riposte (1)",
            "description": "You can cast this as a 2nd level spell to also add 2 to your AC against the triggering attack (can be decided after hearing the result of the attack roll)."
        },
        {
            "name": "Lasting Animal Friendship (1)",
            "description": "So long as the target has a CR equal to or less than half your prof bonus, the spell's duration becomes permanent until it is dispelled or you cast it again."
        },
        {
            "name": "Adorable Animal Friendship (1)",
            "description": "If the target is Tiny, you have a +1 bonus to social checks while it is within 10' of you."
        },
        {
            "name": "Contagious Cause Fear (1)",
            "description": "Whenever the target fails its save to end the effect, a foe of yours adj to the target is targeted by this spell, using the same concentration as the original casting."
        },
        {
            "name": "Debilitating Cause Fear (1)",
            "description": "While the target is healthy, they are debilitated instead of frightened."
        },
        {
            "name": "Dextrous Calculated Retribution (1)",
            "description": "When you gain the retribution charge, you heal hit points equal to half your DEX mod (rounded up)."
        },
        {
            "name": "Culling Calculated Retribution (1)",
            "description": "The damage increases to 3d10 against bloodied targets."
        },
        {
            "name": "Lasting Harmonic Resonance (1)",
            "description": "The spell's effects continue for 1 round after it ends."
        },
        {
            "name": "Passive Harmonic Resonance (1)",
            "description": "No longer requires verbal or somatic components."
        },
        {
            "name": "Subtle Traveler's Ward (1)",
            "description": "No longer triggers the flash, but the target gains a d6 expertise die on Perception checks contesting Sleight of Hand checks."
        },
        {
            "name": "Perceptive Traveler's Ward (1)",
            "description": "Is now a 2nd-level spell, but also grants advantage on Perception checks to see creatures attempting to hide. The flash occurs on such a creature if they are spotted by the target."
        },
        {
            "name": "Improved Unseen Servant (1)",
            "description": "The servant has a Strength of 10, allowing it to accomplish physical labours."
        },
        {
            "name": "Trapped Unseen Servant (1)",
            "description": "When the servant is destroyed by taking damage, it explodes. Make a spell attack against all foes adjacent to it, dealing 3d6 force damage on a hit. This counts as minion damage, not spell damage."
        },
        {
            "name": "Improved Expeditious Retreat (1)",
            "description": "Now allows you take the Dash action as a free action, but only once per round."
        },
        {
            "name": "Hasty Expeditious Retreat (1)",
            "description": "You have +5' sp for the duration."
        },
        {
            "name": "Shaking Thunderwave (1)",
            "description": "A creature that takes 10+ dmg from this spell is knocked prone."
        },
        {
            "name": "Propulsive Thunderwave (1)",
            "description": "If a target substantially fails their save, the push distance increases to 20'."
        },
        {
            "name": "Purging Lemure Transformation (2)",
            "description": "On cast, remove any conditions of your choice from yourself."
        },
        {
            "name": "Efficient Lemure Transformation (2)",
            "description": "Can be cast as a 1st-level spell."
        },
        {
            "name": "Blinding Darkness (2)",
            "description": "Creatures leaving area must make CON save or be blinded for 1 minute, or until passing a passive save."
        },
        {
            "name": "Enfeebling Darkness (2)",
            "description": "On cast, creatures of your choice in the area are debilitated until the end of your next turn."
        },
        {
            "name": "Supported Heat Metal (2)",
            "description": "If you have 2+ active minions on casting, can also target another creature adjacent to original target."
        },
        {
            "name": "Burning Heat Metal (2)",
            "description": "On dealing the bonus action damage, the target gets 1 fire DoT, stacking until passive CON save."
        },
        {
            "name": "Mocking Magic Mouth (2)",
            "description": "When cast with a single-event trigger, you can choose to cast Vicious Mockery through the mouth's message."
        },
        {
            "name": "Frenzying Magic Mouth (2)",
            "description": "Upon triggering for the first time, you gain an additional standard action until the end of your next turn. You can still only perform the same action once per turn."
        },
        {
            "name": "Merciful Mind Spike (2)",
            "description": "Damage increases to 3d10 against targets with less than maximum hit points."
        },
        {
            "name": "Erasing Mind Spike (2)",
            "description": "Damage increases to 3d12 against bloodied targets."
        },
        {
            "name": "Lengthened Hold Person (2)",
            "description": "Duration increases to Concentration, up to 8 hours."
        },
        {
            "name": "Improved Hold Person (2)",
            "description": "Is always upcast 1 level, but you have disadvantage on Concentration saves to maintain the spell."
        },
        {
            "name": "Indiscriminate Animal Messenger (2)",
            "description": "Can target any Tiny creature of Intelligence 3 or less."
        },
        {
            "name": "Overcharged Animal Messenger (2)",
            "description": "Has a minimum casting level of 3, and the message can be up to 50 words."
        },
        {
            "name": "Efficient Shatter (2)",
            "description": "Always upcast 1 level, but the range is reduced to 30'."
        },
        {
            "name": "Slowing Shatter (2)",
            "description": "On hit, a target must make a Constitution save or become slowed until the end of your next turn."
        },
        {
            "name": "Extended Locate Animals or Plants (2)",
            "description": "The range increases to on the same landmass as you."
        },
        {
            "name": "Travelling Locate Animals or Plants (2)",
            "description": "If an entity is detected, your party's overland travel speed is doubled for the next 24 hours."
        },
        {
            "name": "Lasting Blindness/Deafness (2)",
            "description": "Deafened targets cannot end the spell early."
        },
        {
            "name": "Sapping Blindness/Deafness (2)",
            "description": "On a failed initial save, a target makes an additional CON save or is also sluggish for the duration."
        },
        {
            "name": "Persistent Shattering Barrage (2)",
            "description": "The shards of broken glass fall, turning the area they occupy into difficult terrain, instead of dissolving harmlessly."
        },
        {
            "name": "Molten Shattering Barrage (2)",
            "description": "If you hit with 1+ orb, your minions add 2d8 fire dmg to their hits until the end of their next turn."
        },
        {
            "name": "Chilling Shadow Blade (2)",
            "description": "On hit with the weapon, target makes a CON save or is sluggish until the end of your next turn."
        },
        {
            "name": "Vorpal Shadow Blade (2)",
            "description": "Critical hits with the weapon deal 1d8 additional psy dmg (not multiplied by crit)."
        },
        {
            "name": "Guarded Enhance Ability (2)",
            "description": "When the target makes a save using the chosen ability, it can react to end the spell and gain adv on the save."
        },
        {
            "name": "Stable Enhance Ability (2)",
            "description": "No longer requires concentration."
        },
        {
            "name": "Hunting Silence (2)",
            "description": "As action for the duration, you can move the bubble up to 120' in any direction, so long as you can still see at least 1 space of it at all times and its centre remains within 120' of you."
        },
        {
            "name": "Recovering Silence (2)",
            "description": "If dispelled, the spell returns as if it were not dispelled at the end of your next turn."
        },
        {
            "name": "Supplementary Zone of Truth (2)",
            "description": "If you have a spell slot available to cast the spell, it has no spell slot cost when initially cast, but consumes its normal cost (if possible) at the end of its duration."
        },
        {
            "name": "Intimidating Zone of Truth (2)",
            "description": "When a creature fails the save, it also becomes frightened of you for the duration. This ends if the creature or any of its allies it can sense take damage."
        },
        {
            "name": "Elusive Misty Step (2)",
            "description": "Until the start of your next turn after casting, attack rolls against you are made with disadvantage."
        },
        {
            "name": "Signature Misty Step (2)",
            "description": "Can be cast as a 1st-lvl spell, but you have -1 passive regen while you have no 1st-lvl spell slots remaining."
        },
        {
            "name": "Staunching Lesser Restoration (2)",
            "description": "Can also remove a DoT from the target."
        },
        {
            "name": "Siphoning Lesser Restoration (2)",
            "description": "The removed effect is manifested as a CR 1/2 shadow minion that deals a dmg type based on the effect removed (nec, rad, thunder, light, psn)."
        },
        {
            "name": "Major Enthrall (2)",
            "description": "The spell now has a minimum casting level of 3. It also grants you advantage on all Deception checks against the targets, and the targets disadvantage on all Insight checks against you."
        },
        {
            "name": "Minor Enthrall (2)",
            "description": "Can now be cast as a 1st-lvl spell. The targets also need to be able to see you for the spell to be cast and maintained."
        },
        {
            "name": "Minor Suggestion (2)",
            "description": "Can now be cast as a 1st-lvl spell. You can no longer make suggestions based off of triggers."
        },
        {
            "name": "Shady Suggestion (2)",
            "description": "You gain an expertise die in Stealth checks while active."
        },
        {
            "name": "Synergistic Locate Object (2)",
            "description": "You can share this spell's concentration with that of the Locate Creature spell."
        },
        {
            "name": "Instant Locate Object (2)",
            "description": "Also tells you the distance of the located object from you. The maximum duration is reduced 6 seconds. Instead of learning its trajectory while travelling, you instead learn how many metres above the ground the object is."
        },
        {
            "name": "Absorbing Warding Wind (2)",
            "description": "Instead of hedging out vapour, gas, and fog, their effects are absorbed into the wind and apply to all creatures of your choice within the wind's area."
        },
        {
            "name": "Fiery Warding Wind (2)",
            "description": "Instead of extinguishing flames, they are absorbed into the wind, which gives the wind a persistent area effect on foes of CON save or 1d4 fire dmg."
        },
        {
            "name": "Sure-Footed Spider Climb (2)",
            "description": "The target automatically succeeds on checks and saves made to keep its balance for the duration."
        },
        {
            "name": "Improved Spider Climb (2)",
            "description": "The climbing speed granted is now equal to double the target's base speed."
        },
        {
            "name": "Specific Detect Thoughts (2)",
            "description": "You can scan the thoughts of all creatures within range and locate one creature currently thinking about a single subject you choose when you cast the spell. You can read its thoughts as described in the spell's description. This spell does not reveal which creature is having these thoughts, and until you determine which creature it is you cannot probe further."
        },
        {
            "name": "Synergistic Detect Thoughts (2)",
            "description": "Whenever you successfully probe a creature's mind and they do not shake off the spell, you may cast any other spell on the target as a free action, respecting range limitations but ignoring any of the new spell's casting components."
        },
        {
            "name": "Minor Gift of Gab (2)",
            "description": "Can now be cast as a 1st-lvl spell. When you do so, you cannot replace what you said with new words, and instead the targets just believe you paused in thought."
        },
        {
            "name": "Targeted Gift of Gab (2)",
            "description": "Now only targets a single creature within 5'. If the new words provoke a persuasion or deception check, you have advantage on it."
        },
        {
            "name": "Shrouded Invigorated Strikes (2)",
            "description": "The target also has +1 to DEX saves for the duration."
        },
        {
            "name": "Momentous Invigorated Strikes (2)",
            "description": "Whenever the target deals the additional damage, the next triggering atk they make increases the additional damage to 1d6."
        },
        {
            "name": "Panicked Kinetic Jaunt (2)",
            "description": "While bloodied, the speed bonus increases to 20'."
        },
        {
            "name": "Taunting Kinetic Jaunt (2)",
            "description": "The first time each round that you would provoke an opportunity attack from each creature, you heal 1 HP."
        },
        {
            "name": "Shattering Earthbind (2)",
            "description": "After the target takes 20 damage while affected, the spell ends on them and they shoot a bolt of gravity at a creature of your choice within 60' of them, a ranged spell atk dealing 1d4 force."
        },
        {
            "name": "Group Earthbind (2)",
            "description": "You can now target up to 3 creatures, but their flying speed is just halved."
        },
        {
            "name": "Rapid Knock (2)",
            "description": "Can now be cast as a bonus action, and arcane locks are only suppressed until the end of your next turn."
        },
        {
            "name": "Shielded Knock (2)",
            "description": "Suppressed arcane locks are only suppressed for creatures of your choice."
        },
        {
            "name": "Desperate Borrowed Knowledge (2)",
            "description": "The chosen skill also ignores penalties from conditions."
        },
        {
            "name": "Varied Borrowed Knowledge (2)",
            "description": "Whenever you substantially succeed on a check with the chosen skill, you gain +1 to all other skills for the duration. Max once/rnd."
        },
        {
            "name": "Projected Mental Grip (2)",
            "description": "You can now only target one of your minions. In addition to the spell's effects, all foes adj to the target are also grappled while the target is grappled."
        },
        {
            "name": "Shredding Mental Grip (2)",
            "description": "Whenever a target ends their turn grappled, it gets -1 phys res until the end of its next turn."
        },
        {
            "name": "Blinding Mirror Image (2)",
            "description": "When one of your illusory copies is destroyed, it explodes in a brilliant flash of light. A creature that destroys an illusory copy makes a CON save or is blind until the start of its next turn."
        },
        {
            "name": "Minor Mirror Image (2)",
            "description": "Can be cast as a 1st-lvl spell, but requires concentration when cast in this way."
        },
        {
            "name": "Nullifying Calm Emotions (2)",
            "description": "You can increase the area to a 60' sphere, but can only choose to suppress hostile feelings with the spell when you do so."
        },
        {
            "name": "Halting Calm Emotions (2)",
            "description": "You have a 3rd option of how to apply this spell to creatures: Roots the target in place. This ends if a target or any of its allies it can sense are targeted by any other hostile effect."
        },
        {
            "name": "Deadly Nathair's Mischief (2)",
            "description": "Is now a 3rd-level spell. Whenever a creature becomes affected by this spell (fails a save or is slowed by molasses), they take 2d10 slashing damage from whirling blades in the area."
        },
        {
            "name": "Reckless Nathair's Mischief (2)",
            "description": "All creatures have -2 to their saves against this spell."
        },
        {
            "name": "Refracting Skywrite (2)",
            "description": "All creatures on your landmass can see the writing so long as they can see the open sky."
        },
        {
            "name": "Influential Skywrite (2)",
            "description": "You have +1 to persuasion and deception checks for topics that the receiving creature has read in the skywriting in the past week."
        },
        {
            "name": "Swift Pyrotechnics (2)",
            "description": "Can now be cast as a bonus action."
        },
        {
            "name": "Blinding Pyrotechnics (2)",
            "description": "Creatures reduce their saving throws by 1 against the Fireworks."
        },
        {
            "name": "Penetrating See Invisibility (2)",
            "description": "For the duration, you ignore physical resistances."
        },
        {
            "name": "Revealing See Invisibility (2)",
            "description": "This is now a 3rd-lvl spell. Invisible creatures and objects you see are stripped of their invisibility while you can see them."
        },
        {
            "name": "Imparted Invisibility (2)",
            "description": "Until the spell ends, any object that the target picks up becomes invisible even after it is dropped."
        },
        {
            "name": "Instant Invisibility (2)",
            "description": "No longer requires concentration, but only lasts until the end of your next turn. Is no longer broken by the target attacking or casting a spell."
        },
        {
            "name": "Extroverted Flex (2)",
            "description": "The target's Charisma checks gain an additional +1 bonus for each creature the check is being made against."
        },
        {
            "name": "Charming Flex (2)",
            "description": "If a Charisma check made by the target is a positive social one, the target of the check is charmed for 1 minute if the check substantially succeeds."
        },
        {
            "name": "Exposing Ray of Enfeeblement (2)",
            "description": "The target also has -2 wep dmg res for the duration."
        },
        {
            "name": "Waring Ray of Enfeeblement (2) [DONE]",
            "description": "The target deals -3 dmg with its halved dmg atks, after halving, against creatures with temporary hit points."
        },
        {
            "name": "Focused Incite Greed (3)",
            "description": "The range decreases to 15' and the DC for substantial failures increases by 2."
        },
        {
            "name": "Wide Incite Greed (3)",
            "description": "The range increases to 60'."
        },
        {
            "name": "Dependable Glyph of Warding (3)",
            "description": "When the glyph is triggered, the spell does not end. Instead, the glyph's effects are suppressed for 24hrs, after which it can be triggered again."
        },
        {
            "name": "Flexible Glyph of Warding (3)",
            "description": "The glyph is no longer dispelled based on movement from its original position or proximity to another glyph."
        },
        {
            "name": "Distant Vampiric Touch (3)",
            "description": "Instead of making a melee spell attacks, you make ranged spell attacks (range 10/20') in the form of shadowy lines that streak from your hand."
        },
        {
            "name": "Called Vampiric Touch (3)",
            "description": "Damage dice increase to d10s vs marked targets."
        },
        {
            "name": "Sustained Sending (3)",
            "description": "The target has up to 1 minute to respond to you."
        },
        {
            "name": "Interplanar Sending (3)",
            "description": "When the target is on a different plane, the message and response can be of any length, so long as it could be spoken within 1 minute."
        },
        {
            "name": "Punishing Blood-Writ Bargain (3)",
            "description": "If the pact is broken, the other party releases a 30' nova of either rad or nec dmg (determined by the pact's enforcers) that only affects the offending party. The nova is a spell attack, dealing 7d6 damage."
        },
        {
            "name": "Synergistic Blood-Writ Bargain (3)",
            "description": "As part of casting this spell, you can also cast another spell without any change to the verbal or somatic components. The casting time is added on to this one's. Creatures familiar with this spell may notice the change in casting time."
        },
        {
            "name": "Durable Major Image (3)",
            "description": "The image can now take up to 30 damage (AC 10, +0 to saves) before being revealed as an illusion."
        },
        {
            "name": "Enticing Major Image (3)",
            "description": "The sounds and smells caused by the image are pleasant and soothing, granting the image +1 to positive social checks."
        },
        {
            "name": "Shredding Crushing Haymaker (3)",
            "description": "On substantial hit, the target gets -6 phys res until the end of your next turn."
        },
        {
            "name": "Reaching Crushing Haymaker (3)",
            "description": "The reach of the attack increases to 10'."
        },
        {
            "name": "Interrupting Counterspell (3)",
            "description": "The target creature must also end their turn immediately if they reshape their spell into a new one."
        },
        {
            "name": "Detonating Counterspell (3)",
            "description": "If the target creature reshapes their spell into a new one, make a spell attack against them as the arcane feedback detonates, dealing 7d6 force dmg."
        },
        {
            "name": "Focused Catnap (3)",
            "description": "Only 1 creature can now be targeted, but any dmg that wakes them is increased by 50%."
        },
        {
            "name": "Peaceful Catnap (3)",
            "description": "The targets can no longer be woken by shaking (etc.), but any dmg that wakes them is halved."
        },
        {
            "name": "Temporal Summon Shadowspawn (3)",
            "description": "The maximum duration is increased to 24hrs, but the spirit's speed is halved."
        },
        {
            "name": "Frosty Summon Shadowspawn (3)",
            "description": "After making its last attack, the shadowspawn creates a torrent of frigid air in a 30' line in the target's direction, a spell atk dealing 1d6 cold dmg."
        },
        {
            "name": "Overwhelming Plant Growth (3)",
            "description": "No longer requires the presence of pre-existing vegetation to take effect, but must use the Rapid option, and the new plants only last for 24hrs before fading away."
        },
        {
            "name": "Thorny Plant Growth (3)",
            "description": "For each space a creature moves through the Rapid option's plants, they gain 1 S DoT, stacking until CON save."
        },
        {
            "name": "Arcane Hypnotic Pattern (3)",
            "description": "Minimum casting level increases to 4th, but on use, recover 2 spell slot levels."
        },
        {
            "name": "Debilitating Hypnotic Pattern (3)",
            "description": "Targets are also debilitated while charmed."
        },
        {
            "name": "Repelling Poison Skin (3)",
            "description": "When a creature fails the initial saving throw, it is pushed 10' away from the target."
        },
        {
            "name": "Toxic Poison Skin (3)",
            "description": "When a creature fails the initial saving throw, an illusory toad hovers in the air above the target. Creatures within 60' of the toad take 1 additional dmg from this spell's DoT. The toad is dispelled when it takes dmg."
        },
        {
            "name": "Confiscating Dispel Magic (3)",
            "description": "When you dispel a spell that was cast using a spell slot at least 2 lvls lower than the one used for this spell, you can use your reaction to expend a spell slot of equal lvl to the dispelled spell to immediately cast it at a new target."
        },
        {
            "name": "Protective Dispel Magic (3)",
            "description": "On successfully dispelling a spell, gain 3 temp HP."
        },
        {
            "name": "Improved Summon Lesser Demons (3)",
            "description": "The demons deal 1d4 additional S dmg with all hits."
        },
        {
            "name": "Distracting Summon Lesser Demons (3)",
            "description": "While at least 1 of the demons is alive, you have +3 to medicine checks to stabilise downed creatures."
        },
        {
            "name": "Synergistic Magic Circle (3)",
            "description": "As part of this spell's casting, you can cast another spell without modifying the verbal or somatic components. The new spell's casting time is added to this one's. A creature familiar with this spell may notice the modified casting time."
        },
        {
            "name": "Defended Magic Circle (3)",
            "description": "At the centre of the circle, an illusion of yourself appears that grants the affected creatures -1 to attack rolls. The illusion is dispelled when it takes dmg."
        },
        {
            "name": "Intense Enemies Abound (3)",
            "description": "The maximum duration decreases to the end of the target's next turn, but all dmg they deal to your foes is increased by 1d12."
        },
        {
            "name": "Rapid Enemies Abound (3)",
            "description": "Can now be cast as a bonus action."
        },
        {
            "name": "Dyed Stinking Cloud (3)",
            "description": "Choose a colour for the cloud on cast. When a creature makes a save against this spell it is dyed that colour until it uses an action to wipe away the residue."
        },
        {
            "name": "Minor Stinking Cloud (3)",
            "description": "Can now be cast as a 2nd-lvl spell, but when you do so its fail DC is reduced by 1."
        },
        {
            "name": "Close Clairvoyance (3)",
            "description": "The range is now Self, and the sensor forms just above your head. The sensor allows you to see invisible creatures."
        },
        {
            "name": "Duplicated Clairvoyance (3)",
            "description": "You can concentrate on 2 instances of this spell. Instead of switching between senses for a sensor, you can instead switch between sensors."
        },
        {
            "name": "Enduring Bestow Curse (3)",
            "description": "The duration is now permanent, no longer requires your concentration, and the curse cannot be dispelled. The curse is only removed when a specific condition of your choice upon casting is met, which must be possible for the target to achieve, at the DM's discretion."
        },
        {
            "name": "Decaying Bestow Curse (3)",
            "description": "When using the ability score option, the target also has -1 from the relevant rolls."
        },
        {
            "name": "Military Fast Friends (3)",
            "description": "The target no longer gains adv on the save if you are in combat with it."
        },
        {
            "name": "Draining Fast Friends (3)",
            "description": "When the spell ends after at least 1 minute duration, the target gains 2 lvls of strife."
        },
        {
            "name": "Bolstering Remove Curse (3)",
            "description": "Every second curse you remove from the same creature grants them curse immunity for 1min."
        },
        {
            "name": "Minor Remove Curse (3)",
            "description": "Can now be cast as a 2nd-lvl spell, but when you do so, the max spell slot lvl of the curse's origin becomes 2nd and the max CR for feature curses becomes 4."
        },
        {
            "name": "Broad Tiny Hut (3)",
            "description": "The radius increases to 40' and can now contain up to Huge creatures, but the hut is no longer opaque from the outside."
        },
        {
            "name": "Shielding Tiny Hut (3)",
            "description": "If a creature finishes a rest with full HP inside the hut, it gains 18 temp HP"
        },
        {
            "name": "Comforting Nondetection (3)",
            "description": "When the spell ends, the target is healed for 3 HP."
        },
        {
            "name": "Alerting Nondetection (3)",
            "description": "The target knows whenever this spell blocks an effect."
        },
        {
            "name": "Generous Intellect Fortress (3)",
            "description": "Can no longer target yourself. Also grants +2 to mental saves."
        },
        {
            "name": "Hasty Intellect Fortress (3)",
            "description": "The target also has +10' sp for the duration."
        },
        {
            "name": "Explosive Thunder Step (3)",
            "description": "The minimum casting lvl for this spell increases to 4th, but the radius of the boom increases to 40'."
        },
        {
            "name": "Major Thunder Step (3)",
            "description": "The minimum casting lvl for this spell increases to 4th, but the dmg dice increase to d12s."
        },
        {
            "name": "Frostbitten Aspect of the Moon (3)",
            "description": "On hit with the claws, inflict 2 cold DoT, stacking until CON save."
        },
        {
            "name": "Reaching Aspect of the Moon (3)",
            "description": "The claws now have an additional 5' of reach."
        },
        {
            "name": "Courageous Battlecry Ballad (3)",
            "description": "Targets gain an expertise die on saves against fear for the duration."
        },
        {
            "name": "Penetrating Battlecry Ballad (3)",
            "description": "At 2+ stacks, all targets' dmg ignores resistances."
        },
        {
            "name": "Overgrowing Speak with Plants (3)",
            "description": "As part of the casting, you can also cast the Plant Growth spell as part of the same action. It still costs its usual resources."
        },
        {
            "name": "Grappling Speak with Plants (3)",
            "description": "Bloodied creatures in the difficult terrain the spell can cause are instead grappled, with your spell save DC as the escape DC."
        },
        {
            "name": "Refined Summon Fey (3)",
            "description": "Now has a casting time of a full turn action. The spirit's base max HP is increased to 48 + 16 per spell lvl above 3rd."
        },
        {
            "name": "Decaying Summon Fey (3)",
            "description": "The spirit's shortsword attack deals an additional 1d6 necrotic dmg."
        },
        {
            "name": "Reaching Spirit Shroud (3)",
            "description": "The range limit increases to 30'."
        },
        {
            "name": "Shocking Spirit Shroud (3)",
            "description": "The only dmg type that can be chosen is now lightning. The dmg die increases to a d12."
        },
        {
            "name": "Feasting Fear (3)",
            "description": "The spell affects every creature within 30' of you. When you first cast the spell and again at the start of each of your turns, you gain temporary hit points equal to the number of frightened creatures you can see within 30' of you."
        },
        {
            "name": "Bolstering Fear (3)",
            "description": "While at least 1 creature is affected, at the start of each of your turns, you gain 1 dmg resistance. This bonus lasts until a creature you frightened with this spell damages you after the spell's effects have ended completely."
        },
        {
            "name": "Nostalgic Speak with Dead (3)",
            "description": "You can ask 3 additional questions, but the target's memories only go up to 1 year prior to its death."
        },
        {
            "name": "Insightful Speak with Dead (3)",
            "description": "You have +3 to insight checks to determine if the target is lying."
        },
        {
            "name": "Swift Fly (3)",
            "description": "The flying speed increases to 90'."
        },
        {
            "name": "Cautious Fly (3)",
            "description": "If the spell ends when the target is airborne, they teleport to an empty space within 5' of you, if possible, instead of falling."
        },
        {
            "name": "Mass Tongues (3)",
            "description": "You can now target up to 4 creatures."
        },
        {
            "name": "Intimidating Tongues (3)",
            "description": "The target has +3 to intimidation against creatures who do not speak common for the duration."
        },
        {
            "name": "Shocking Summon Undead (3)",
            "description": "Grave Bolt's necrotic damage is converted to lightning, and its dmg die increases to 3d4. The Putrid Form's sources of poisoned are converted into double disadv on saves against debilitated. Instead of inflicting frightened, Deathly Touch deals an additional 2d6 lightning damage."
        },
        {
            "name": "Decaying Summon Undead (3)",
            "description": "On hit, the spirit inflicts 2 damage over time of the hit's base type, stacking until CON save."
        },
        {
            "name": "Desperate Gaseous Form (3)",
            "description": "While the target has fewer hit points than you, it can attack while affected."
        },
        {
            "name": "Scudding Gaseous Form (3) [DONE]",
            "description": "The target can now move through liquids, but they take 1 force dmg whenever they enter liquid or start their turn in liquid. The target can breathe any liquid for the duration."
        },
        {
            "name": "Incubated Greater Invisibility (4)",
            "description": "The spell's effects do not start until the second round of its duration. During this first round, the target has adv Defence and takes half dmg from all sources."
        },
        {
            "name": "Connected Greater Invisibility (4)",
            "description": "If the target is one of your minions, its atk hits deal critical dmg for the duration."
        },
        {
            "name": "Combative Sickening Radiance (4)",
            "description": "If you are not wielding any wands or staves, the dmg increases to 6d10."
        },
        {
            "name": "Efficient Sickening Radiance (4)",
            "description": "If the spell scores any natural critical hits during its first round, its spell slot cost is refunded."
        },
        {
            "name": "Matchmaking Charm Monster (4)",
            "description": "Your minions gain +2 on all social interactions with the target."
        },
        {
            "name": "Consequential Charm Monster (4)",
            "description": "In addition to considering you friendly, the target idolises you as someone they respect and admire more than any other. When the spell ends, the target also learns of your exact location."
        },
        {
            "name": "Splitting Raulothim's Psychic Lance (4)",
            "description": "You can now target 2 different creatures in the same manner, but the dmg of each is reduced to 3d10."
        },
        {
            "name": "Sacrificial Raulothim's Psychic Lance (4)",
            "description": "If your target is one of your minions, after the damage is dealt, all foes within 5' of the minion take the same amount of damage (and any other effects inflicted, such as conditions)."
        },
        {
            "name": "Reverse Dimension Door (4)",
            "description": "Instead of teleporting yourself, you specify a single creature to bring to an empty space within 5' of you, with the same details as the teleportation (replacing the space target with a creature target). The target cannot bring any other creatures with them."
        },
        {
            "name": "Personal Dimension Door (4)",
            "description": "You can no longer bring other creatures with you, but as another action within 1 minute of casting the spell, you can return to your original casting location."
        },
        {
            "name": "Reflective Freedom of Movement (4)",
            "description": "When the spell ends, any magical conditions that were nullified by the spell are reflected to the creatures causing them."
        },
        {
            "name": "Repulsive Freedom of Movement (4)",
            "description": "On cast, all foes within 5' of the target are pushed 20' away from them."
        },
        {
            "name": "Hissing Summon Aberration (4)",
            "description": "If a creature has taken dmg from the spirit's Whispering Aura since your last turn, you have +3 crit dice."
        },
        {
            "name": "Cruel Summon Aberration (4)",
            "description": "The spirit deals 3d4 additional dmg with atks against bloodied targets."
        },
        {
            "name": "Spreading Blight (4)",
            "description": "On hit, the target makes another CON save. On a fail, they receive a 2 necrotic DoT, stacking until CON save. Whenever they fail the save to end this DoT, you may have a creature of your choice within 5' of them be inflicted with the same effect (including the spreading)."
        },
        {
            "name": "Decaying Blight (4)",
            "description": "On hit, the target makes another CON save. On a fail, they receive a 3 necrotic DoT, stacking until CON save."
        },
        {
            "name": "Exhausting Confusion (4)",
            "description": "Now inflicts 1 lvl of strife instead of Confused. No longer requires concentration."
        },
        {
            "name": "Intense Confusion (4)",
            "description": "The spell's DC is increased by 2, but the maximum duration is reduced to 18 seconds."
        },
        {
            "name": "Shattering Polymorph (4)",
            "description": "Whenever the target delivers a Killing Blow, a cold nova is released from the corpse, making a spell attack using your stats against all foes within 5' of the corpse, dealing 1d10 cold on a hit"
        },
        {
            "name": "Heavy Polymorph (4)",
            "description": "The target can only make a maximum of 1 attack per turn. If this would reduce their number of attacks, their attacks deal 1d6 additional base damage."
        },
        {
            "name": "Revolutionary Divination (4)",
            "description": "Your non-trivial skill checks directly related to changing the divined answer have advantage."
        },
        {
            "name": "Prophetic Divination (4)",
            "description": "You may convey the answer you received to any other creatures within 30' of you, so long as they could understand the higher power (as if they had cast the spell themselves)."
        },
        {
            "name": "Brief Banishment (4)",
            "description": "When the target is the only foe within 60', the duration is always exactly 1 round, and no concentration is required."
        },
        {
            "name": "Challenging Banishment (4)",
            "description": "If you are not wielding any staves or wands, you go with the target into the destination plane."
        },
        {
            "name": "Generic Elemental Bane (4)",
            "description": "You can now choose up to 3 dmg types, but the target takes no extra dmg from critical hits."
        },
        {
            "name": "Thunderous Elemental Bane (4)",
            "description": "If the chosen type is thunder, the dmg increases to 4d4."
        },
        {
            "name": "Biding Shadow of Moil (4)",
            "description": "If a triggering attack is a critical hit, the shadows deal critical damage, with +1 crit dice. The base dmg is reduced to 1d12."
        },
        {
            "name": "Confronting Shadow of Moil (4)",
            "description": "All 10' radius effects are reduced to 5', but the dmg increases to 6d4."
        },
        {
            "name": "Pervading Tearful Sonnet (4)",
            "description": "Deals double damage against frightened creatures."
        },
        {
            "name": "Calming Tearful Sonnet (4)",
            "description": "While a creature is crying, it is also sluggish."
        },
        {
            "name": "Extended Locate Creature (4)",
            "description": "If you maintain concentration for the full hour, the duration can be maintained for another 23hrs."
        },
        {
            "name": "Polar Locate Creature (4)",
            "description": "You also learn the number of metres the creature is vertically up or down from you."
        },
        {
            "name": "Domicilian Hallucinatory Terrain (4)",
            "description": "The spell can now affect manufactured structures, and the illusions can appear as manufactured designs."
        },
        {
            "name": "Impersonating Hallucinatory Terrain (4)",
            "description": "The spell can now affect creatures in the area, changing their clothes, equipment, and/or physical appearances."
        },
        {
            "name": "Agile Accelerando (4)",
            "description": "A target's additional action can now be used to escape a grapple, and targets have advantage on saves made to avoid or escape grapples."
        },
        {
            "name": "Amplifying Accelerando (4)",
            "description": "Targets gain a bonus to their weapon dmg equal to the number of rounds the spell has been maintained."
        },
        {
            "name": "Absorbing Summon Greater Demon (4)",
            "description": "Your DoTs heal the demon instead of dmging it."
        },
        {
            "name": "Connected Summon Greater Demon (4) [DONE]",
            "description": "Whenever the demon hits a creature other than you, you heal 2 HP."
        },
        {
            "name": "Muddling Synaptic Static (5)",
            "description": "The muddled thoughts die increases to a d10."
        },
        {
            "name": "Slowing Synaptic Static (5)",
            "description": "If the spell targets 3+ creatures, choose one that was hit to become slowed for 1 minute."
        },
        {
            "name": "Overwhelming Dominate Person (5)",
            "description": "If the target fails their save but is already dominated, they instead release a psychic burst, forcing all creatures of your choice within 5' of them to make a WIS save or take 15d4 psy dmg."
        },
        {
            "name": "Bursting Dominate Person (5)",
            "description": "If the target fails their save, they release a psychic burst, forcing all creatures of your choice within 5' of them to make a WIS save or take 8d6 psy dmg."
        },
        {
            "name": "Morphing Seeming (5)",
            "description": "Changes to a target's body now hold up to physical inspection."
        },
        {
            "name": "Deceptive Seeming (5)",
            "description": "Creatures have disadvantage on insight checks against targets."
        },
        {
            "name": "Assisted Contact Other Plane (5)",
            "description": "Now requires a second creature to aid you in the casting. They must also pass the saving throw for the spell to work. If only 1 of you fails, the detrimental effects are halved. Each participant receives detrimental effects. If the spell is successful, the number of questions increases to 8."
        },
        {
            "name": "Valuable Contact Other Plane (5)",
            "description": "The first 2 times the answer to a question is either irrelevant or unclear, your question is refunded."
        },
        {
            "name": "Mobilising Far Step (5)",
            "description": "Whenever you use the bonus action on subsequent turns to teleport, all allies within 5' of your origin gain +15' sp during their next turn"
        },
        {
            "name": "Enduring Far Step (5)",
            "description": "If you maintain concentration for the full minute, the spell lasts an additional minute without requiring concentration. This only works if the spell was originally cast during combat."
        },
        {
            "name": "Sobering Greater Restoration (5)",
            "description": "The casting time is reduced to a bonus action, but only for charm or petrification effects."
        },
        {
            "name": "Healing Greater Restoration (5)",
            "description": "The target also heals hit points as if they had just healed with a hit die during a short rest."
        },
        {
            "name": "Preparatory Scrying (5)",
            "description": "If the target critically fails their save, they automatically fail all saving throws against the next concentration spell with a save you cast against them."
        },
        {
            "name": "Studying Scrying (5)",
            "description": "If the target fails their save, they have disadvantage on their next saving throw against one of your spells."
        },
        {
            "name": "Augmented Awaken (5)",
            "description": "When cast at higher levels, add 30 days to the charm effect of this spell for every 2 slot levels above 5th."
        },
        {
            "name": "Slippery Awaken (5)",
            "description": "Oozes can be targeted by this spell."
        },
        {
            "name": "Deadly Danse Macabre (5)",
            "description": "The minions have -2 crit req."
        },
        {
            "name": "Cruel Danse Macabre (5)",
            "description": "The minions deal +6 damage with weapon attacks against bloodied targets."
        },
        {
            "name": "Protective Wall of Light (5)",
            "description": "You have +3 phys res while the wall is active."
        },
        {
            "name": "Blazing Wall of Light (5)",
            "description": "Whenever the wall deals damage, it deals an additional 1d10 fire damage."
        },
        {
            "name": "Informed Commune (5)",
            "description": "If you have 15+ Intelligence, all subsequent casting 'no' percentages decrease by 25%."
        },
        {
            "name": "Efficient Commune (5)",
            "description": "20% chance to refund the spell's resource cost."
        },
        {
            "name": "Terrible Dream (5)",
            "description": "When you choose to terrorise a target and it fails its saving throw, it suffers an additional level of fatigue from lack of sleep. The terrorising message maximum length also increases to 25."
        },
        {
            "name": "Pleasant Dream (5)",
            "description": "When the target awakens, they gain temporary hit points equal to their hit die healing amount."
        },
        {
            "name": "Delving Commune with Nature (5)",
            "description": "The spell no longer fails in non-civilised dungeons."
        },
        {
            "name": "Toxicological Commune with Nature (5)",
            "description": "You can also learn about any magical poisons or diseases in the area."
        },
        {
            "name": "Summoning Negative Energy Flood (5)",
            "description": "Risen zombies can now be controlled by you as if they were a standard minion, but the spell gains a 6+ recharge."
        },
        {
            "name": "Conductive Negative Energy Flood (5)",
            "description": "While a creature has temporary hit points from this spell, you have +10 spell dmg."
        },
        {
            "name": "Cleaving Animate Objects (5)",
            "description": "The minion's attacks splash 6 damage."
        },
        {
            "name": "Unstable Animate Objects (5)",
            "description": "After the minion's 3rd hit, it dies. Its damage changes to 7d6 + 4."
        },
        {
            "name": "Corrective Raise Dead (5)",
            "description": "If the target was a boss that you killed, it is affected by this spell even if its soul is not willing to return to its body."
        },
        {
            "name": "Mass Raise Dead (5)",
            "description": "Targets an additional creature you touch."
        },
        {
            "name": "Channeled Enervation (5)",
            "description": "The subsequent action dmg die increases to d12."
        },
        {
            "name": "Toxic Enervation (5)",
            "description": "Whenever this spell deals damage, except for when the save is successful, the target makes a CON save or gets a 3 psn DoT, stacking until CON save"
        },
        {
            "name": "Pleasant Mislead (5)",
            "description": "If your copy is interacting with a creature that considers you friendly, your copy has adv on all social checks against that creature."
        },
        {
            "name": "Evasive Mislead (5)",
            "description": "Your copy has your AC and saving throws, and if it blocks an attack or succeeds a save, the attacker does not realise it is an illusion automatically. Your copy's speed is reduced to your speed."
        },
        {
            "name": "Debilitating Eldritch Cube (5)",
            "description": "A creature that takes 20+ dmg from this spell in a single instance is debilitated until the end of its next turn."
        },
        {
            "name": "Malignant Eldritch Cube (5)",
            "description": "If a target critically fails its save, a new cube spawns around them, in a location of your choice such that the target is in at least 1 of its spaces. Creatures cannot critically fail the save for this new cube. The persistent areas do not stack."
        },
        {
            "name": "Enduring Teleportation Circle (5)",
            "description": "The portal now remains open for 1 minute."
        },
        {
            "name": "Lingering Teleportation Circle (5)",
            "description": "Whenever a creature emerges from the portal, they may immediately teleport back to the spell's origin after sensing their new surroundings."
        },
        {
            "name": "Mass Hold Monster (5)",
            "description": "You can target an additional creature within range."
        },
        {
            "name": "Confusing Hold Monster (5)",
            "description": "The stagger is converted to confusion, but the target can no longer repeat the save to end the effect early."
        },
        {
            "name": "Cosmic Planar Binding (5)",
            "description": "The spell can also target aberrations."
        },
        {
            "name": "Mass Planar Binding (5)",
            "description": "When you cast this spell, there is a 20% chance that you can target any number of targets within range."
        },
        {
            "name": "Toxic Warrior's Instincts (5)",
            "description": "If you block an atk during this spell's effect, the atker must make a CON save or get a 5 psn DoT, stacking until CON save."
        },
        {
            "name": "Exsanguinating Warrior's Instincts (5)",
            "description": "On hit with the boosted weapon atk, the target must make a CON save or get a 5 S DoT, stacking until CON save."
        },
        {
            "name": "Enduring Geas (5)",
            "description": "The duration increases to 1 year."
        },
        {
            "name": "Protective Geas (5)",
            "description": "While the target is affected, they gain a hit die heal of temporary hit points at the end of each long rest."
        },
        {
            "name": "Emergency Modify Memory (5)",
            "description": "Within 1 minute after the spell ends, you may modify/create a single memory one more time, which occurs instantaneously."
        },
        {
            "name": "Contagious Modify Memory (5)",
            "description": "The target will feel compelled to express the modified details of its memories to the next creature it communicates with. You can choose any number of creatures you can see to be exempt from triggering this."
        },
        {
            "name": "Greater Infernal Calling (5)",
            "description": "This spell becomes a 6th-lvl spell. The devil can carry out a single order for up to 24 hours, but outside of orders will still disappear when it usually would."
        },
        {
            "name": "Stable Infernal Calling (5)",
            "description": "This spell becomes a 6th-lvl spell. It no longer requires concentration."
        },
        {
            "name": "Distant Skill Empowerment (5)",
            "description": "The range increases to 30'."
        },
        {
            "name": "Sudden Skill Empowerment (5)",
            "description": "The expertise from this spell instead grants the skill quadruple proficiency, but only for a single check."
        },
        {
            "name": "Huge Mass Cure Wounds (5)",
            "description": "The maximum target count increases to 8."
        },
        {
            "name": "Siphoning Mass Cure Wounds (5)",
            "description": "You gain 6 temp HP per creature healed, but each target also gains -1 passive regen for 1 min."
        },
        {
            "name": "Locating Legend Lore (5)",
            "description": "If you learn about a creature you have seen before, you also learn its current direction and distance from you."
        },
        {
            "name": "Rapid Legend Lore (5) [DONE]",
            "description": "The casting time is reduced to 1 action."
        }
    ],
    "manual": [
        {
            "name": "Improved Overrun (0)",
            "description": "+1 basic damage."
        },
        {
            "name": "Grievous Overrun (0)",
            "description": "On hit, target makes a CON save or gets 1 slashing DoT, stacking until passive CON save."
        },
        {
            "name": "Shadowy Grapple (0)",
            "description": "While grappling a target, gain adv on DEX saves."
        },
        {
            "name": "Frosty Grapple (0)",
            "description": "Basic damage is converted to cold. The grapple on hit is converted into sluggish, and the target makes a CON save or this sluggish becomes staggered instead. All conditions last until the end of your next turn."
        },
        {
            "name": "Rapid Disarm (0)",
            "description": "Can be used as a bonus action if you've made an Attack action this turn."
        },
        {
            "name": "Forceful Disarm (0)",
            "description": "You knock the item up to 60' away in a direction of your choice. Gains a 6+ recharge."
        },
        {
            "name": "Forceful Shove (0)",
            "description": "Shove distance is always increased by 5'."
        },
        {
            "name": "Punishing Shove (0)",
            "description": "Manifest blades on your hands and arms as you push. On hit, also make melee wep atk against target that deals 1 S dmg."
        },
        {
            "name": "Enduring Grab On (0)",
            "description": "You must be successfully shaken off twice in order to actually be thrown off a creature you are grabbing on."
        },
        {
            "name": "Deadly Grab On (0)",
            "description": "+1 to all damage you deal to creatures you are grabbing on to."
        },
        {
            "name": "Massive Knockdown (0)",
            "description": "+1 basic damage for each condition on the target."
        },
        {
            "name": "Crippling Knockdown (0)",
            "description": "The target cannot stand up during their next turn."
        },
        {
            "name": "Bleeding Anticipate Spell (1)",
            "description": "On hit with the opportunity attack, target makes a CON save or gets 3 S DoT, stacking until passive CON save."
        },
        {
            "name": "Impactful Anticipate Spell (1)",
            "description": "On use, deals 1d6 base weapon damage to the target. Costs 1 additional exertion."
        },
        {
            "name": "Exposing Painful Pickpocket (1)",
            "description": "A creature you have looted has -1 damage resistance."
        },
        {
            "name": "Berserking Painful Pickpocket (1)",
            "description": "On successful Sleight of Hand vs Perception with this, you gain +1 dmg for your next melee attack. If that attack hits, this bonus continues to your next melee attack and increases by 1, stacking until you miss."
        },
        {
            "name": "Immediate Charge (1)",
            "description": "Always counts as a charge attack, regardless of distance travelled."
        },
        {
            "name": "Fiery Charge (1)",
            "description": "The attack is replaced with the target making a DEX save or getting a 7 fire DoT, stacking until DEX save"
        },
        {
            "name": "Sapping Deceptive Stance (1)",
            "description": "On substantial Killing Blow while active, refund any exertion spent on this maneuver."
        },
        {
            "name": "Mental Deceptive Stance (1)",
            "description": "On use, a psychic rift erupts from you as a 5' self-burst spell atk only targeting foes, dealing 1d4 psy"
        },
        {
            "name": "Icy Speed Over Strength (1)",
            "description": "The attack's damage is converted to cold. On hit with the attack, target makes a CON save or is staggered until the end of your next turn."
        },
        {
            "name": "Immolating Speed Over Strength (1)",
            "description": "On hit with the attack, target makes a DEX save or gets 3 fire DoT, stacking until DEX save."
        },
        {
            "name": "Hasty Perplexing Flurry (1)",
            "description": "You make an additional attack, but it has disadvantage."
        },
        {
            "name": "Slippery Perplexing Flurry (1)",
            "description": "While the target is affected, you can move through its space."
        },
        {
            "name": "Cornered Eye Slash (1)",
            "description": "While bloodied, the attack deals +1d12 base dmg."
        },
        {
            "name": "Infectious Eye Slash (1)",
            "description": "While the target is affected, it radiates a 5' aura that affects your foes, triggering a CON save or be slowed until their next turn."
        },
        {
            "name": "Empowered Swift Stance (1)",
            "description": "Your speed increases by a further 5' for every 2 bonus global damage you have."
        },
        {
            "name": "Lightweight Swift Stance (1)",
            "description": "Your speed increases by a further 5', but you have -1 global dmg for the duration."
        },
        {
            "name": "Shredding Agile Feint (2)",
            "description": "If the atk substantially hits, the target gets -3 phys res until the end of your next turn"
        },
        {
            "name": "Distant Agile Feint (2)",
            "description": "The adv is only granted if the atk's target is 10'+ away from you, but the atk has -2 crit req."
        },
        {
            "name": "Braced Force Hesitation (2)",
            "description": "Now costs 3 exertion, but you have +8 res against the target's atks for the duration."
        },
        {
            "name": "Projected Force Hesitation (2)",
            "description": "If the target fails their save, all foes within 5' of them get -1 phys res until end of your next turn"
        },
        {
            "name": "Warding Mugging Hit (2)",
            "description": "If you successfully take something from the target with the sleight of hand check, gain 8 temp HP."
        },
        {
            "name": "Frustrated Mugging Hit (2)",
            "description": "Now costs 2 exertion, but if the target has nothing to take with the sleight of hand check, the atk deals 1d8 additional base dmg."
        },
        {
            "name": "Sacrificial Parrying Counter (2)",
            "description": "Now costs a free action, but you lose 1 hit point whenever you block any atk for the duration."
        },
        {
            "name": "Worrying Parrying Counter (2)",
            "description": "On hit with the counter atk, the target makes a WIS save or gets 3 psy DoT, stacking until WIS save."
        },
        {
            "name": "Empowering Rapid Drink (2)",
            "description": "The creature who drinks the potion has +1 to their condi DCs until the end of their next turn."
        },
        {
            "name": "Energising Rapid Drink (2)",
            "description": "Now costs a standard action, but the creature who drinks the potion's next limited feature will refund its resource costs."
        },
        {
            "name": "Rejuvenating Rolling Strike (2)",
            "description": "If you move 10'+, halfway through your movement you leave a L1 healing globe on the ground that can only be collected by yourself or allies in that space as a bonus action. It remains there for the combat."
        },
        {
            "name": "Vorpal Rolling Strike (2)",
            "description": "The atk has -1 crit req."
        }
    ]
}