{
    "tome": [
        {
            "name": "Conductive Lightning Lure (0)",
            "description": "+1 damage per cantrip tier per active minion."
        },
        {
            "name": "Anchoring Lightning Lure (0)",
            "description": "Duration is now 'Concentration, up to 1 minute'. The on-cast effect remains the same. At the start of your turn while concentrating, you can pull the target up to 10' towards you, with no other effect."
        },
        {
            "name": "Eternal Frostbite (0)",
            "description": "The disadvantage is now for all attacks the target makes until it passes a passive save. Gains a 6+ recharge."
        },
        {
            "name": "Spreading Frostbite (0)",
            "description": "All creatures of your choice within 5' of the target also suffer the disadvantage effect."
        },
        {
            "name": "Dextrous Magic Stone (0)",
            "description": "If a stone's thrower has 15+ DEX, it has +1 AB."
        },
        {
            "name": "Heavy Magic Stone (0)",
            "description": "The stones can now only be used to make melee spell atks, but on a hit, the target makes a CON save or is debilitated until the end of the attacker's next turn."
        },
        {
            "name": "Possessive Mage Hand (0)",
            "description": "As an action, you can attach the hand to a creature within 5' of it. Whenever a creature starts their turn with the hand attached to them, they gain a stacking +1 spell damage bonus, which lasts until the hand is detached from them. Can detach as part of the hand's usual activity."
        },
        {
            "name": "Rapid Mage Hand (0)",
            "description": "The hand can now exist up to 60' away from you, and when it moves you can move it up to 60'."
        },
        {
            "name": "Empowering Minor Illusion (0)",
            "description": "For the duration, you gain +1 global damage for each foe who is currently tricked by the illusion."
        },
        {
            "name": "Distant Minor Illusion (0)",
            "description": "Range increases to 60'."
        },
        {
            "name": "Wintery Chill Touch (0)",
            "description": "Damage is converted to cold, heal block is converted to slow, and undead is converted to fiend. Damage die is increased to d10."
        },
        {
            "name": "Thorny Chill Touch (0)",
            "description": "1/min, when a condition is inflicted on you, you may cast the spell instantly."
        },
        {
            "name": "Greater True Strike (0)",
            "description": "Duration increases to Concentration, up to 1 minute and you gain advantage with 3 additional attack rolls of your choice that are made before the spell ends. Once per round, you can choose to use one of these 4 advantages when you make your first attack roll on your turn."
        },
        {
            "name": "Sapping True Strike (0)",
            "description": "If you score a Killing Blow with the enhanced attack roll, the spell lasts an additional round, granting your next turn's first attack advantage as well. This extra duration does not require Concentration."
        },
        {
            "name": "Taunting Vicious Mockery (0)",
            "description": "On hit, the target has disadvantage on all attack rolls made before the end of its next turn, and if it makes an attack, it must target you. Persuasion checks you make against the target have disadvantage permanently."
        },
        {
            "name": "Harrowing Vicious Mockery (0)",
            "description": "On cast, all foes within 30' of the target, except the target, become frightened until the end of their next turn."
        },
        {
            "name": "Rejuvenating Green-Flame Blade (0)",
            "description": "If the weapon attack critically hits, you recover a 1st-level spell slot."
        },
        {
            "name": "Sapping Green-Flame Blade (0)",
            "description": "Any creature that takes damage makes a CON save or is sluggish until the end of your next turn."
        },
        {
            "name": "Major Cure Wounds (1)",
            "description": "Healing die is increased to 2d8. Gains a 6+ recharge."
        },
        {
            "name": "Staggered Cure Wounds (1)",
            "description": "At the start of your next turn, the target heals 1d4 hit points."
        },
        {
            "name": "Enduring Silent Image (1)",
            "description": "Maximum duration is increased to 24 hours."
        },
        {
            "name": "Empowering Silent Image (1)",
            "description": "Your other spells are always upcast 1 level for free for the duration."
        },
        {
            "name": "Precarious Longstrider (1)",
            "description": "Targets ignore non-magical difficult terrain for the duration."
        },
        {
            "name": "Cautious Longstrider (1)",
            "description": "Effect ends on a target when they become bloodied, and heals them for 2d8 hit points."
        },
        {
            "name": "Contaminating Searing Equation (1)",
            "description": "Deafen is converted to poison. Spell immunity replaced with creatures immune to poisons, or have a Constitution score higher than 20."
        },
        {
            "name": "Exposing Searing Equation (1)",
            "description": "On hit, target takes 1 additional psychic damage whenever they take psychic damage until the end of your next turn."
        },
        {
            "name": "Infectious Hideous Laughter (1)",
            "description": "Any creature that touches an affected creature must also succeed on a WIS save or be affected."
        },
        {
            "name": "Despairing Hideous Laughter (1)",
            "description": "When the mirth fades, the target is affected with crushing grief, sadness, and despair, causing it to sob uncontrollably. The target has disadvantage on the first d20 roll it makes after the spell ends."
        },
        {
            "name": "Exciting Healing Word (1)",
            "description": "Target has an additional bonus action during their next turn."
        },
        {
            "name": "Warding Healing Word (1)",
            "description": "If you roll at least one 4 on healing dice, gain 1d8 temporary hit points."
        },
        {
            "name": "Unnerving Bane (1)",
            "description": "Targets are rattled for the duration."
        },
        {
            "name": "Tormenting Bane (1)",
            "description": "Targets have disadvantage on their next saving throw against the frightened condition."
        },
        {
            "name": "Glowing Heroism (1)",
            "description": "Target glows with bright light in a 10' radius and dim light for an additional 5'. When a creature within the target's glow regains hit points, it regains 1d4 additional points."
        },
        {
            "name": "Inspiring Heroism (1)",
            "description": "Creatures of your choice within 60' of the target also cannot be frightened."
        },
        {
            "name": "Elongated Phantasmal Talons (1)",
            "description": "Your unarmed attacks also have +5' reach for the duration."
        },
        {
            "name": "Leeching Phantasmal Talons (1)",
            "description": "On scoring a critical hit with your unarmed attacks during the duration, heal 1 hit point."
        },
        {
            "name": "Purging Lemure Transformation (2)",
            "description": "On cast, remove any conditions of your choice from yourself."
        },
        {
            "name": "Efficient Lemure Transformation (2)",
            "description": "Can be cast as a 1st-level spell."
        },
        {
            "name": "Blinding Darkness (2)",
            "description": "Creatures leaving area must make CON save or be blinded for 1 minute, or until passing a passive save."
        },
        {
            "name": "Enfeebling Darkness (2)",
            "description": "On cast, creatures of your choice in the area are debilitated until the end of your next turn."
        },
        {
            "name": "Supported Heat Metal (2)",
            "description": "If you have 2+ active minions on casting, can also target another creature adjacent to original target."
        },
        {
            "name": "Burning Heat Metal (2)",
            "description": "On dealing the bonus action damage, the target gets 1 fire DoT, stacking until passive CON save."
        },
        {
            "name": "Mocking Magic Mouth (2)",
            "description": "When cast with a single-event trigger, you can choose to cast Vicious Mockery through the mouth's message."
        },
        {
            "name": "Frenzying Magic Mouth (2)",
            "description": "Upon triggering for the first time, you gain an additional standard action until the end of your next turn. You can still only perform the same action once per turn."
        },
        {
            "name": "Merciful Mind Spike (2)",
            "description": "Damage increases to 3d10 against targets with less than maximum hit points."
        },
        {
            "name": "Erasing Mind Spike (2)",
            "description": "Damage increases to 3d12 against bloodied targets."
        },
        {
            "name": "Lengthened Hold Person (2)",
            "description": "Duration increases to Concentration, up to 1 hour."
        },
        {
            "name": "Improved Hold Person (2)",
            "description": "Is always upcast 1 level, but you have disadvantage on Concentration saves to maintain the spell."
        },
        {
            "name": "Indiscriminate Animal Messenger (2)",
            "description": "Can target any Tiny creature of Intelligence 3 or less."
        },
        {
            "name": "Overcharged Animal Messenger (2)",
            "description": "Has a minimum casting level of 3, and the message can be up to 50 words."
        },
        {
            "name": "Efficient Shatter (2)",
            "description": "Always upcast 1 level, but the range is reduced to 30'."
        },
        {
            "name": "Slowing Shatter (2)",
            "description": "On hit, a target must make a Constitution save or become slowed until the end of your next turn."
        },
        {
            "name": "Extended Locate Animals or Plants (2)",
            "description": "The range increases to on the same landmass as you."
        },
        {
            "name": "Travelling Locate Animals or Plants (2)",
            "description": "If an entity is detected, your party's overland travel speed is doubled for the next 24 hours."
        }
    ],
    "manual": [
        {
            "name": "Improved Overrun (0)",
            "description": "+1 basic damage."
        },
        {
            "name": "Grievous Overrun (0)",
            "description": "On hit, target makes a CON save or gets 1 slashing DoT, stacking until passive CON save."
        },
        {
            "name": "Shadowy Grapple (0)",
            "description": "While grappling a target, gain an expertise die on DEX saves."
        },
        {
            "name": "Frosty Grapple (0)",
            "description": "Basic damage is converted to cold. The grapple on hit is converted into sluggish, and the target makes a CON save or this sluggish becomes staggered instead. All conditions last until the end of your next turn."
        },
        {
            "name": "Rapid Disarm (0)",
            "description": "Can be used as a bonus action if you've made an Attack action this turn."
        },
        {
            "name": "Shadowy Disarm (0)",
            "description": "You knock the item up to 60' away in a direction of your choice. Gains a 6+ recharge."
        },
        {
            "name": "Forceful Shove (0)",
            "description": "Shove distance is always increased by 5'."
        },
        {
            "name": "Punishing Shove (0)",
            "description": "Manifest blades on your hands and arms as you push. On hit, also make melee wep atk against target that deals 1 S dmg."
        },
        {
            "name": "Enduring Grab On (0)",
            "description": "You must be successfully shaken off twice in order to actually be thrown off a creature you are grabbing on."
        },
        {
            "name": "Deadly Grab On (0)",
            "description": "+1 to all damage you deal to creatures you are grabbing on to."
        },
        {
            "name": "Massive Knockdown (0)",
            "description": "+1 basic damage for each condition on the target."
        },
        {
            "name": "Crippling Knockdown (0)",
            "description": "The target cannot stand up during their next turn."
        },
        {
            "name": "Bleeding Anticipate Spell (1)",
            "description": "On hit with the opportunity attack, target makes a CON save or gets 3 S DoT, stacking until passive CON save."
        },
        {
            "name": "Impactful Anticipate Spell (1)",
            "description": "On use, deals 1d6 base weapon damage to the target. Costs 1 additional exertion."
        },
        {
            "name": "Blinding Point Blank Shot (1)",
            "description": "On hit with the opportunity attack, the target is blinded until the end of your next turn."
        },
        {
            "name": "Icy Point Blank Shot (1)",
            "description": "On hit with a ranged attack against an adjacent target for the duration, the target makes a CON save or gets a 1 cold DoT, stacking until CON save. The opportunity attack is replaced with the target getting a 5 cold DoT, stacking until CON save."
        },
        {
            "name": "Frozen Farshot Stance (1)",
            "description": "Your ranged weapon attack base damage is converted to cold for the duration. +3 cold damage for the duration."
        },
        {
            "name": "Tethered Farshot Stance (1)",
            "description": "Your ranged weapon range decreases by 5' and damage increases by 1 per turn ended in the stance"
        },
        {
            "name": "Exposing Painful Pickpocket (1)",
            "description": "A creature you have looted has -1 damage resistance."
        },
        {
            "name": "Berserking Painful Pickpocket (1)",
            "description": "On successful Sleight of Hand vs Perception with this, you gain +1 dmg for your next melee attack. If that attack hits, this bonus continues to your next melee attack and increases by 1, stacking until you miss."
        },
        {
            "name": "next (1)",
            "description": ""
        },
        {
            "name": "next (1)",
            "description": ""
        },
        {
            "name": "next (1)",
            "description": ""
        },
        {
            "name": "next (1)",
            "description": ""
        }
    ]
}