{
    "tome": [
        {
            "name": "Conductive Lightning Lure (0)",
            "description": "+1 damage per cantrip tier per active minion."
        },
        {
            "name": "Anchoring Lightning Lure (0)",
            "description": "Duration is now 'Concentration, up to 1 minute'. The on-cast effect remains the same. At the start of your turn while concentrating, you can pull the target up to 10' towards you, with no other effect."
        },
        {
            "name": "Eternal Frostbite (0)",
            "description": "The disadvantage is now for all attacks the target makes until it passes a passive save. Gains a 6+ recharge."
        },
        {
            "name": "Spreading Frostbite (0)",
            "description": "All creatures of your choice within 5' of the target also suffer the disadvantage effect."
        },
        {
            "name": "Dextrous Magic Stone (0)",
            "description": "If a stone's thrower has 15+ DEX, it has +1 AB."
        },
        {
            "name": "Heavy Magic Stone (0)",
            "description": "The stones can now only be used to make melee spell atks, but on a hit, the target makes a CON save or is debilitated until the end of the attacker's next turn."
        },
        {
            "name": "Possessive Mage Hand (0)",
            "description": "As an action, you can attach the hand to a creature within 5' of it. Whenever a creature starts their turn with the hand attached to them, they gain a stacking +1 spell damage bonus, which lasts until the hand is detached from them. Can detach as part of the hand's usual activity."
        },
        {
            "name": "Rapid Mage Hand (0)",
            "description": "The hand can now exist up to 60' away from you, and when it moves you can move it up to 60'."
        },
        {
            "name": "Empowering Minor Illusion (0)",
            "description": "For the duration, you gain +1 global damage for each foe who is currently tricked by the illusion."
        },
        {
            "name": "Distant Minor Illusion (0)",
            "description": "Range increases to 60'."
        },
        {
            "name": "Wintery Chill Touch (0)",
            "description": "Damage is converted to cold, heal block is converted to slow, and undead is converted to fiend. Damage die is increased to d10."
        },
        {
            "name": "Thorny Chill Touch (0)",
            "description": "1/min, when a condition is inflicted on you, you may cast the spell instantly."
        },
        {
            "name": "Greater True Strike (0)",
            "description": "Duration increases to Concentration, up to 1 minute and you gain advantage with 3 additional attack rolls of your choice that are made before the spell ends. Once per round, you can choose to use one of these 4 advantages when you make your first attack roll on your turn."
        },
        {
            "name": "Sapping True Strike (0)",
            "description": "If you score a Killing Blow with the enhanced attack roll, the spell lasts an additional round, granting your next turn's first attack advantage as well. This extra duration does not require Concentration."
        },
        {
            "name": "Taunting Vicious Mockery (0)",
            "description": "On hit, the target has disadvantage on all attack rolls made before the end of its next turn, and if it makes an attack, it must target you. Persuasion checks you make against the target have disadvantage permanently."
        },
        {
            "name": "Harrowing Vicious Mockery (0)",
            "description": "On cast, all foes within 30' of the target, except the target, become frightened until the end of their next turn."
        },
        {
            "name": "Rejuvenating Green-Flame Blade (0)",
            "description": "If the weapon attack critically hits, you recover a 1st-level spell slot."
        },
        {
            "name": "Sapping Green-Flame Blade (0)",
            "description": "Any creature that takes damage makes a CON save or is sluggish until the end of your next turn."
        },
        {
            "name": "Hasty Mending (0)",
            "description": "Casting time is reduced to a bonus action, but there is a 20% chance for the object to be disintegrated into a pile of ashes."
        },
        {
            "name": "Lasting Mending (0)",
            "description": "The object cannot be damaged for the next minute."
        },
        {
            "name": "Reverberating Altered Strike (0)",
            "description": "After damage is rolled, it is halved and instead applied as a DoT, stacking until the target makes a DEX save."
        },
        {
            "name": "Cataclysmic Altered Strike (0)",
            "description": "Damage dealt by the attack is converted to fire. Any resistance reductions applied by the attack are converted to fire DoTs of the same number, stacking until the target makes a DEX save. The attack deals 2 additional fire damage per cantrip tier."
        },
        {
            "name": "Exhaling Circular Breathing (0)",
            "description": "You can end the spell early as a free action on your turn to exhale, releasing a forceful breath in a 5' self-burst only affecting foes as a wep atk, dealing 1d4 B"
        },
        {
            "name": "Protective Circular Breathing (0)",
            "description": "+1 dmg res for the duration."
        },
        {
            "name": "Rushed Message (0)",
            "description": "Can be cast as a free action, but for the duration you have -1 dmg resistance"
        },
        {
            "name": "Volatile Message (0)",
            "description": "A psychic rift erupts from the target, and all foes within 5' of them receive a spell atk, dealing 1d4 psy per cantrip tier."
        },
        {
            "name": "Forceful Calculate (0)",
            "description": "On cast, creatures of your choice are pushed up to 5' away from you per cantrip tier."
        },
        {
            "name": "Energising Calculate (0)",
            "description": "For the duration, you have +1 passive temp HP gen per cantrip tier."
        },
        {
            "name": "Cautious Friends (0)",
            "description": "If the target becomes hostile from the spell, you have +1 dmg res per cantrip tier against them until your next rest"
        },
        {
            "name": "Deep Friends (0)",
            "description": "The bonus also applies to knowledge checks made about the target for the duration."
        },
        {
            "name": "Anchored Dancing Lights (0)",
            "description": "Duration becomes 1 hour, without concentration, but the lights can no longer be moved once cast."
        },
        {
            "name": "Plentiful Dancing Lights (0)",
            "description": "Creates up to 4 additional lights."
        },
        {
            "name": "Improved Prestidigitation (0)",
            "description": "All numeric values in effects increase by 1 per cantrip tier."
        },
        {
            "name": "Complex Prestidigitation (0)",
            "description": "On cast, you can choose 1 additional effect to occur per cantrip tier. The max effects active at once increases to 4."
        },
        {
            "name": "Decaying Create Bonfire (0)",
            "description": "On hit, target makes a CON save or gets -1 per cantrip tier to saves to end ongoing effects until the end of their next turn"
        },
        {
            "name": "Revolutionary Create Bonfire (0)",
            "description": "On boss hit, target makes a CON save or a 15x15' flaming ground pers area is left beneath them until the end of their next turn, making spell atks against foes dealing 1d4 fire per cantrip tier"
        },
        {
            "name": "Extended Poison Spray (0)",
            "description": "Range increases to 30'."
        },
        {
            "name": "Major Poison Spray (0)",
            "description": "Can target 1 additional target in range, but is now a 1st-lvl spell."
        },
        {
            "name": "Extended Thunderclap (0)",
            "description": "Range increases to 10'."
        },
        {
            "name": "Hexed Thunderclap (0)",
            "description": "Damage die increases to 1d8 vs cursed targets."
        },
        {
            "name": "Major Cure Wounds (1)",
            "description": "Healing die is increased to 2d8. Gains a 6+ recharge."
        },
        {
            "name": "Staggered Cure Wounds (1)",
            "description": "At the start of your next turn, the target heals 1d4 hit points."
        },
        {
            "name": "Enduring Silent Image (1)",
            "description": "Maximum duration is increased to 24 hours."
        },
        {
            "name": "Empowering Silent Image (1)",
            "description": "Your other spells are always upcast 1 level for free for the duration."
        },
        {
            "name": "Precarious Longstrider (1)",
            "description": "Targets ignore non-magical difficult terrain for the duration."
        },
        {
            "name": "Cautious Longstrider (1)",
            "description": "Effect ends on a target when they become bloodied, and heals them for 2d8 hit points."
        },
        {
            "name": "Contaminating Searing Equation (1)",
            "description": "Deafen is converted to poison. Spell immunity replaced with creatures immune to poisons, or have a Constitution score higher than 20."
        },
        {
            "name": "Exposing Searing Equation (1)",
            "description": "On hit, target takes 1 additional psychic damage whenever they take psychic damage until the end of your next turn."
        },
        {
            "name": "Infectious Hideous Laughter (1)",
            "description": "Any creature that touches an affected creature must also succeed on a WIS save or be affected."
        },
        {
            "name": "Despairing Hideous Laughter (1)",
            "description": "When the mirth fades, the target is affected with crushing grief, sadness, and despair, causing it to sob uncontrollably. The target has disadvantage on the first d20 roll it makes after the spell ends."
        },
        {
            "name": "Exciting Healing Word (1)",
            "description": "Target has an additional bonus action during their next turn."
        },
        {
            "name": "Warding Healing Word (1)",
            "description": "If you roll at least one 4 on healing dice, gain 1d8 temporary hit points."
        },
        {
            "name": "Unnerving Bane (1)",
            "description": "Targets are rattled for the duration."
        },
        {
            "name": "Tormenting Bane (1)",
            "description": "Targets have disadvantage on their next saving throw against the frightened condition."
        },
        {
            "name": "Glowing Heroism (1)",
            "description": "Target glows with bright light in a 10' radius and dim light for an additional 5'. When a creature within the target's glow regains hit points, it regains 1d4 additional points."
        },
        {
            "name": "Inspiring Heroism (1)",
            "description": "Creatures of your choice within 60' of the target also cannot be frightened."
        },
        {
            "name": "Elongated Phantasmal Talons (1)",
            "description": "Your unarmed attacks also have +5' reach for the duration."
        },
        {
            "name": "Leeching Phantasmal Talons (1)",
            "description": "On scoring a critical hit with your unarmed attacks during the duration, heal 1 hit point."
        },
        {
            "name": "Rattling Faerie Fire (1)",
            "description": "When an affected creature is damaged by a weapon attack it takes 1d4 additional psychic damage and is rattled until the end of its next turn."
        },
        {
            "name": "Isolating Faerie Fire (1)",
            "description": "On hit, all creatures of your choice adjacent to the target are pushed 5' away from the target."
        },
        {
            "name": "Penetrating Detect Magic (1)",
            "description": "Your first cantrip cast after casting the spell ignores resistances."
        },
        {
            "name": "Refining Detect Magic (1)",
            "description": "Your minions you can see with a magic aura have -1 crit req."
        },
        {
            "name": "Ravaging Dissonant Whispers (1)",
            "description": "On sub hit, radiate an aura for the remainder of combat that gives you -1 passive regen and deals 3 psy spell dmg"
        },
        {
            "name": "Hellish Dissonant Whispers (1)",
            "description": "Damage is converted to fire. Instead of using their reaction, the target gets 1 fire DoT, stacking until DEX save. The next instance of fire dmg you deal does 1d4 additional fire dmg."
        },
        {
            "name": "Vengeful Hellish Rebuke (1)",
            "description": "Deals additional fire dmg equal to the number of times you have been hit by the target in the past minute."
        },
        {
            "name": "Infernal Hellish Rebuke (1)",
            "description": "The next time the target hits you, it makes a DEX save or gets 6 fire DoT, stacking until DEX save."
        },
        {
            "name": "Intense Charm Person (1)",
            "description": "The target is extremely friendly towards you, but the duration is reduced to 1 minute."
        },
        {
            "name": "Enlightening Charm Person (1)",
            "description": "When the effect ends, you can cast a cantrip on the target (max cast time of action)."
        },
        {
            "name": "Glowing Heroism (1)",
            "description": "The target glows with bright light in a 10' radius and dim light for an additional 5'. When a creature within this glow regains hit points, it regains 1d4 additional hit points."
        },
        {
            "name": "Improved Heroism (1)",
            "description": "The temporary hit points granted is increased by 1."
        },
        {
            "name": "Shady Disguise Self (1)",
            "description": "You gain an expertise die in Stealth checks for the duration."
        },
        {
            "name": "Blinding Disguise Self (1)",
            "description": "On cast, all creatures of your choice within 30' of you are blinded until the end of your turn."
        },
        {
            "name": "Ebbing Arms of Hadar (1)",
            "description": "Every 2nd casting of the spell in a single combat doubles its radius."
        },
        {
            "name": "True Arms of Hadar (1)",
            "description": "Each target rolls a d20 if they don't crit fail the save. On a 1, the spell critically hits them."
        },
        {
            "name": "Liberating Protection From Evil and Good (1)",
            "description": "The target also gains the condition protection against restrained."
        },
        {
            "name": "Unstable Protection From Evil and Good (1)",
            "description": "If you lose concentration on the spell, a psychic rift erupts from the target, making a spell atk against all foes within 5' of them, dealing 1d4 psy."
        },
        {
            "name": "Signature Illusory Script (1)",
            "description": "20% chance to refund the spell slot cost, but casting time is increased to 1hr."
        },
        {
            "name": "General Illusory Script (1)",
            "description": "Instead of designating specific creatures to be able to read the true message, you can instead designate categories of creatures."
        },
        {
            "name": "Traumatic Hex (1)",
            "description": "Your next hit against the target prompts a CON save or debils them until the end of their next turn"
        },
        {
            "name": "Cleansing Hex (1)",
            "description": "On cast, remove all negative conditions, diseases, curses, and marks from yourself."
        },
        {
            "name": "Purging Lemure Transformation (2)",
            "description": "On cast, remove any conditions of your choice from yourself."
        },
        {
            "name": "Efficient Lemure Transformation (2)",
            "description": "Can be cast as a 1st-level spell."
        },
        {
            "name": "Blinding Darkness (2)",
            "description": "Creatures leaving area must make CON save or be blinded for 1 minute, or until passing a passive save."
        },
        {
            "name": "Enfeebling Darkness (2)",
            "description": "On cast, creatures of your choice in the area are debilitated until the end of your next turn."
        },
        {
            "name": "Supported Heat Metal (2)",
            "description": "If you have 2+ active minions on casting, can also target another creature adjacent to original target."
        },
        {
            "name": "Burning Heat Metal (2)",
            "description": "On dealing the bonus action damage, the target gets 1 fire DoT, stacking until passive CON save."
        },
        {
            "name": "Mocking Magic Mouth (2)",
            "description": "When cast with a single-event trigger, you can choose to cast Vicious Mockery through the mouth's message."
        },
        {
            "name": "Frenzying Magic Mouth (2)",
            "description": "Upon triggering for the first time, you gain an additional standard action until the end of your next turn. You can still only perform the same action once per turn."
        },
        {
            "name": "Merciful Mind Spike (2)",
            "description": "Damage increases to 3d10 against targets with less than maximum hit points."
        },
        {
            "name": "Erasing Mind Spike (2)",
            "description": "Damage increases to 3d12 against bloodied targets."
        },
        {
            "name": "Lengthened Hold Person (2)",
            "description": "Duration increases to Concentration, up to 1 hour."
        },
        {
            "name": "Improved Hold Person (2)",
            "description": "Is always upcast 1 level, but you have disadvantage on Concentration saves to maintain the spell."
        },
        {
            "name": "Indiscriminate Animal Messenger (2)",
            "description": "Can target any Tiny creature of Intelligence 3 or less."
        },
        {
            "name": "Overcharged Animal Messenger (2)",
            "description": "Has a minimum casting level of 3, and the message can be up to 50 words."
        },
        {
            "name": "Efficient Shatter (2)",
            "description": "Always upcast 1 level, but the range is reduced to 30'."
        },
        {
            "name": "Slowing Shatter (2)",
            "description": "On hit, a target must make a Constitution save or become slowed until the end of your next turn."
        },
        {
            "name": "Extended Locate Animals or Plants (2)",
            "description": "The range increases to on the same landmass as you."
        },
        {
            "name": "Travelling Locate Animals or Plants (2)",
            "description": "If an entity is detected, your party's overland travel speed is doubled for the next 24 hours."
        },
        {
            "name": "Lasting Blindness/Deafness (2)",
            "description": "Deafened targets cannot end the spell early."
        },
        {
            "name": "Sapping Blindness/Deafness (2)",
            "description": "On a failed initial save, a target makes an additional CON save or is also sluggish for the duration."
        },
        {
            "name": "Persistent Shattering Barrage (2)",
            "description": "The shards of broken glass fall, turning the area they occupy into difficult terrain, instead of dissolving harmlessly."
        },
        {
            "name": "Molten Shattering Barrage (2)",
            "description": "If you hit with 1+ orb, your minions add 2d8 fire dmg to their hits until the end of their next turn."
        },
        {
            "name": "Chilling Shadow Blade (2)",
            "description": "On hit with the weapon, target makes a CON save or is sluggish until the end of your next turn."
        },
        {
            "name": "Vorpal Shadow Blade (2)",
            "description": "Critical hits with the weapon deal 1d8 additional psy dmg (not multiplied by crit)."
        },
        {
            "name": "Guarded Enhance Ability (2)",
            "description": "When the target makes a save using the chosen ability, it can react to end the spell and gain adv on the save."
        },
        {
            "name": "Stable Enhance Ability (2)",
            "description": "No longer requires concentration."
        },
        {
            "name": "Hunting Silence (2)",
            "description": "As action for the duration, you can move the bubble up to 120' in any direction, so long as you can still see at least 1 space of it at all times and its centre remains within 120' of you."
        },
        {
            "name": "Recovering Silence (2)",
            "description": "If dispelled, the spell returns as if it were not dispelled at the end of your next turn."
        },
        {
            "name": "Supplementary Zone of Truth (2)",
            "description": "If you have a spell slot available to cast the spell, it has no spell slot cost when initially cast, but consumes its normal cost (if possible) at the end of its duration."
        },
        {
            "name": "Intimidating Zone of Truth (2)",
            "description": "When a creature fails the save, it also becomes frightened of you for the duration. This ends if the creature or any of its allies it can sense take damage."
        },
        {
            "name": "Elusive Misty Step (2)",
            "description": "Until the start of your next turn after casting, attack rolls against you are made with disadvantage."
        },
        {
            "name": "Signature Misty Step (2)",
            "description": "Can be cast as a 1st-lvl spell, but you have -1 passive regen while you have no 1st-lvl spell slots remaining."
        },
        {
            "name": "Staunching Lesser Restoration (2)",
            "description": "Can also remove a DoT from the target."
        },
        {
            "name": "Siphoning Lesser Restoration (2)",
            "description": "The removed effect is manifested as a CR 1/2 shadow minion that deals a dmg type based on the effect removed (nec, rad, thunder, light, psn)."
        },
        {
            "name": "Major Enthrall (2)",
            "description": "The spell now has a minimum casting level of 3. It also grants you advantage on all Deception checks against the targets, and the targets disadvantage on all Insight checks against you."
        },
        {
            "name": "Minor Enthrall (2)",
            "description": "Can now be cast as a 1st-lvl spell. The targets also need to be able to see you for the spell to be cast and maintained."
        },
        {
            "name": "Minor Suggestion (2)",
            "description": "Can now be cast as a 1st-lvl spell. You can no longer make suggestions based off of triggers."
        },
        {
            "name": "Shady Suggestion (2)",
            "description": "You gain an expertise die in Stealth checks while active."
        },
        {
            "name": "Synergistic Locate Object (2)",
            "description": "You can share this spell's concentration with that of the Locate Creature spell."
        },
        {
            "name": "Instant Locate Object (2)",
            "description": "Also tells you the distance of the located object from you. The maximum duration is reduced 6 seconds. Instead of learning its trajectory while travelling, you instead learn how many metres above the ground the object is."
        }
    ],
    "manual": [
        {
            "name": "Improved Overrun (0)",
            "description": "+1 basic damage."
        },
        {
            "name": "Grievous Overrun (0)",
            "description": "On hit, target makes a CON save or gets 1 slashing DoT, stacking until passive CON save."
        },
        {
            "name": "Shadowy Grapple (0)",
            "description": "While grappling a target, gain an expertise die on DEX saves."
        },
        {
            "name": "Frosty Grapple (0)",
            "description": "Basic damage is converted to cold. The grapple on hit is converted into sluggish, and the target makes a CON save or this sluggish becomes staggered instead. All conditions last until the end of your next turn."
        },
        {
            "name": "Rapid Disarm (0)",
            "description": "Can be used as a bonus action if you've made an Attack action this turn."
        },
        {
            "name": "Shadowy Disarm (0)",
            "description": "You knock the item up to 60' away in a direction of your choice. Gains a 6+ recharge."
        },
        {
            "name": "Forceful Shove (0)",
            "description": "Shove distance is always increased by 5'."
        },
        {
            "name": "Punishing Shove (0)",
            "description": "Manifest blades on your hands and arms as you push. On hit, also make melee wep atk against target that deals 1 S dmg."
        },
        {
            "name": "Enduring Grab On (0)",
            "description": "You must be successfully shaken off twice in order to actually be thrown off a creature you are grabbing on."
        },
        {
            "name": "Deadly Grab On (0)",
            "description": "+1 to all damage you deal to creatures you are grabbing on to."
        },
        {
            "name": "Massive Knockdown (0)",
            "description": "+1 basic damage for each condition on the target."
        },
        {
            "name": "Crippling Knockdown (0)",
            "description": "The target cannot stand up during their next turn."
        },
        {
            "name": "Bleeding Anticipate Spell (1)",
            "description": "On hit with the opportunity attack, target makes a CON save or gets 3 S DoT, stacking until passive CON save."
        },
        {
            "name": "Impactful Anticipate Spell (1)",
            "description": "On use, deals 1d6 base weapon damage to the target. Costs 1 additional exertion."
        },
        {
            "name": "Blinding Point Blank Shot (1)",
            "description": "On hit with the opportunity attack, the target is blinded until the end of your next turn."
        },
        {
            "name": "Icy Point Blank Shot (1)",
            "description": "On hit with a ranged attack against an adjacent target for the duration, the target makes a CON save or gets a 1 cold DoT, stacking until CON save. The opportunity attack is replaced with the target getting a 5 cold DoT, stacking until CON save."
        },
        {
            "name": "Frozen Farshot Stance (1)",
            "description": "Your ranged weapon attack base damage is converted to cold for the duration. +3 cold damage for the duration."
        },
        {
            "name": "Tethered Farshot Stance (1)",
            "description": "Your ranged weapon range decreases by 5' and damage increases by 1 per turn ended in the stance"
        },
        {
            "name": "Exposing Painful Pickpocket (1)",
            "description": "A creature you have looted has -1 damage resistance."
        },
        {
            "name": "Berserking Painful Pickpocket (1)",
            "description": "On successful Sleight of Hand vs Perception with this, you gain +1 dmg for your next melee attack. If that attack hits, this bonus continues to your next melee attack and increases by 1, stacking until you miss."
        },
        {
            "name": "Immediate Charge (1)",
            "description": "Always counts as a charge attack, regardless of distance travelled."
        },
        {
            "name": "Fiery Charge (1)",
            "description": "The attack is replaced with the target making a DEX save or getting a 7 fire DoT, stacking until DEX save"
        },
        {
            "name": "Extended Covering Fire (1)",
            "description": "Range increases to your weapon's long range."
        },
        {
            "name": "Leeching Covering Fire (1)",
            "description": "For each opportunity attack a creature would have otherwise provoked, heal 1 HP."
        },
        {
            "name": "Sapping Deceptive Stance (1)",
            "description": "On Killing Blow while active, 20% chance to refund exertion spent on maneuver."
        },
        {
            "name": "Mental Deceptive Stance (1)",
            "description": "On use, a psychic rift erupts from you as a 5' self-burst spell atk only targeting foes, dealing 1d4 psy"
        },
        {
            "name": "Minor Doubleshot (1)",
            "description": "20% chance to refund exertion cost, but the attack must be made this turn"
        },
        {
            "name": "Proactive Doubleshot (1)",
            "description": "If used during the first round of a combat, the attack deals 1d20 additional base damage."
        },
        {
            "name": "Icy Speed Over Strength (1)",
            "description": "The attack's damage is converted to cold. On hit with the attack, target makes a CON save or is staggered until the end of your next turn."
        },
        {
            "name": "Immolating Speed Over Strength (1)",
            "description": "On hit with the attack, target makes a DEX save or gets 3 fire DoT, stacking until DEX save."
        },
        {
            "name": "Hasty Perplexing Flurry (1)",
            "description": "You make an additional attack, but it has disadvantage."
        },
        {
            "name": "Slippery Perplexing Flurry (1)",
            "description": "While the target is affected, you can move through its space."
        },
        {
            "name": "Cornered Eye Slash (1)",
            "description": "While bloodied, the attack deals +1d12 base dmg."
        },
        {
            "name": "Infectious Eye Slash (1)",
            "description": "While the target is affected, it radiates a 5' aura that affects your foes, triggering a CON save or be slowed until their next turn."
        },
        {
            "name": "Empowered Swift Stance (1)",
            "description": "Your speed increases by a further 5' for every 2 bonus global damage you have."
        },
        {
            "name": "Lightweight Swift Stance (1)",
            "description": "Your speed increases by a further 5', but you have -1 global dmg for the duration."
        }
    ]
}