{
    "Thaddeus": [
        {
            "description": "Whenever the target of your Shield of Faith is hit by a melee attack, the attacker takes rad spell dmg equal to triple your bonus outgoing healing",
            "pointValue": "1",
            "upgrade": "+1 outgoing healing/1"
        },
        {
            "description": "The bonus AC for upcasting your Shield of Faith is increased by 2. Additionally, it needs 2 fewer slot levels per upcast bonus.",
            "pointValue": "4",
            "upgrade": "+1 AC/1"
        },
        {
            "description": "The Healer feat's heal action now has a range of 10'.",
            "pointValue": "2",
            "upgrade": "+5'/2"
        },
        {
            "description": "After 5th level, the Healer feat's heal action scales in die count every 5 levels instead of 6.",
            "pointValue": "2",
            "upgrade": "-1 threshold/2"
        }
    ],
    "Zacharias": [
        {
            "description": "Your Magic Missile base force damage is converted to necrotic damage, and if all darts target the same creature, you heal 2 HP.",
            "pointValue": "2",
            "upgrade": "+1/1"
        },
        {
            "description": "Whenever you cast a cantrip as an action, you may also cast False Life as part of the same action.",
            "pointValue": "4",
            "upgrade": "false life as a bonus action -> free action/4"
        },
        {
            "description": "Whenever your False Life spell ends, you only lose half of its remaining temporary hit points, which last until long rest. Additionally, your False Life grants 3 additional temporary hit points.",
            "pointValue": "1",
            "upgrade": "+2/1"
        },
        {
            "description": "Your False Life is always upcast 1 level.",
            "pointValue": "2",
            "upgrade": "+1/2"
        }
    ],
    "Siggusmondo": [
        {
            "description": "The first time in a turn a creature fails a saving throw from you, you may trigger your Gathered Swarm.",
            "pointValue": "2",
            "upgrade": "+1 to your ongoing debuff DCs/4"
        },
        {
            "description": "The Summoned Minion from your Summoner feat has +1 AB",
            "pointValue": "2",
            "upgrade": "+1/2"
        },
        {
            "description": "The Summoned Minion from your Summoner feat has +5 max HP",
            "pointValue": "1",
            "upgrade": "+5/1"
        }
    ],
    "Vehemir": [
        {
            "description": "Your Speak with Animals now lasts 8 hours",
            "pointValue": "1",
            "upgrade": "+1 duration step/1"
        },
        {
            "description": "Allies can Help you with animal handling checks you make with beasts you are communicating with via Speak with Animals",
            "pointValue": "1",
            "upgrade": "+4 to these Helped animal handling checks/1"
        }
    ]
}