{
    "hostile": [
        {
            "name": "Phase Spider",
            "id": 2,
            "tags": ["night"]
        },
        {
            "name": "Kraghammer Goat-Knight",
            "id": 9,
            "tags": []
        },
        {
            "name": "Giant Ant Queen",
            "id": 10,
            "tags": ["night"]
        },
        {
            "name": "Bridge of Sorrow",
            "id": 6,
            "tags": ["night", "terrain", "exploration"]
        },
        {
            "name": "Bridge of Stones",
            "id": 11,
            "tags": ["night", "terrain", "exploration"]
        },
        {
            "name": "Choking Smoke",
            "id": 12,
            "tags": ["night", "terrain", "exploration"]
        }
    ],
    "positive": [
        "Zachary: wants a game of ropes and rafters, will give reward for each player who beats him (prof in DEX saves + aths + sleight of hand, lets players choose their positions)",
        "Bored traveller ($gender $race): excited by adventurers, wants to see them face-off against each other (will give full heal potions to each of them after) in free-for-all style combat. Top 2 get reward.",
        "Bored traveller ($gender $race): wants the players to race, make aths checks and each success tier adds 5' to their speed. Rewards winner.",
        "Bored traveller ($gender $race): wants to play a game of Marco Polo. stealth vs prof perception, last remaining will be rewarded. All players set up on map 30' from traveller. Roll town initiative for who will say 'Polo' first, then traveller will move 15' straight towards someone whenever they fail.",
        "Generous traveller ($gender $race): gives all players a reward for free",
        "Bored traveller ($gender $race): each player must give a number from 1 to 99, then DM rolls 1d100. The player who gets below their roll but the highest numbers are rewarded.",
        "Skillmaster ($gender $race): wants all players to show their skill in $skill, rewards anyone who passes DC 13",
        "Linguist ($gender $race): will say a sentence in random languages until at least 1 party member understands the language, then he will reward all understanders",
        "Lore Nerd ($gender $race): wants to quiz the players about their favourite amulet set. Each player rolls a d20, then a random amulet set is chosen. Going from the highest roller down, each player must say the name of one of the members of that set. Doesn't say if people are correct, and incorrect answers can be corrected by later players. All correct are rewarded.",
        "Bored Noble ($gender $race): wants to see poor people engorge themselves, as it's their favourite past time. Will provide endless food, players make CON saves starting at DC 5, going up a tier each round, longest lasting is rewarded.",
        "Bored Warrior ($gender $race): wants to see which adventurer can deal the most damage in one single turn. They can have as much prep-time as they like, and will be attacking their training dummy (counts as a construct creature).",
        "Bored Inventor ($gender $race): has 3 random objects with them (https://perchance.org/object - anything not from the setting is their own invention). Each player must secretly write down an invention or thing to do with those three objects. Best one is rewarded.",
        "Bored Psychic ($gender $race): has 4x random objects with them (https://perchance.org/object - anything not from the setting is their own invention). Each player rolls a d20. Going from the highest roller down, each player must secretly write down which object they consider 'the best', and what they think the next player will consider 'the best'. Each player gets 1pt for being predicted, and 1pt for predicting. All players with the highest non-zero score are rewarded.",
        "Bored Gambler ($gender $race): wants the players to play liar's dice with each other. Each rolls a d20 to determine turn order (descending), then secretly rolls 5d6. Each player's turn has two options: call the previous bid a lie (ending the game), or raising the bid. Bids bet on the MINIMUM of how many of a certain die face is present on the WHOLE table. Raising a bid means either increasing die quantity or face value (never reducing either). A successful lie callout is rewarded, as is being called out incorrectly.",
        "Bored Psychic ($gender $race): wants each player to make their own 3x3 bingo board of tarot cards that are remaining in the deck, must be done secretly. Tarot cards are drawn until someone scores bingo, then they are rewarded.",
        "Bored traveller ($gender $race): wants the adventurers to play 2 truths and a lie with each other, about either their backstories, loot, or class features. Continues until a round ends with a winner. Someone wins when they trick all others, but also correctly guesses at least one other player that same round.",
        "Bored Zoologist ($gender $race): gives the players a random animal (https://www.randomlists.com/random-animals?show_images=false&dup=false&qty=1), the one who can perform the best sound for that animal is rewarded.",
        "Generous traveller ($gender $race): offers 3 random positive encounter rewards, and DM ranks them from best to worst. The worst will have a 50% chance of being awarded, the middle 33%, and the best 16% (1-3, 4-5, and 6 on a d6). Players roll d20s to determine order in which they choose one of those options to bet on, whoever wins their bet gets their reward.",
        "Bickering trio (3x $gender $race): three people arguing in a circle. If confronted, they say that one of them ate their spare rations in the middle of the night last night (https://randommer.io/random-food-generator) (roll d4: 1 neither did it and it was a wild animal, 2 person 1 did it, 3 person 2 did it, 4 person 3 did it). P1's favourite food was what was left of the spare rations; P2 was supposed to be on watch at the time but claims they fell asleep; P3 got in a fight about the amount of rations to bring before the trip, wanting more. Ask players to help resolve the quarrel. If they get it right, they each get rewarded because they confess, otherwise they protest intensely about being left behind and the others feel bad so only give the highest insight a reward.",
        "Bored Chef ($gender $race): chooses a random food (https://randommer.io/random-food-generator). The players each roll a d20 to determine turn order (descending), and the chef gives an initial clue of 'food type' (eg. meat, vegetable, fruit, grain, etc.). Players each write down a secret guess and reveal together. Any correct are rewarded. If none get it right, in turn order each guess, a player can ask a yes or no question.",
        "Travelling Devil: generates a random affix, negates it, and gives it a max point value of -10. Then, players each roll a d20 to determine turn order (descending), and it asks them in turn order how many rewards they are willing to receive that affix for an unknown amount of time for (25% chance to remove after each combat). He also tells them that he has an upper limit of rewards that he will not disclose (10), and if he doesn't have enough for what they ask for, they get nothing and still get the affix. Then he asks the next player if they can go lower on the offer, etc. If the players unionise, he complains that that's no fun and disappears, leaving behind a sack containing 1 reward that the players will have to fight over.",
        "Bored Carnie ($gender $race): sets up 4 targets and randomly allocates one of them as the prize target. Players each roll a d20 to determine turn order (descending), and take turns attacking a target of their choice (AC 13). On hitting a target, it is removed. If it was the prize target, that person is rewarded a number of times equal to the remaining number of targets.",
        "Bored Salesperson ($gender $race): has 4x random objects (https://perchance.org/object - anything not from the setting is their own invention) and players roll a d20 for turn order (descending). Players take turns choosing one of the objects and then doing a sales pitch to the salesperson. At the end of the round the best pitch will be rewarded."
    ]
}