{
    "plains": [
        "The Jabberwocky (13)",
        "The Fateholder (14)",
        "The Festering Sewer Tunnels (15)"
    ],
    "forest": [
        "JACK: Cueyatl Sea Priest (8)"
    ],
    "mountain": [
        "KING: Harpy (12)",
        "JACK: Cueyatl Sea Priest (8)"
    ],
    "aquatic": [
        "JACK: Cueyatl Sea Priest (8)"
    ],
    "positive": [
        "Zachary: wants a game of ropes and rafters, will give reward for each player who beats him (prof in DEX saves + aths)",
        "Bored Traveller ($gender $race): excited by adventurers, wants to see them face-off against each other (will give full heal potions to each of them after) in tournament style. Top 2 get reward.",
        "Flower Person ($gender $race): hurriedly hands each player a giant sunflower (heavy obj), then rides off in a canter, faster than the players",
        "Acrobat ($gender $race): wants to see impressive routines/tricks, acro check",
        "Giant dog walker ($gender $race): has 4 dogs, they're squabbling, need to be calmed with animal handling check",
        "Magic box: many different sections sealed with magic rune puzzle, arcana check to unlock section",
        "Bored traveller ($gender $race): wants the players to race, make aths checks and each success tier adds 5' to their speed. Rewards top 2 players",
        "Bored Traveller ($gender $race): wants to play a game of 2 truths and a lie (players talk), says they're very insightful. deception vs +2 insight, any who win get reward",
        "Historian ($gender $race): wants to hear new trivia, history check",
        "Bored Traveller ($gender $race): wants to play a game where they state something to each player and each player must guess truth or lie, prof decep vs player insight, each success is rewarded",
        "Guardian soldiers transporting criminals: 4 criminals, the criminals aren't talking, so soldiers ask the players if they can try intimidating each of them to get more info out of them, will reward each successful",
        "Puzzle box: multiple sections locked, investigation check opens a section",
        "Group of wounded people: each requests separate medical attention, they don't die but will reward if successful medicine check",
        "Confused travellers: picked various berries to eat while travelling, want to avoid getting sick, ask travellers to identify good ones with nature checks",
        "Whispers on the wind: each player makes percep check, success means they hear the directions to a nearby reward",
        "Bored traveller ($gender $race): wants to be entertained, asks each char to perform for him, gives reward for each successful performance check",
        "Generous traveller ($gender $race): wants to give things away, but only to people who deserve them, are good people. persuasion vs insight (prof)",
        "Altar to $xiloan: pray with religion check for reward",
        "Lockbox: multiple locked sections, can be picked with sleight of hand",
        "Bored traveller ($gender $race): wants to play a game of Marco Polo. stealth vs +2 perception, last 2 players remaining will be rewarded",
        "Hungry traveller ($gender $race): asks players to forage some food for them around, survival check",
        "Generous traveller ($gender $race): Gives all players a reward for free"
    ]
}