[
    {
        "name": "Knows Too Much",
        "description": "Learning about Mensis and his minions",
        "tiers": [
            "1. Eldritch Connection: at will; bonus action; uncannily, you learn the name of any one person, place, or thing you can see",
            "2. You gain a random beneficial mutation",
            "3. Tenebrous Prophesy: 1/minute; bonus action; Your mind is filled with a jumble of prophetic images and sensations, granting you a dangerous peek at the predicted future. You gain double advantage on your next roll, but something negative will occur in the near future",
            "4. Soul of the Hound: 1/LR; bonus action; You allow the stored instincts of a vicious creature to enter your mind psychically through your connection to the outer worlds, granting you enhanced, barely controlled reflexes. For the next 10 minutes, you gain +2 to natural weapon AB, but you cannot end hostile combats until you kill at least one creature in them, even if no enemies remain",
            "5. You are overrun by the unnatural urges of eldritch beings, pushing you to violence and madness. Whenever you actively engage in lustful, violent, or otherwise animalistic acts for at least 10 minutes, you heal 2d6 + 2x your level hit points",
            "6. You gain a standard mutation of your choice (DM will balance from description)",
            "7. Your Eldritch Connection feature is now a free action",
            "8. Gain a random beneficial mutation",
            "9. Your Tenebrous Prophesy feature can now be used twice per minute",
            "10. Your Soul of the Hound feature can now be used once per minute"
        ]
    },
    {
        "name": "Wakes From Death",
        "description": "Waking up from death",
        "tiers": [
            "1. When you die, you instead add one point to your Immortality Pool and enter a coma for 24 hours. If your body is completely destroyed, it reforms again in the nearest safe place, but your equipment does not go with it. When you awake, you heal up to 40 + double your Immortality Pool hit points.",
            "2. +2 history",
            "3. Because you know you cannot die, you have developed strange techniques for dealing with foes. When attacked by a creature within 5', you can elect to take the hit by hurling yourself on the attacker's weapon. When doing this, you leave the creature shocked by your seemingly insane actions, stunning them until the end of their next turn. If you succeed on a STR save with DC 8 + the creature's attacks' AB, you disarm them by lodging the weapon inside your own body. They must succeed on a contested STR check against you to recover it.",
            "4. Channelling your immortality, you can spend points from your Immortality Pool to heal 2 HP per point as a free action at any time.",
            "5. When you die, you can choose to spend 5 Immortality points to instantly regenerate instead of waiting 24 hours.",
            "6. Your experience, memories, and ability to survive have granted you many perks. Your maximum HP is increased by 10 and your built-up scar tissue grants you +1 AC.",
            "7. Past Life: 1/week; bonus action; Peering into your past, you can pull forth the memory of an ability from a previous life, feeling memories flowing back into your mind. You can cast any cantrip.",
            "8. Release of Death: at will; action; You have mastered the forces that grant you eternal life and have found a way to release the energy directly. On death, you can elect to release the forces that rebuild you as a burst of energy that converts your entire Immortality Pool into 6x the amount + your level as 5. against all creatures you choose within 120'.",
            "9. When using your Release of Death feature, you can choose to release yourself from the endless cycle of rebirth. All damage dealt is doubled, but you lose your immortality and die outright. Your next character retains this character's memories and starts with proficiency in history.",
            "10. Your coma when reviving now lasts 1 hour instead of 24."
        ]
    },
    {
        "name": "Battles Automatons",
        "description": "Battling constructs",
        "tiers": [
            "1. You inflict 6 additional points of damage against constructs.",
            "2. You have studied your enemy and are trained in anticipating the actions that an automaton or machine is likely to take in a fight. You have advantage on saving throws against constructs' effects.",
            "3. +2 to skill checks to track, spot, or otherwise find constructs. Additionally, gain +2 stealth.",
            "4. Disable Mechanisms: 1/minute; bonus action; With a keen eye and quick moves, you can touch a construct within your reach to disrupt some of its functions and inflict upon it one of the following maladies: it has disdavantage on all d20 rolls for 1 min; its speed is halved until repaired; it is incapacitated (ignoring immunity) until the end of its next turn; it deals -4 global damage for 1 min",
            "5. If attacking from stealth, with surprise, or before your target has acted in the current combat, your attack automatically hits. Additionally, a similar attack inflicts 4 additional points of damage.",
            "6. When fighting a construct, you have advantage on attack rolls against them and their attack rolls have disadvantage against you.",
            "7. +2 AB against constructs.",
            "8. Drain Power: 1/LR; bonus action; you affect the main power source of a construct within your reach you touch, inflicting upon it all four conditions listed in your Disable Mechanisms feature.",
            "9. Blind Machine: 1/week; bonus action; You deactivate the sensory apparatus of a construct you either touch or hit with a ranged attack (which deals no damage if using this effect), blinding (ignoring immunity) it until it is repaired.",
            "10. Deactivate Mechanisms: 1/LR; bonus action; Make a melee attack that inflicts no damage against a construct. Instead, if the attack hits, make a sleight of hand check against the target's AC. If successful, a construct of CR 3 or lower is unconscious (ignoring immunity) for 1 min."
        ]
    },
    {
        "name": "Employs a Cutaneous Interface",
        "description": "Gain an esoteric computing system beneath your skin",
        "tiers": [
            "1. Conductivity: at will; bonus action; you connect with a magical object or construct within your reach, allowing you to access its usual abilities and interfaces by tapping glowing buttons and symbols that appear on your forearm, though actually knowing how to use these functions may still require an Arcana check. The connection lasts for 10 minutes or until you are further than 120' away from the object.",
            "2. Mana Scan: 2/minute; bonus action; you scan an area up to 120' away for any magical objects or constructs you could interface with through your Conductivity feature.",
            "3. You are able to access readouts for your own life signs through your interfaces. You have advantage on medicine checks used on yourself. The added information also grants you +2 to incoming healing while you can see your skin.",
            "4. Deep Conducting: 1/SR; bonus action; after having used your Conductivity feature with an object, you may employ this feature, granting you access to its most guarded functions, such as autodestruct, hidden information, or complex operations. This connection lasts for the same duration as your use of Conductivity.",
            "5. Reset: 1/LR; bonus action; you program your body to restart its own functions. You immediately fall unconscious for 1d6 rounds, at the end of which you reawaken, having removed all conditions, curses, and diseases afflicting you and healing 6 hit points.",
            "6. Redesign: 1/week; bonus action; you alter your internal functions for a time, granting you +1 to all ability score modifiers. This effect lasts for 1 hour.",
            "7. Your Conductivity feature no longer has a range limit.",
            "8. Your Mana Scan feature can now be used at will.",
            "9. +2 medicine.",
            "10. Your Deep Conducting feature can now be used twice per minute."
        ]
    },
    {
        "name": "Howls at the Moon",
        "description": "Becoming a lycanthrope",
        "tiers": [
            "1. On five consecutive nights each month, you change into a monstrous beast for up to one hour each night. In this new form, you gain +6 STR and +3 DEX. While in beast form, you cannot cast spells. You can use a bonus action to attempt to revert to your normal form with a CHA save of DC 6 before the one hour is over. In addition, you attack any and every living creature within 30' of you. After you revert to your normal form, you have -1 to all d20 rolls for 1 hour. If you did not kill and eat at least one small or larger creature while in beast form, this penalty increases to -2 and lasts for 24 hours.",
            "2. You can attempt to change into your beast form on any night you wish as a bonus action. You must succeed on a CHA check of DC 9 to do so. Any transformations you make using this feature are in addition to the 5 nights per month when you change involuntarily.",
            "3. Your beast form grows larger than before, increasing its size by one stage. Being so large, your beast form gains the following additional benefits: AC +1, STR +2, and your unarmed attacks deal 1d12 damage if they don't already deal more. However, your DEX saves have disadvantage. While transformed, you also gain advantage on tasks that are easier for a larger creature to perform, like climbing, intimidating, wading rivers, and so on.",
            "4. Your beast form gains the following additional bonuses: +2 STR and +3 DEX.",
            "5. It is easier to change into and out of your beast form. Transforming either way now has a DC of 6.",
            "6. Your beast form gains the following additional bonuses: +1 STR, +1 DEX, and +2 AC",
            "7. Your attacks deal +10 damage while in beast form.",
            "8. You no longer need to make a roll to change into your beast form or your normal form. You can change back and forth as a bonus action. When you return to your normal form, you no longer take a penalty to your rolls.",
            "9. Your beast form now lasts for up to 8 hours.",
            "10. Changing into your beast form is now a free action."
        ]
    },
    {
        "name": "Scales the Impossible",
        "description": "Scaling high structures",
        "tiers": [
            "1. You are immune to any fear-based effects.",
            "2. +2 athletics and acrobatics.",
            "3. Eye for a Challenge: 2/minute; bonus action; you can calculate the distance of any surface or expanse you can see and also learn the DC of the climb.",
            "4. +2 survival. Additionally, you gain +2 DEX and +1 WIS.",
            "5. You gain resistance to weather-related damage. Additionally, you have advantage on Strength saving throws against natural elements.",
            "6. Reflexive Grab: 1/minute; free action; you automatically succeed on a Dexterity check or saving throw to stop yourself or someone else from falling.",
            "7. You gain resistance to falling damage.",
            "8. +2 to athletics and acrobatics",
            "9. Great Assistance: 1/LR; free action; your check to climb something also counts as the climb roll for a creature climbing immediately behind you.",
            "10. You recover all lost hit points whenever you climb up to a particularly beautiful vista, or succeed in overcoming a particularly difficult ascent."
        ]
    },
    {
        "name": "Adjures the Leviathan",
        "description": "Controlling monstrosities",
        "tiers": [
            "1. Adjure Creature: 2/min; bonus action; for 1 minute, you can verbally control a living monstrosity of up to CR 1 within 30', commanding it to do simple tasks on your behalf. Alternatively, you can force up to three such creatures within the same range to take no actions for as long as you hold concentration. Every round, each member of the group can attempt to escape your control by making a contested CHA save against your Concentration check.",
            "2. +2 nature.",
            "3. As an additional option with your Adjure Creature feature, you can attempt to capture a similar creature for the same duration. A captured creature becomes tame in your presence, joining you as a minion. You can only have 1 captured creature at a time.",
            "4. Enrage Creature: 1/min; bonus action; with a touch and whispered word, you can trigger a biological response in a creature you've captured with your Adjure Creature feature, causing it to fly into a bone-ripping rage while it remains captured. During this rage, treat the creature as a CR 3 and it gains +8 global damage. However, after this extreme effort, the creature either dies or becomes so enfeebled by its expenditure of energy that it becomes ineffective for 2d4 days.",
            "5. You have +1 max healing surge.",
            "6. You can use your Adjure Creature feature to have 2 captured creatures at a time, instead of just one, and you can capture creatures of up to CR 2.",
            "7. Lash of the Tamer: 1/SR; bonus action; you can demand more of the creatures that you have captured. One creature you have captured within 30' of you is granted an additional, immediate standard action which they can take out of turn.",
            "8. Become the Leviathan: once ever; bonus action; You change shape into a monstrous creature of your design two sizes larger than you for one minute. When you do so, you become proficient in any natural weapons the form may possess. You also enter the form with 30 temporary hit points, have +6 to STR, and deal +8 damage with melee attacks. Becoming the leviathan is incredibly taxing. While doing so, you have double disadvantage on DEX saving throws. After you revert to normal size, either after 1 minute or as a bonus action, you gain 1 level of exhaustion and lose hit points equal to 25% of your maximum.",
            "9. You can use your Adjure Creature feature to have up to 4 creatures at one time, instead of just 2.",
            "10. You can now use your Adjure Creature feature at-will. Additionally, you can use its ability to prevent the actions of monstrosities on up to 5 creatures at a time."
        ]
    },
    {
        "name": "Wields a Magical Wand",
        "description": "Empowering signature spells while holding a wand",
        "tiers": [
            "1. Choose a non-cantrip warlock spell that affects a single target. Whenever you hold a wand, you may use it to draw a symbol for that spell in the air as a bonus action, casting that spell as though you knew it. Doing so still expends the spell's usual resource costs. The spell uses Dexterity as its casting ability.",
            "2. +2 to any AB or save DC for your symbol spell.",
            "3. Your symbol spell's range is doubled.",
            "4. After casting your symbol spell, you may instantly fly up to 5' in any direction. Alternatively, you can instead shroud yourself in magic, granting you advantage on all magical saving throws until the start of your next turn.",
            "5. +2 to any AB or save DC for your symbol spell. Additionally, you no longer require line of sight to your target to cast it, so long as your target is known to be within the spell's range.",
            "6. DEX +2.",
            "7. Choose a second non-cantrip warlock spell that you can cast as a symbol spell.",
            "8. Your symbol spell is now upcast 1 level.",
            "9. +1 spell save DCs",
            "10. Your symbol spell's range is tripled."
        ]
    },
    {
        "name": "Inscribes Arcane Sigils",
        "description": "Drawing magic circles",
        "tiers": [
            "1. Circle of Warding: At-will; bonus action; You draw a circle of magical protection on the ground within 30' of you, roughly 5' in diameter. Magical effects do not work within this circle, which lasts for one hour.",
            "2. Circle of Control: 2/min; bonus action; You draw an arcane circle on the ground within 30' of you, 5' in diameter, potentially capturing a magical effect or creature within it. The circle holds the phenomenon for up to an hour, during which time it cannot leave or affect the outside world.",
            "3. Angelic Weapon: 1/min; bonus action; By inscribing a magical symbol upon a weapon or other handheld object, you make it able to affect creatures where pure material alone could not. Your weapon ignores physical resistances and immunities, and can also pass through forcefields and other energy barriers, for 10 minutes.",
            "4. Inscribe Spell: 1/SR; bonus action; You take a spell from your mind and inscribe it onto an object or surface. In this way it becomes easy for you to allow others to cast your spells, even if they could not usually do so. The user still needs to expend the required resources to cast the spells.",
            "5. Hang Spell: 1/LR; bonus action; You take a spell from your mind, just as you would with your Inscribe Spell feature, annd place it onn an object or surface. However, instead of being readable by other creatures, it casts against the next creature other than you to come within 5' of the inscription.",
            "6. Capture Angel: 1/week; bonus action; You inscribe a circle on the ground, 10' in diameter, which summons and then contains a powerful celestial. The celestial remains trapped there for 10 minutes, during which time you may speak with it. These celestials are capable of bestowing spells and magical items to those they deem worthy.",
            "7. Your Circle of Warding feature now creates a circle of diameter 10'.",
            "8. Your Circle of Control feature can now be used at-will.",
            "9. Your Angelic Weapon feature can now be used 2/min.",
            "10. Your Inscribe Spell feature can now be used 2/min."
        ]
    },
    {
        "name": "Dances in Shadow",
        "description": "Controlling and utilising shadows",
        "tiers": [
            "1. Shadow Weapon: At-will; bonus action; You can fashion a light, simple weapon out of the stuff of shadows. The shadow weapon will last for one hour. This feature cannot be used in direct light, and if a weapon is exposed to light it will begin to fade away, the first round dealing half damage, then disappearing completely in the second.",
            "2. When fully encompassed in shadows, other creatures have disadvantage on their perception checks to spot you.",
            "3. Gain prof/+2 in sleight of hand and performance.",
            "4. Shadow Strike: 1/min; free action; The shadows between you and your opponent become even closer, allowing you to strike them from afar. Increase your reach to 30', and increase your melee damage by 4, both until the end of the current turn.",
            "5. Shadow Rift: 1/min; bonus action; When fully encompassed in shadows, you can slip into the shadow dimension for 2 rounds. While in the shadow dimension, you are unable to attack, but are able to move in any direction. When re-emerging, you must come back through a shadow.",
            "6. Gain +2 in sleight of hand and performance.",
            "7. Shadow Trap: 1/LR; bonus action; You use your power over the shadows to immobilise an opponent. Make an attack based on your6. , WIS, or CHA against a target, reducing their speed to 0 on a success. This effect requires you to maintain concentration.",
            "8. Shadow Eyes: 2/min; bonus action; Select an area of shadows within your line of sight. You can juxtapose your vision to see as if you were standing in that location.",
            "9. Shadow Clone: 1/LR; bonus action; Your shadow steps out from behind you and stands before you. Your shadow is a CR 2 creature with 15 AC, 40 hit points, +7 AB, and 2d8 necrotic damage. It follows your orders and can complete complex tasks. The clone takes 10 radiant damage for every turn it starts in direct light. It lasts for 2 hours or until it dies.",
            "10. Blind Darkness: 1/week; You create a shroud of darkness around you, extending up to 5' away. You can choose to either make this zone stationary or have it follow your movements. While in this zone, any creature other than you is blind and deaf. This effect lasts 1 minute."
        ]
    },
    {
        "name": "Wields Words Like Weapons",
        "description": "Adding magical power to words",
        "tiers": [
            "1. You have a sense of how people think. Choose one of persuasion, deception, or insight to gain +2 in.",
            "2. Misdirect Blame: 2/min; bonus action; Using your clever words and knowledge of others, you can attempt to alter the narrative so that a creature of up to CR 2 within 30' of you becomes uncertain of its conviction in one simple area, such as their conviction that you just stole a fruit from their stand, or that they've never met you before. This effect usually lasts only for the period of time you spend speaking, and perhaps up to a minute longer, before the target realises its error. Afterward, all of your skill checks to socially interact with the target have disadvantage.",
            "3. Negotiate: 1/min; bonus action; In any gathering where two or more people are trying to establish the truth or come to a decision, you can sway the verdict with masterful rhetoric. If you are given a few rounds or more to argue your point, either the decision goes your way or, if someone else effectively argues a competing point, you have double advantage on any associated persuasion or deception check.",
            "4. Command: 1/min; bonus action; Through sheer force of will and charisma, you issue a simple command to a single living creature, which attempts to carry out your command during its next turn. The creature must be within 30' of you and be able to understand you. The command cannot inflict direct harm on the creature or its allies. Additionally, the command can require the creature to only take one turn's worth of actions.",
            "5. CHA +2.",
            "6. Interruption: 1/SR; bonus action; Your vociferous, booming command prevents a creature within 30' of you from taking any actions for 1 round. During this time, it also has double disadvantage on all saving throws. Once you have used this feature on a creature, they become immune to it.",
            "7. Gain +2 in 2 of the following skills: persuasion, deception, intimidation, investigation, any knowledge skill, or insight. Additionally, members of your party have +1 to the 2 skills you chose while they are adventuring with you.",
            "8. Break Their Mind: 1/year; bonus action; Using your clever words and knowledge of others, and given a couple of rounds of conversation to gain a few specific pieces of context regarding your target, you can utter a sentence designed to cause your target immediate psychological distress. If the target can hear you, it takes 2d10 + your level psychic damage and forgets the last 24hrs of its life.",
            "9. Through anecdotes, historical retellings, annd citing knowledge that few but you have previously understood, you enlighten your friends. After spending 24 hours with you, once per long rest, each of your friends can gain double advantage on a single d20 roll. If you leave someone's company for more than 24 hours, they must spend the 24 hours with you again to continue using this feature.",
            "10. +3 to persuasion, deception, and insight"
        ]
    },
    {
        "name": "Masters Defence",
        "description": "Mastering defence",
        "tiers": [
            "1. While wielding a shield, you can add +2 to any DEX saves you make. However, if you do so, you have disadvantage on attack rolls until the end of your next turn.",
            "2. +2 to STR saves.",
            "3. Disadvantaged stealth from body armour becomes -2 stealth instead.",
            "4. Dodge and Resist: 1/min; free action; After you make a saving throw, you can reroll it and take the better of the two results.",
            "5. Dodge and Respond: 1/min; free action; Whenever a melee attack misses you, you can immediately make 1 melee attack in return.",
            "6. +2 to WIS saves and WIS +1.",
            "7. Ignore stealth penalties from body armour.",
            "8. While affected by the Dodge action, +2 to all saving throws.",
            "9. Whenever you succeed on a DEX save, you can immediately make 1 attack against your attacker if they are in range.",
            "10. +1 AC while wearing light, medium, or heavy body armour."
        ]
    },
    {
        "name": "Absorbs Energy",
        "description": "Absorbing and utilising kinetic energy",
        "tiers": [
            "1. You absorb a portion of the energy of a physical attack or impact. You negate 2 points of damage you would have suffered and store it as energy. You can store a maximum of 2 energy at a time.",
            "2. Release Energy: At-will; bonus action; You release 2 points of energy you've absorbed, magnifying and focusing into a blast of energy that strikes a single foe within 120' of you for 2d6 + your level force damage.",
            "3. Energise Object: At-will; bonus action; You infuse energy you have absorbed into an object. The object holds the energy until it is touched by anyone but you. The energy inflicts 6 points of the object's base damage on the creature touched in addition to any damage the object itself may do. You cannot have more than one energised object on your person at a time.",
            "4. You can now absorb and store energy from damage made with arcane energy or from conduits that direct energy, if you can make direct contact. This functions in the same way as physical absorption.",
            "5. Instead of being able to absorb 2 points of damage from various sources, you can absorb 4 points. You can also store up to 4 points of energy from any source.",
            "6. When you use your Release Energy feature, it inflicts an additional 4 points of damage.",
            "7. Energise Creature: 1/week; bonus action; You extend your absorption abilities to one creature within 5' of you so that they also can absorb up to 4 points of damage from the same sources for 1 hour. That creature, however, cannot store the energy for any purpose.",
            "8. Energise Crowd: once ever; bonus action; You can use your Energise Creature feature on up to 30 creatures within 30' of you.",
            "9. You can infuse 2 points of energy you have stored into a magical piece of equipment as a free action, increasing a weapon's dmg dice size by 3 for its next attack, or a piece of armour's AC bonus by 3 until you are next attacked.",
            "10. You can now store up to 8 points of energy at a time."
        ]
    },
    {
        "name": "Maps the World",
        "description": "Mapping and routing travel",
        "tiers": [
            "1. +2 survival. If you have 1 hour and the necessary tools, you can draw a map of any area you have explored. This map grants advantage to any navigation-related skill checks in that area.",
            "2. You can always navigate back to wherever your last long rest was.",
            "3. Blaze Trails: 2/min; bonus action; For the next 4 hours of travel, you mark the landscape as you pass. The next time you come through the area you will automatically know it ad be able to pick up your old trail.",
            "4. Makeshift Map: 2/min; bonus action; You spend 10 minutes crafting a map based on rumours you hear about the area in question. This map provides advantage on any navigation-related skill checks, just as a normal map would, but should one fail one of those checks they would likely find themselves very lost.",
            "5. Gain +2 in survival. Additionally, whenever you explore a location you have never been to you gain advantage on initiative and perception rolls while there.",
            "6. Perfect recall: 1/min; bonus action; You recall the details of any place you have been in the last 24 hours to such a degree that you can make new perception checks as though you were there.",
            "7. Quickest Route: 1/SR; bonus action; For 24 hours you cut the long distance travel time in half for you and your party. If you possess a map of the area you may use this feature to lead a caravan or other large group.",
            "8. Safest Route: 1/SR; bonus action; For 24 hours you double the long distance travel time for you and your party, protecting you from ambushes and difficult terrain. If you possess a map of the area you may use this feature to lead a caravan or other large group. This feature cannot be used at the same time as your Quickest Route feature.",
            "9. Establish Connection: 1/LR; bonus action; You make friends with a local in the area, providing you with news, rumours, and a way to buy local goods. This may only be used in an inhabited area.",
            "10. Trade Route: 1/year; bonus action; You establish a permanent trade route between your home region and the locals here. This feature may only be used in an inhabited location. This feature also grants you a dwelling in the chosen location. You can easily find sources of information and merchants to trade with."
        ]
    },
    {
        "name": "Shepherds the Community",
        "description": "Gaining influence and respect in a community",
        "tiers": [
            "1. Community Knowledge: 2/min; bonus action; If you've invested yourself in a community and have spent at least a few months living there, you can learn things about it through a variety of methods. Sometimes contacts slip the information to you. Other times, you're able to draw conclusions simply by what you can see and hear. When you use this feature, you can ask the DM one question about the community and get a brief answer.",
            "2. When speaking to others in the community you foster, +2 bonus to persuasion and intimidation checks about topics that directly relate to the community.",
            "3. Gain proficiency in a weapon tier of your choice. If you already have all weapon tier proficiencies, gain +2 weapon AB.",
            "4. While you are present within the community, and actively and personally working on behalf of the community, it gains +2 to any checks its members and leadership make to improve itself, except for in combat situations.",
            "5. You inflict 6 additional points of damage when engaging in combat that directly relates to advancing the needs of a community you foster.",
            "6. You cannot shepherd a community without immense stamina. You gain +1 CON and +1 WIS.",
            "7. Your devotion to keeping your community safe against all dangers has hardened you against all vicissitudes. +2 to all saving throws.",
            "8. Gain +2 weapon AB.",
            "9. Protective Wall: 1/week; free action; When engaging in combat that directly relates to defending a community you are fostering, you can make 1 attack against up to 5 different foes within 5' of you as a single action. If you hit a creature, they are pushed 5' away.",
            "10. You can now ask up to 3 questions with your Community Knowledge feature."
        ]
    },
    {
        "name": "Resurrects Dead Gods",
        "description": "Resurrecting dead incarnations of Xiloans",
        "tiers": [
            "1. +2 to skill checks to operate magical objects and constructs.",
            "2. Resurrection: 1/min; free action; Through a combination of magical tricks and ingenuity you reconnect an immense magical intelligence, such as a dead incarnation of a Xiloan, to the ethereal plane. It takes a full hour of work to accomplish this feat ad successfully doing so may bring the wrath of living Xiloans.",
            "3. Chant of the Dead: 2/min; bonus action; Invoking the power of the Xiloans you have freed, you break past the security on any simple magical security, causing it to open. You may use this feature once per long rest for each Xiloan you have resurrected.",
            "4. Blessing of Lightness: 1/min; free action; You may fall any distance without taking damage. You may use this feature once per long rest for each Xiloan you have resurrected.",
            "5. Invocation: 1/SR; bonus action; You speak the names of your Xiloans, causing magical entities who hear them to take pause. A number of magical entities up to the number of Xiloans you have resurrected of your choice within 5' of you are stunned for 1 minute.",
            "6. Dead Conductors: 1/LR; bonus action; The Xiloans protect you for a time, wrapping you in the glowing sigils of their base magical properties. For the next 10 minutes, your AC increases by an amount equal to the number of Xiloans you have resurrected (max 5).",
            "7. Summon a Xiloan: 1/week; You call upon on of the Xiloans you have aided, forcing it to take possession of a magical object or construct within 5' of you for the next hour. The Xiloan can control the object or construct and can greatly aid you in using it, but negotiating with such beings can be difficult, even for one such as you.",
            "8. +2 to checks to operate magical objects and constructs.",
            "9. You can now use your Resurrection feature twice per minute.",
            "10. You can now use your Chant of the Dead feature at-will, with no limits based on the number of Xiloans you have resurrected."
        ]
    },
    {
        "name": "Repairs Ancient Devices",
        "description": "Repairing broken objects",
        "tiers": [
            "1. +2 to all repairing skill checks. +2 to perception and investigation for noticing raw materials for use in repairs. For you, levelling artifacts counts as a repair check, with the difficulty of gaining additional effects based on the item's level.",
            "2. Quick Fix: 1/round; free action; You make a broken object work for 6 more seconds. Alternatively, you can enhance a 1-point modifier on an artifact for 6 seconds.",
            "3. Scour for Parts: 2/min; bonus action; You scour the area within 5' of you for all useful repair parts. Along the way, you detect any magic in the area.",
            "4. Whenever you find gold, you find double the amount you would have otherwise found.",
            "5. +2 to all repairing skill checks. +2 to perception and investigation for noticing raw materials for use in repairs.",
            "6. Whenever you use a consumeable with a duration, double that duration. Additionally, double the duration of buffs you gain from artifacts.",
            "7. Multi-Step Process: 1/week; bonus action; Through careful planning you turn a nearly impossible repair task (DC 26 or higher) into 3 smaller jobs (DC 20 each).",
            "8. Perception +2.",
            "9. You can now use your Quick Fix feature twice per round.",
            "10. You can now use your Scour for Parts feature at-will. Additionally, its radius from you is now 10'."
        ]
    },
    {
        "name": "Fights with a Horde",
        "description": "Acquiring and empowering an ally",
        "tiers": [
            "1. Teamwork: 2/min; bonus action; Through example, acts of camaraderie, stories of martial prowess, or other forms of instruction, you and your allies work better together as a cohesive unit. You rally your team, granting you and all members of your party +2 global damage until the start of your next turn. A creature can only be considered a member of your team if they have spent the last 24 hours with you. It ends if you leave, but resumes if you return within 24 hours. If you leave for more than that, you must spend another 24 consecutive hours together to reactivate the benefit.",
            "2. One creature up to CR 1 associated with your past connections joins you and your allies. They count as a minion. They do not have to accompany you everywhere, but you can assign them specific tasks, such as guarding a community's perimeter for a day or accompanying you on an expedition.",
            "3. When the ally from your past is near your party, they can use the Help action on you for any DEX-based task, regardless of range.",
            "4. When the ally from your past is near your party, they can use the Help action on you for any STR-based task, regardless of range.",
            "5. You can replace the ally from your past's statistics with those of a similar creature of up to CR 3.",
            "6. Horde Tactics: 1/month; free action; For up to 1 hour, you and the ally from your past can acts as a single creature. Use your statistics, but add +6 STR, +3 DEX, and +1 AC.",
            "7. Advance Rank: once ever; free action; For the next hour, all members of your party gain +1 AC and global AB.",
            "8. Charging Horde: 1/month; bonus action; You and the ally from your past can act as a single creature to make a charge attack. When you do, you both move up to 30', during which time you can attack anything that comes within 5' of your path, with advantage on the attack rolls. Creatures who take damage take an additional 6 damage and are knocked prone.",
            "9. Your Teamwork feature can now be used at-will.",
            "10. You can replace the ally from your past's statistics with those of a similar creature of up to CR 5."
        ]
    },
    {
        "name": "Deciphers Signs and Symbols",
        "description": "Deciphering writing and symbols",
        "tiers": [
            "1. +2 to perception and investigation for noticing writing and symbols.",
            "2. Whenever you trigger a trap or other unexpected magical effect, you gain +2 to DEX saving throws to dodge or stop it.",
            "3. +2 to skill checks for deciphering the meaning of writing and symbols. You can determine the vague gist of a sentence trivially as a bonus action.",
            "4. Activator: 1/min; bonus action; You determine the purpose and means of using a magical object in your possession.",
            "5. +2 to skill checks for deciphering the meaning of writing and symbols.",
            "6. Functionality: 1/LR; bonus action; You learn the purpose of a magical object or construct, just by glancing at it.",
            "7. Linguistic Genius: 1/week; bonus action; With a bit of sample text, you learn to read a particular language. From this point forward you can always read the language.",
            "8. +2 investigation.",
            "9. +2 to DEX saving throws.",
            "10. +3 to arcana."
        ]
    },
    {
        "name": "Wields Dangrous Cyphers",
        "description": "Empowering received blessings",
        "tiers": [
            "1. Aim True: Blessings you receive affects one other ally as well.",
            "2. You handle blessings with care, allowing you to have one additional maximum healing surge.",
            "3. Blessings you find behave as though they were one tier higher.",
            "4. Whenever you gain a random blessing, you receive 2 and choose which one to keep.",
            "5. Whenever a blessing involves dice rolls, you can use the roll result of your choice.",
            "6. You gain blessings on a loot roll of 1.",
            "7. When you use your Aim True feature, the blessing affects 1 additional ally of your choice.",
            "8. When you use your Aim True feature, the blessing affects 1 additional ally of your choice.",
            "9. You can have 1 additional maximum healing surge.",
            "10. Blessings you find behave as though they were two tiers higher."
        ]
    },
    {
        "name": "Accesses Ancestral Memories",
        "description": "Drawing from the power of your ancestors",
        "tiers": [
            "1. Glimpse of the Past: At-will; bonus action; You gain a minor piece of information about an ancient ruin or other previously inhabited location you are currently within. This comes to you in the form of a confusing memory.",
            "2. Old Reflexes: 2/min; reaction; The memories of a thousand dodged mishaps and attacks flow into your mind, granting you advantage on a DEX saving throw.",
            "3. Ancestral Echo: 1/min; bonus action; You integrate a piece of an ancestor's personality into your own for 1 hour, temporarily granting you +2 to a social skill of your choice.",
            "4. Voice from the Past: 1/SR; bonus action; A whisper from an ancestor provides wisdom from the ancient past. You may make one knowledge check with a +2 bonus.",
            "5. Strength of Blood: 1/LR; bonus action; Your ancestors flow through you through the cells in your blood, granting you strength beyond your usual capacities. For 1 hour you have +4 STR.",
            "6. Ghostly Visage: 1/week; bonus action; You summon a particular ancestor to appear before you as a vision. Only you may see and hear what is essentially a hallucination. You may speak with the ancestor for up to 1 hour, granting you advantage on all skill checks related to the ancestor's life.",
            "7. The memories from your Glimpse of the Past feature are now more clear and obvious.",
            "8. You can now use your Old Reflexes feature at-will.",
            "9. Your Ancestral Echo feature now provides a +4 bonus.",
            "10. You can now use your Voice from the Past feature twice per minute."
        ]
    },
    {
        "name": "Removes Barriers",
        "description": "Removing barriers and obstacles",
        "tiers": [
            "1. Skeleton Key: 2/min; bonus action; You quickly pop open a non-magically locked door, window, or other portal, without the need for a skill check. If you have proficiency in sleight of hand, you can use this feature at-will. If you have expertise, you can use this feature as a free action.",
            "2. Sprint Past: 2/min; free action; By using this feature when you take the Dash action, you do not trigger traps during your movement.",
            "3. Explosive Bypass: 1/min; bonus action; You sacrifice a potion in your possession to create an explosive capable of opening nearly any locked door, even one reliant on magic. This explosion is powerful, but carefully placed for maximum effect. If used as a weapon, it deals force damage equal to its tier + your level to all creatures within 5' of the explosion.",
            "4. You may hold one additional healing potion, so long as the potion's level does not exceed 2.",
            "5. Master Disabler: 1/LR; bonus action; You shut down a magical object or construct by disabling its power source. You must have heavy tools and physical access to the power source in order to use this feature, but it requires no check if those conditions are met.",
            "6. Self Seal: 1/week; free action; Whenever you open a door or other portal using features from this Glyph Path, you may instantly seal it behind you, even if you opened it with an explosive.",
            "7. Gain prof/expertise/+2 to sleight of hand.",
            "8. You can now use your Sprint Past feature at-will.",
            "9. You can now use your Explosive Bypass feature twice per minute.",
            "10. You may hold two additional healing potions, so long as the potions' levels do not exceed 2"
        ]
    },
    {
        "name": "Moves Like a Cat",
        "description": "Movement and nimbleness",
        "tiers": [
            "1. DEX +2.",
            "2. +2 acro for balancing.",
            "3. +2 aths for climbing, +1 long/high jump distance",
            "4. +10 fall dmg resistance.",
            "5. DEX +2.",
            "6. +2 to all saving throws.",
            "7. Quick Strike: 1/SR; bonus action; You make a melee attack with such speed that it is hard for your foe to defend against, and it knocks them off balance. Your attack roll has double advantage, and the target, if struck, takes normal damage and has disadvantage on all d20 rolls for the next round.",
            "8. DEX +5.",
            "9. +2 to attempts to escape a grapple or restrain.",
            "10. Burst of Action: 1/week; free action; You can take two standard actions this round."
        ]
    },
    {
        "name": "Leads",
        "description": "Leading, inspiring, and commanding",
        "tiers": [
            "1. +2 to all social skills.",
            "2. Anyone can help an ally, easing whatever task they are attempting. You, however, have the benefit of clarity and wisdom. When you use the Help action on another creature, they gain double advantage.",
            "3. No one is going to allow themselves to be governed by someone not willing to lay it on the line themselves. Thus, you constantly test yourself, and this toughens you. CON +1.",
            "4. One creature up to CR 1 joins you and your allies. They count as a minion.",
            "5. Command: 1/min; bonus action; Through sheer force of will and charisma, you issue a simple command to a single living creature, which attempts to carry out your command during its next turn. The creature must be within 30' and be able to understand you. The command cannot inflict direct harm on the creature or its allies. In addition, the command can require the creature to take only one turn's worth of actions. A commanded creature can still take reactions as normal.",
            "6. You can replace the ally from this glyph path's statistics with those of a similar creature of up to CR 2.",
            "7. Captivate or Inspire: At-will; free action; You can use this feature in one of two ways. Either your words keep the attention of all NPCs that hear them for as long as you speak, or your words inspire all NPCs that hear them to gain a +1 bonus to AC and global AB for the next hour. In either case, you choose which NPCs are affected. If anyone in the crowd is attacked while you are speaking to them, you lose the crowd's attention.",
            "8. Leaders inspire confidence, and confidence comes from real ability. You gain 3 points to distribute among your ability scores as you wish.",
            "9. You can replace the ally from this glyph path's statistics with those of a similar creature of up to CR 8.",
            "10. Mind of a Leader: 1/week; bonus action; When you develop a plan that involves the ally from this glyph path, you can ask the DM one very general question about what is likely to happen if you carry out the plan, getting a simple, brief answer."
        ]
    },
    {
        "name": "Fights with Panache",
        "description": "Fighting with style and flamboyancy",
        "tiers": [
            "1. With your attacks, you add stylish moves, entertaining quips, or a certain 'something' that entertains or impresses others. One creature you choose within 30' of you who can see you gains adv on their next d20 roll if taken within 2 rounds.",
            "2. While wielding a non-heavy weapon, +2 to DEX saving throws.",
            "3. Acrobatic Attack: At-will; free action; You leap into the attack, twisting or flipping through the air. If you roll a natural 17 or 18, you can treat the attack as a critical hit if it hits. You cannot use this feature while your stealth is impeded by your body armour.",
            "4. Flamboyant Boast: At-will; free action; You boastfully describe an act that you will accomplish right before you attempt it. If an average person would find the action difficult, or impossible, and you succeed on it, creatures who witnessed it and are not your allies have disadvantage on all d20 rolls until the end of their next turn. If you fail at the task, all of your attempts to affect or attack onlookers who saw you have disadvantage for 10 minutes.",
            "5. Mobile Fighter: 1/min; free action; As part of your attack, you can leap on or over obstacles, swing from ropes, run along narrow surfaces, or otherwise move around the battlefield at your normal speed as if the tasks were trivial. You cannot use this feature while your stealth is impeded by your body armour.",
            "6. While wielding a non-heavy weapon, you can block attacks made against an ally near you. Choose one creature within 5' of you. They have advantage on DEX saving throws until you choose to end this effect or you are no longer within range of each other. You have -2 to DEX saving throws while this effect persists.",
            "7. When attempting a DEX saving throw, you can instead treat it as a CHA saving throw.",
            "8. Return to Sender: 1/min; free action; If you block a melee attack, you can immediately make an attack of opportunity against the attacker.",
            "9. Allies in combat with you have +2 on their advantaged rolls.",
            "10. While wielding a non-heavy weapon, +3 to CHA saving throws."
        ]
    }
]