[
    {
        "name": "Knows Too Much",
        "description": "Learning about Mensis and his minions",
        "tiers": [
            "1. Eldritch Connection: at will; bonus action; uncannily, you learn the name of any one person, place, or thing you can see",
            "2. You gain a random beneficial mutation",
            "3. Tenebrous Prophesy: 1/minute; bonus action; Your mind is filled with a jumble of prophetic images and sensations, granting you a dangerous peek at the predicted future. You gain double advantage on your next roll, but something negative will occur in the near future",
            "4. Soul of the Hound: 1/LR; bonus action; You allow the stored instincts of a vicious creature to enter your mind psychically through your connection to the outer worlds, granting you enhanced, barely controlled reflexes. For the next 10 minutes, you gain +2 to natural weapon AB, but you cannot end hostile combats until you kill at least one creature in them, even if no enemies remain",
            "5. You are overrun by the unnatural urges of eldritch beings, pushing you to violence and madness. Whenever you actively engage in lustful, violent, or otherwise animalistic acts for at least 10 minutes, you heal 2d6 + 2x your level hit points",
            "6. You gain a standard mutation of your choice (DM will balance from description)",
            "7. Your Eldritch Connection feature is now a free action",
            "8. Gain a random beneficial mutation",
            "9. Your Tenebrous Prophesy feature can now be used twice per minute",
            "10. Your Soul of the Hound feature can now be used once per minute"
        ]
    },
    {
        "name": "Wakes From Death",
        "description": "Waking up from death",
        "tiers": [
            "1. When you die, you instead add one point to your Immortality Pool and enter a coma for 24 hours. If your body is completely destroyed, it reforms again in the nearest safe place, but your equipment does not go with it. When you awake, you heal up to 40 + double your Immortality Pool hit points.",
            "2. +2 history",
            "3. Because you know you cannot die, you have developed strange techniques for dealing with foes. When attacked by a creature within 5', you can elect to take the hit by hurling yourself on the attacker's weapon. When doing this, you leave the creature shocked by your seemingly insane actions, stunning them until the end of their next turn. If you succeed on a STR save with DC 8 + the creature's attacks' AB, you disarm them by lodging the weapon inside your own body. They must succeed on a contested STR check against you to recover it.",
            "4. Channelling your immortality, you can spend points from your Immortality Pool to heal 2 HP per point as a free action at any time.",
            "5. When you die, you can choose to spend 5 Immortality points to instantly regenerate instead of waiting 24 hours.",
            "6. Your experience, memories, and ability to survive have granted you many perks. Your maximum HP is increased by 10 and your built-up scar tissue grants you +1 AC.",
            "7. Past Life: 1/week; bonus action; Peering into your past, you can pull forth the memory of an ability from a previous life, feeling memories flowing back into your mind. You can cast any cantrip.",
            "8. Release of Death: at will; action; You have mastered the forces that grant you eternal life and have found a way to release the energy directly. On death, you can elect to release the forces that rebuild you as a burst of energy that converts your entire Immortality Pool into 6x the amount + your level as 5. against all creatures you choose within 120'.",
            "9. When using your Release of Death feature, you can choose to release yourself from the endless cycle of rebirth. All damage dealt is doubled, but you lose your immortality and die outright. Your next character retains this character's memories and starts with proficiency in history.",
            "10. Your coma when reviving now lasts 1 hour instead of 24."
        ]
    },
    {
        "name": "Battles Automatons",
        "description": "Battling constructs",
        "tiers": [
            "1. You inflict 6 additional points of damage against constructs.",
            "2. You have studied your enemy and are trained in anticipating the actions that an automaton or machine is likely to take in a fight. You have advantage on saving throws against constructs' effects.",
            "3. +2 to skill checks to track, spot, or otherwise find constructs. Additionally, gain +2 stealth.",
            "4. Disable Mechanisms: 1/minute; bonus action; With a keen eye and quick moves, you can touch a construct within your reach to disrupt some of its functions and inflict upon it one of the following maladies: it has disdavantage on all d20 rolls for 1 min; its speed is halved until repaired; it is incapacitated (ignoring immunity) until the end of its next turn; it deals -4 global damage for 1 min",
            "5. If attacking from stealth, with surprise, or before your target has acted in the current combat, your attack automatically hits. Additionally, a similar attack inflicts 4 additional points of damage.",
            "6. When fighting a construct, you have advantage on attack rolls against them and their attack rolls have disadvantage against you.",
            "7. +2 AB against constructs.",
            "8. Drain Power: 1/LR; bonus action; you affect the main power source of a construct within your reach you touch, inflicting upon it all four conditions listed in your Disable Mechanisms feature.",
            "9. Blind Machine: 1/week; bonus action; You deactivate the sensory apparatus of a construct you either touch or hit with a ranged attack (which deals no damage if using this effect), blinding (ignoring immunity) it until it is repaired.",
            "10. Deactivate Mechanisms: 1/LR; bonus action; Make a melee attack that inflicts no damage against a construct. Instead, if the attack hits, make a sleight of hand check against the target's AC. If successful, a construct of CR 3 or lower is unconscious (ignoring immunity) for 1 min."
        ]
    },
    {
        "name": "Employs a Cutaneous Interface",
        "description": "Gain an esoteric computing system beneath your skin",
        "tiers": [
            "1. Conductivity: at will; bonus action; you connect with a magical object or construct within your reach, allowing you to access its usual abilities and interfaces by tapping glowing buttons and symbols that appear on your forearm, though actually knowing how to use these functions may still require an Arcana check. The connection lasts for 10 minutes or until you are further than 120' away from the object.",
            "2. Mana Scan: 2/minute; bonus action; you scan an area up to 120' away for any magical objects or constructs you could interface with through your Conductivity feature.",
            "3. You are able to access readouts for your own life signs through your interfaces. You have advantage on medicine checks used on yourself. The added information also grants you +2 to incoming healing while you can see your skin.",
            "4. Deep Conducting: 1/SR; bonus action; after having used your Conductivity feature with an object, you may employ this feature, granting you access to its most guarded functions, such as autodestruct, hidden information, or complex operations. This connection lasts for the same duration as your use of Conductivity.",
            "5. Reset: 1/LR; bonus action; you program your body to restart its own functions. You immediately fall unconscious for 1d6 rounds, at the end of which you reawaken, having removed all conditions, curses, and diseases afflicting you and healing 6 hit points.",
            "6. Redesign: 1/week; bonus action; you alter your internal functions for a time, granting you +1 to all ability score modifiers. This effect lasts for 1 hour.",
            "7. Your Conductivity feature no longer has a range limit.",
            "8. Your Mana Scan feature can now be used at will.",
            "9. +2 medicine.",
            "10. Your Deep Conducting feature can now be used twice per minute."
        ]
    },
    {
        "name": "Howls at the Moon",
        "description": "Becoming a lycanthrope",
        "tiers": [
            "1. On five consecutive nights each month, you change into a monstrous beast for up to one hour each night. In this new form, you gain +6 STR and +3 DEX. While in beast form, you cannot cast spells. You can use a bonus action to attempt to revert to your normal form with a CHA save of DC 6 before the one hour is over. In addition, you attack any and every living creature within 30' of you. After you revert to your normal form, you have -1 to all d20 rolls for 1 hour. If you did not kill and eat at least one small or larger creature while in beast form, this penalty increases to -2 and lasts for 24 hours.",
            "2. You can attempt to change into your beast form on any night you wish as a bonus action. You must succeed on a CHA check of DC 9 to do so. Any transformations you make using this feature are in addition to the 5 nights per month when you change involuntarily.",
            "3. Your beast form grows larger than before, increasing its size by one stage. Being so large, your beast form gains the following additional benefits: AC +1, STR +2, and your unarmed attacks deal 1d12 damage if they don't already deal more. However, your DEX saves have disadvantage. While transformed, you also gain advantage on tasks that are easier for a larger creature to perform, like climbing, intimidating, wading rivers, and so on.",
            "4. Your beast form gains the following additional bonuses: +2 STR and +3 DEX.",
            "5. It is easier to change into and out of your beast form. Transforming either way now has a DC of 6.",
            "6. Your beast form gains the following additional bonuses: +1 STR, +1 DEX, and +2 AC",
            "7. Your attacks deal +10 damage while in beast form.",
            "8. You no longer need to make a roll to change into your beast form or your normal form. You can change back and forth as a bonus action. When you return to your normal form, you no longer take a penalty to your rolls.",
            "9. Your beast form now lasts for up to 8 hours.",
            "10. Changing into your beast form is now a free action."
        ]
    },
    {
        "name": "Scales the Impossible",
        "description": "Scaling high structures",
        "tiers": [
            "1. You are immune to any fear-based effects.",
            "2. +2 athletics and acrobatics.",
            "3. Eye for a Challenge: 2/minute; bonus action; you can calculate the distance of any surface or expanse you can see and also learn the DC of the climb.",
            "4. +2 survival. Additionally, you gain +2 DEX and +1 WIS.",
            "5. You gain resistance to weather-related damage. Additionally, you have advantage on Strength saving throws against natural elements.",
            "6. Reflexive Grab: 1/minute; free action; you automatically succeed on a Dexterity check or saving throw to stop yourself or someone else from falling.",
            "7. You gain resistance to falling damage.",
            "8. +2 to athletics and acrobatics",
            "9. Great Assistance: 1/LR; free action; your check to climb something also counts as the climb roll for a creature climbing immediately behind you.",
            "10. You recover all lost hit points whenever you climb up to a particularly beautiful vista, or succeed in overcoming a particularly difficult ascent."
        ]
    },
    {
        "name": "Adjures the Leviathan",
        "description": "Controlling monstrosities",
        "tiers": [
            "1. Adjure Creature: 2/min; bonus action; for 1 minute, you can verbally control a living monstrosity of up to CR 1 within 30', commanding it to do simple tasks on your behalf. Alternatively, you can force up to three such creatures within the same range to take no actions for as long as you hold concentration. Every round, each member of the group can attempt to escape your control by making a contested CHA save against your Concentration check.",
            "2. +2 nature.",
            "3. As an additional option with your Adjure Creature feature, you can attempt to capture a similar creature for the same duration. A captured creature becomes tame in your presence, joining you as a minion. You can only have 1 captured creature at a time.",
            "4. Enrage Creature: 1/min; bonus action; with a touch and whispered word, you can trigger a biological response in a creature you've captured with your Adjure Creature feature, causing it to fly into a bone-ripping rage while it remains captured. During this rage, treat the creature as a CR 3 and it gains +8 global damage. However, after this extreme effort, the creature either dies or becomes so enfeebled by its expenditure of energy that it becomes ineffective for 2d4 days.",
            "5. You have +1 max healing surge.",
            "6. You can use your Adjure Creature feature to have 2 captured creatures at a time, instead of just one, and you can capture creatures of up to CR 2.",
            "7. Lash of the Tamer: 1/SR; bonus action; you can demand more of the creatures that you have captured. One creature you have captured within 30' of you is granted an additional, immediate standard action which they can take out of turn.",
            "8. Become the Leviathan: once ever; bonus action; You change shape into a monstrous creature of your design two sizes larger than you for one minute. When you do so, you become proficient in any natural weapons the form may possess. You also enter the form with 30 temporary hit points, have +6 to STR, and deal +8 damage with melee attacks. Becoming the leviathan is incredibly taxing. While doing so, you have double disadvantage on DEX saving throws. After you revert to normal size, either after 1 minute or as a bonus action, you gain 1 level of exhaustion and lose hit points equal to 25% of your maximum.",
            "9. You can use your Adjure Creature feature to have up to 4 creatures at one time, instead of just 2.",
            "10. You can now use your Adjure Creature feature at-will. Additionally, you can use its ability to prevent the actions of monstrosities on up to 5 creatures at a time."
        ]
    },
    {
        "name": "Wields a Magical Wand",
        "description": "Empowering signature spells while holding a wand",
        "tiers": [
            "1. Choose a non-cantrip warlock spell that affects a single target. Whenever you hold a wand, you may use it to draw a symbol for that spell in the air as a bonus action, casting that spell as though you knew it. Doing so still expends the spell's usual resource costs. The spell uses Dexterity as its casting ability.",
            "2. +2 to any AB or save DC for your symbol spell.",
            "3. Your symbol spell's range is doubled.",
            "4. After casting your symbol spell, you may instantly fly up to 5' in any direction. Alternatively, you can instead shroud yourself in magic, granting you advantage on all magical saving throws until the start of your next turn.",
            "5. +2 to any AB or save DC for your symbol spell. Additionally, you no longer require line of sight to your target to cast it, so long as your target is known to be within the spell's range.",
            "6. DEX +2.",
            "7. Choose a second non-cantrip warlock spell that you can cast as a symbol spell.",
            "8. Your symbol spell is now upcast 1 level.",
            "9. +1 spell save DCs",
            "10. Your symbol spell's range is tripled."
        ]
    },
    {
        "name": "Inscribes Arcane Sigils",
        "description": "Drawing magic circles",
        "tiers": [
            "1. Circle of Warding: At-will; bonus action; You draw a circle of magical protection on the ground within 30' of you, roughly 5' in diameter. Magical effects do not work within this circle, which lasts for one hour.",
            "2. Circle of Control: 2/min; bonus action; You draw an arcane circle on the ground within 30' of you, 5' in diameter, potentially capturing a magical effect or creature within it. The circle holds the phenomenon for up to an hour, during which time it cannot leave or affect the outside world.",
            "3. Angelic Weapon: 1/min; bonus action; By inscribing a magical symbol upon a weapon or other handheld object, you make it able to affect creatures where pure material alone could not. Your weapon ignores physical resistances and immunities, and can also pass through forcefields and other energy barriers, for 10 minutes.",
            "4. Inscribe Spell: 1/SR; bonus action; You take a spell from your mind and inscribe it onto an object or surface. In this way it becomes easy for you to allow others to cast your spells, even if they could not usually do so. The user still needs to expend the required resources to cast the spells.",
            "5. Hang Spell: 1/LR; bonus action; You take a spell from your mind, just as you would with your Inscribe Spell feature, annd place it onn an object or surface. However, instead of being readable by other creatures, it casts against the next creature other than you to come within 5' of the inscription.",
            "6. Capture Angel: 1/week; bonus action; You inscribe a circle on the ground, 10' in diameter, which summons and then contains a powerful celestial. The celestial remains trapped there for 10 minutes, during which time you may speak with it. These celestials are capable of bestowing spells and magical items to those they deem worthy.",
            "7. Your Circle of Warding feature now creates a circle of diameter 10'.",
            "8. Your Circle of Control feature can now be used at-will.",
            "9. Your Angelic Weapon feature can now be used 2/min.",
            "10. Your Inscribe Spell feature can now be used 2/min."
        ]
    },
    {
        "name": "Dances in Shadow",
        "description": "Controlling and utilising shadows",
        "tiers": [
            "1. Shadow Weapon: At-will; bonus action; You can fashion a light, simple weapon out of the stuff of shadows. The shadow weapon will last for one hour. This feature cannot be used in direct light, and if a weapon is exposed to light it will begin to fade away, the first round dealing half damage, then disappearing completely in the second.",
            "2. When fully encompassed in shadows, other creatures have disadvantage on their perception checks to spot you.",
            "3. Gain prof/+2 in sleight of hand and performance.",
            "4. Shadow Strike: 1/min; free action; The shadows between you and your opponent become even closer, allowing you to strike them from afar. Increase your reach to 30', and increase your melee damage by 4, both until the end of the current turn.",
            "5. Shadow Rift: 1/min; bonus action; When fully encompassed in shadows, you can slip into the shadow dimension for 2 rounds. While in the shadow dimension, you are unable to attack, but are able to move in any direction. When re-emerging, you must come back through a shadow.",
            "6. Gain +2 in sleight of hand and performance.",
            "7. Shadow Trap: 1/LR; bonus action; You use your power over the shadows to immobilise an opponent. Make an attack based on your6. , WIS, or CHA against a target, reducing their speed to 0 on a success. This effect requires you to maintain concentration.",
            "8. Shadow Eyes: 2/min; bonus action; Select an area of shadows within your line of sight. You can juxtapose your vision to see as if you were standing in that location.",
            "9. Shadow Clone: 1/LR; bonus action; Your shadow steps out from behind you and stands before you. Your shadow is a CR 2 creature with 15 AC, 40 hit points, +7 AB, and 2d8 necrotic damage. It follows your orders and can complete complex tasks. The clone takes 10 radiant damage for every turn it starts in direct light. It lasts for 2 hours or until it dies.",
            "10. Blind Darkness: 1/week; You create a shroud of darkness around you, extending up to 5' away. You can choose to either make this zone stationary or have it follow your movements. While in this zone, any creature other than you is blind and deaf. This effect lasts 1 minute."
        ]
    },
    {
        "name": "Wields Words Like Weapons",
        "description": "Adding magical power to words",
        "tiers": [
            "1. You have a sense of how people think. Choose one of persuasion, deception, or insight to gain +2 in.",
            "2. Misdirect Blame: 2/min; bonus action; Using your clever words and knowledge of others, you can attempt to alter the narrative so that a creature of up to CR 2 within 30' of you becomes uncertain of its conviction in one simple area, such as their conviction that you just stole a fruit from their stand, or that they've never met you before. This effect usually lasts only for the period of time you spend speaking, and perhaps up to a minute longer, before the target realises its error. Afterward, all of your skill checks to socially interact with the target have disadvantage.",
            "3. Negotiate: 1/min; bonus action; In any gathering where two or more people are trying to establish the truth or come to a decision, you can sway the verdict with masterful rhetoric. If you are given a few rounds or more to argue your point, either the decision goes your way or, if someone else effectively argues a competing point, you have double advantage on any associated persuasion or deception check.",
            "4. Command: 1/min; bonus action; Through sheer force of will and charisma, you issue a simple command to a single living creature, which attempts to carry out your command during its next turn. The creature must be within 30' of you and be able to understand you. The command cannot inflict direct harm on the creature or its allies. Additionally, the command can require the creature to only take one turn's worth of actions.",
            "5. CHA +2.",
            "6. Interruption: 1/SR; bonus action; Your vociferous, booming command prevents a creature within 30' of you from taking any actions for 1 round. During this time, it also has double disadvantage on all saving throws. Once you have used this feature on a creature, they become immune to it.",
            "7. Gain +2 in 2 of the following skills: persuasion, deception, intimidation, investigation, any knowledge skill, or insight. Additionally, members of your party have +1 to the 2 skills you chose while they are adventuring with you.",
            "8. Break Their Mind: 1/year; bonus action; Using your clever words and knowledge of others, and given a couple of rounds of conversation to gain a few specific pieces of context regarding your target, you can utter a sentence designed to cause your target immediate psychological distress. If the target can hear you, it takes 2d10 + your level psychic damage and forgets the last 24hrs of its life.",
            "9. Through anecdotes, historical retellings, annd citing knowledge that few but you have previously understood, you enlighten your friends. After spending 24 hours with you, once per long rest, each of your friends can gain double advantage on a single d20 roll. If you leave someone's company for more than 24 hours, they must spend the 24 hours with you again to continue using this feature.",
            "10. +3 to persuasion, deception, and insight"
        ]
    },
    {
        "name": "Masters Defence",
        "description": "Mastering defence",
        "tiers": [
            "1. While wielding a shield, you can add +2 to any DEX saves you make. However, if you do so, you have disadvantage on attack rolls until the end of your next turn.",
            "2. +2 to STR saves.",
            "3. Disadvantaged stealth from body armour becomes -2 stealth instead.",
            "4. Dodge and Resist: 1/min; free action; After you make a saving throw, you can reroll it and take the better of the two results.",
            "5. Dodge and Respond: 1/min; free action; Whenever a melee attack misses you, you can immediately make 1 melee attack in return.",
            "6. +2 to WIS saves and WIS +1.",
            "7. Ignore stealth penalties from body armour.",
            "8. While affected by the Dodge action, +2 to all saving throws.",
            "9. Whenever you succeed on a DEX save, you can immediately make 1 attack against your attacker if they are in range.",
            "10. +1 AC while wearing light, medium, or heavy body armour."
        ]
    },
    {
        "name": "Absorbs Energy",
        "description": "Absorbing and utilising kinetic energy",
        "tiers": [
            "1. You absorb a portion of the energy of a physical attack or impact. You negate 2 points of damage you would have suffered and store it as energy. You can store a maximum of 2 energy at a time.",
            "2. Release Energy: At-will; bonus action; You release 2 points of energy you've absorbed, magnifying and focusing into a blast of energy that strikes a single foe within 120' of you for 2d6 + your level force damage.",
            "3. Energise Object: At-will; bonus action; You infuse energy you have absorbed into an object. The object holds the energy until it is touched by anyone but you. The energy inflicts 6 points of the object's base damage on the creature touched in addition to any damage the object itself may do. You cannot have more than one energised object on your person at a time.",
            "4. You can now absorb and store energy from damage made with arcane energy or from conduits that direct energy, if you can make direct contact. This functions in the same way as physical absorption.",
            "5. Instead of being able to absorb 2 points of damage from various sources, you can absorb 4 points. You can also store up to 4 points of energy from any source.",
            "6. When you use your Release Energy feature, it inflicts an additional 4 points of damage.",
            "7. Energise Creature: 1/week; bonus action; You extend your absorption abilities to one creature within 5' of you so that they also can absorb up to 4 points of damage from the same sources for 1 hour. That creature, however, cannot store the energy for any purpose.",
            "8. Energise Crowd: once ever; bonus action; You can use your Energise Creature feature on up to 30 creatures within 30' of you.",
            "9. You can infuse 2 points of energy you have stored into a magical piece of equipment as a free action, increasing a weapon's dmg dice size by 3 for its next attack, or a piece of armour's AC bonus by 3 until you are next attacked.",
            "10. You can now store up to 8 points of energy at a time."
        ]
    },
    {
        "name": "Maps the World",
        "description": "Mapping and routing travel",
        "tiers": [
            "1. +2 survival. If you have 1 hour and the necessary tools, you can draw a map of any area you have explored. This map grants advantage to any navigation-related skill checks in that area.",
            "2. You can always navigate back to wherever your last long rest was.",
            "3. Blaze Trails: 2/min; bonus action; For the next 4 hours of travel, you mark the landscape as you pass. The next time you come through the area you will automatically know it ad be able to pick up your old trail.",
            "4. Makeshift Map: 2/min; bonus action; You spend 10 minutes crafting a map based on rumours you hear about the area in question. This map provides advantage on any navigation-related skill checks, just as a normal map would, but should one fail one of those checks they would likely find themselves very lost.",
            "5. Gain +2 in survival. Additionally, whenever you explore a location you have never been to you gain advantage on initiative and perception rolls while there.",
            "6. Perfect recall: 1/min; bonus action; You recall the details of any place you have been in the last 24 hours to such a degree that you can make new perception checks as though you were there.",
            "7. Quickest Route: 1/SR; bonus action; For 24 hours you cut the long distance travel time in half for you and your party. If you possess a map of the area you may use this feature to lead a caravan or other large group.",
            "8. Safest Route: 1/SR; bonus action; For 24 hours you double the long distance travel time for you and your party, protecting you from ambushes and difficult terrain. If you possess a map of the area you may use this feature to lead a caravan or other large group. This feature cannot be used at the same time as your Quickest Route feature.",
            "9. Establish Connection: 1/LR; bonus action; You make friends with a local in the area, providing you with news, rumours, and a way to buy local goods. This may only be used in an inhabited area.",
            "10. Trade Route: 1/year; bonus action; You establish a permanent trade route between your home region and the locals here. This feature may only be used in an inhabited location. This feature also grants you a dwelling in the chosen location. You can easily find sources of information and merchants to trade with."
        ]
    },
    {
        "name": "Shepherds the Community",
        "description": "Gaining influence and respect in a community",
        "tiers": [
            "1. Community Knowledge: 2/min; bonus action; If you've invested yourself in a community and have spent at least a few months living there, you can learn things about it through a variety of methods. Sometimes contacts slip the information to you. Other times, you're able to draw conclusions simply by what you can see and hear. When you use this feature, you can ask the DM one question about the community and get a brief answer.",
            "2. When speaking to others in the community you foster, +2 bonus to persuasion and intimidation checks about topics that directly relate to the community.",
            "3. Gain proficiency in a weapon tier of your choice. If you already have all weapon tier proficiencies, gain +2 weapon AB.",
            "4. While you are present within the community, and actively and personally working on behalf of the community, it gains +2 to any checks its members and leadership make to improve itself, except for in combat situations.",
            "5. You inflict 6 additional points of damage when engaging in combat that directly relates to advancing the needs of a community you foster.",
            "6. You cannot shepherd a community without immense stamina. You gain +1 CON and +1 WIS.",
            "7. Your devotion to keeping your community safe against all dangers has hardened you against all vicissitudes. +2 to all saving throws.",
            "8. Gain +2 weapon AB.",
            "9. Protective Wall: 1/week; free action; When engaging in combat that directly relates to defending a community you are fostering, you can make 1 attack against up to 5 different foes within 5' of you as a single action. If you hit a creature, they are pushed 5' away.",
            "10. You can now ask up to 3 questions with your Community Knowledge feature."
        ]
    },
    {
        "name": "Resurrects Dead Gods",
        "description": "Resurrecting dead incarnations of Xiloans",
        "tiers": [
            "1. +2 to skill checks to operate magical objects and constructs.",
            "2. Resurrection: 1/min; free action; Through a combination of magical tricks and ingenuity you reconnect an immense magical intelligence, such as a dead incarnation of a Xiloan, to the ethereal plane. It takes a full hour of work to accomplish this feat ad successfully doing so may bring the wrath of living Xiloans.",
            "3. Chant of the Dead: 2/min; bonus action; Invoking the power of the Xiloans you have freed, you break past the security on any simple magical security, causing it to open. You may use this feature once per long rest for each Xiloan you have resurrected.",
            "4. Blessing of Lightness: 1/min; free action; You may fall any distance without taking damage. You may use this feature once per long rest for each Xiloan you have resurrected.",
            "5. Invocation: 1/SR; bonus action; You speak the names of your Xiloans, causing magical entities who hear them to take pause. A number of magical entities up to the number of Xiloans you have resurrected of your choice within 5' of you are stunned for 1 minute.",
            "6. Dead Conductors: 1/LR; bonus action; The Xiloans protect you for a time, wrapping you in the glowing sigils of their base magical properties. For the next 10 minutes, your AC increases by an amount equal to the number of Xiloans you have resurrected (max 5).",
            "7. Summon a Xiloan: 1/week; You call upon on of the Xiloans you have aided, forcing it to take possession of a magical object or construct within 5' of you for the next hour. The Xiloan can control the object or construct and can greatly aid you in using it, but negotiating with such beings can be difficult, even for one such as you.",
            "8. +2 to checks to operate magical objects and constructs.",
            "9. You can now use your Resurrection feature twice per minute.",
            "10. You can now use your Chant of the Dead feature at-will, with no limits based on the number of Xiloans you have resurrected."
        ]
    },
    {
        "name": "Repairs Ancient Devices",
        "description": "Repairing broken objects",
        "tiers": [
            "1. +2 to all repairing skill checks. +2 to perception and investigation for noticing raw materials for use in repairs. For you, levelling artifacts counts as a repair check, with the difficulty of gaining additional effects based on the item's level.",
            "2. Quick Fix: 1/round; free action; You make a broken object work for 6 more seconds. Alternatively, you can enhance a 1-point modifier on an artifact for 6 seconds.",
            "3. Scour for Parts: 2/min; bonus action; You scour the area within 5' of you for all useful repair parts. Along the way, you detect any magic in the area.",
            "4. Whenever you find gold, you find double the amount you would have otherwise found.",
            "5. +2 to all repairing skill checks. +2 to perception and investigation for noticing raw materials for use in repairs.",
            "6. Whenever you use a consumeable with a duration, double that duration. Additionally, double the duration of buffs you gain from artifacts.",
            "7. Multi-Step Process: 1/week; bonus action; Through careful planning you turn a nearly impossible repair task (DC 26 or higher) into 3 smaller jobs (DC 20 each).",
            "8. Perception +2.",
            "9. You can now use your Quick Fix feature twice per round.",
            "10. You can now use your Scour for Parts feature at-will. Additionally, its radius from you is now 10'."
        ]
    },
    {
        "name": "Fights with a Horde",
        "description": "Acquiring and empowering an ally",
        "tiers": [
            "1. Teamwork: 2/min; bonus action; Through example, acts of camaraderie, stories of martial prowess, or other forms of instruction, you and your allies work better together as a cohesive unit. You rally your team, granting you and all members of your party +2 global damage until the start of your next turn. A creature can only be considered a member of your team if they have spent the last 24 hours with you. It ends if you leave, but resumes if you return within 24 hours. If you leave for more than that, you must spend another 24 consecutive hours together to reactivate the benefit.",
            "2. One creature up to CR 1 associated with your past connections joins you and your allies. They count as a minion. They do not have to accompany you everywhere, but you can assign them specific tasks, such as guarding a community's perimeter for a day or accompanying you on an expedition.",
            "3. When the ally from your past is near your party, they can use the Help action on you for any DEX-based task, regardless of range.",
            "4. When the ally from your past is near your party, they can use the Help action on you for any STR-based task, regardless of range.",
            "5. You can replace the ally from your past's statistics with those of a similar creature of up to CR 3.",
            "6. Horde Tactics: 1/month; free action; For up to 1 hour, you and the ally from your past can acts as a single creature. Use your statistics, but add +6 STR, +3 DEX, and +1 AC.",
            "7. Advance Rank: once ever; free action; For the next hour, all members of your party gain +1 AC and global AB.",
            "8. Charging Horde: 1/month; bonus action; You and the ally from your past can act as a single creature to make a charge attack. When you do, you both move up to 30', during which time you can attack anything that comes within 5' of your path, with advantage on the attack rolls. Creatures who take damage take an additional 6 damage and are knocked prone.",
            "9. Your Teamwork feature can now be used at-will.",
            "10. You can replace the ally from your past's statistics with those of a similar creature of up to CR 5."
        ]
    },
    {
        "name": "Deciphers Signs and Symbols",
        "description": "Deciphering writing and symbols",
        "tiers": [
            "1. +2 to perception and investigation for noticing writing and symbols.",
            "2. Whenever you trigger a trap or other unexpected magical effect, you gain +2 to DEX saving throws to dodge or stop it.",
            "3. +2 to skill checks for deciphering the meaning of writing and symbols. You can determine the vague gist of a sentence trivially as a bonus action.",
            "4. Activator: 1/min; bonus action; You determine the purpose and means of using a magical object in your possession.",
            "5. +2 to skill checks for deciphering the meaning of writing and symbols.",
            "6. Functionality: 1/LR; bonus action; You learn the purpose of a magical object or construct, just by glancing at it.",
            "7. Linguistic Genius: 1/week; bonus action; With a bit of sample text, you learn to read a particular language. From this point forward you can always read the language.",
            "8. +2 investigation.",
            "9. +2 to DEX saving throws.",
            "10. +3 to arcana."
        ]
    },
    {
        "name": "Wields Dangrous Cyphers",
        "description": "Empowering received blessings",
        "tiers": [
            "1. Aim True: Blessings you receive affects one other ally as well.",
            "2. You handle blessings with care, allowing you to have one additional maximum healing surge.",
            "3. Blessings you find behave as though they were one tier higher.",
            "4. Whenever you gain a random blessing, you receive 2 and choose which one to keep.",
            "5. Whenever a blessing involves dice rolls, you can use the roll result of your choice.",
            "6. You gain blessings on a loot roll of 1.",
            "7. When you use your Aim True feature, the blessing affects 1 additional ally of your choice.",
            "8. When you use your Aim True feature, the blessing affects 1 additional ally of your choice.",
            "9. You can have 1 additional maximum healing surge.",
            "10. Blessings you find behave as though they were two tiers higher."
        ]
    },
    {
        "name": "Accesses Ancestral Memories",
        "description": "Drawing from the power of your ancestors",
        "tiers": [
            "1. Glimpse of the Past: At-will; bonus action; You gain a minor piece of information about an ancient ruin or other previously inhabited location you are currently within. This comes to you in the form of a confusing memory.",
            "2. Old Reflexes: 2/min; reaction; The memories of a thousand dodged mishaps and attacks flow into your mind, granting you advantage on a DEX saving throw.",
            "3. Ancestral Echo: 1/min; bonus action; You integrate a piece of an ancestor's personality into your own for 1 hour, temporarily granting you +2 to a social skill of your choice.",
            "4. Voice from the Past: 1/SR; bonus action; A whisper from an ancestor provides wisdom from the ancient past. You may make one knowledge check with a +2 bonus.",
            "5. Strength of Blood: 1/LR; bonus action; Your ancestors flow through you through the cells in your blood, granting you strength beyond your usual capacities. For 1 hour you have +4 STR.",
            "6. Ghostly Visage: 1/week; bonus action; You summon a particular ancestor to appear before you as a vision. Only you may see and hear what is essentially a hallucination. You may speak with the ancestor for up to 1 hour, granting you advantage on all skill checks related to the ancestor's life.",
            "7. The memories from your Glimpse of the Past feature are now more clear and obvious.",
            "8. You can now use your Old Reflexes feature at-will.",
            "9. Your Ancestral Echo feature now provides a +4 bonus.",
            "10. You can now use your Voice from the Past feature twice per minute."
        ]
    },
    {
        "name": "Removes Barriers",
        "description": "Removing barriers and obstacles",
        "tiers": [
            "1. Skeleton Key: 2/min; bonus action; You quickly pop open a non-magically locked door, window, or other portal, without the need for a skill check. If you have proficiency in sleight of hand, you can use this feature at-will. If you have expertise, you can use this feature as a free action.",
            "2. Sprint Past: 2/min; free action; By using this feature when you take the Dash action, you do not trigger traps during your movement.",
            "3. Explosive Bypass: 1/min; bonus action; You sacrifice a potion in your possession to create an explosive capable of opening nearly any locked door, even one reliant on magic. This explosion is powerful, but carefully placed for maximum effect. If used as a weapon, it deals force damage equal to its tier + your level to all creatures within 5' of the explosion.",
            "4. You may hold one additional healing potion, so long as the potion's level does not exceed 2.",
            "5. Master Disabler: 1/LR; bonus action; You shut down a magical object or construct by disabling its power source. You must have heavy tools and physical access to the power source in order to use this feature, but it requires no check if those conditions are met.",
            "6. Self Seal: 1/week; free action; Whenever you open a door or other portal using features from this Glyph Path, you may instantly seal it behind you, even if you opened it with an explosive.",
            "7. Gain prof/expertise/+2 to sleight of hand.",
            "8. You can now use your Sprint Past feature at-will.",
            "9. You can now use your Explosive Bypass feature twice per minute.",
            "10. You may hold two additional healing potions, so long as the potions' levels do not exceed 2"
        ]
    },
    {
        "name": "Moves Like a Cat",
        "description": "Movement and nimbleness",
        "tiers": [
            "1. DEX +2.",
            "2. +2 acro for balancing.",
            "3. +2 aths for climbing, +1 long/high jump distance",
            "4. +10 fall dmg resistance.",
            "5. DEX +2.",
            "6. +2 to all saving throws.",
            "7. Quick Strike: 1/SR; bonus action; You make a melee attack with such speed that it is hard for your foe to defend against, and it knocks them off balance. Your attack roll has double advantage, and the target, if struck, takes normal damage and has disadvantage on all d20 rolls for the next round.",
            "8. DEX +5.",
            "9. +2 to attempts to escape a grapple or restrain.",
            "10. Burst of Action: 1/week; free action; You can take two standard actions this round."
        ]
    },
    {
        "name": "Leads",
        "description": "Leading, inspiring, and commanding",
        "tiers": [
            "1. +2 to all social skills.",
            "2. Anyone can help an ally, easing whatever task they are attempting. You, however, have the benefit of clarity and wisdom. When you use the Help action on another creature, they gain double advantage.",
            "3. No one is going to allow themselves to be governed by someone not willing to lay it on the line themselves. Thus, you constantly test yourself, and this toughens you. CON +1.",
            "4. One creature up to CR 1 joins you and your allies. They count as a minion.",
            "5. Command: 1/min; bonus action; Through sheer force of will and charisma, you issue a simple command to a single living creature, which attempts to carry out your command during its next turn. The creature must be within 30' and be able to understand you. The command cannot inflict direct harm on the creature or its allies. In addition, the command can require the creature to take only one turn's worth of actions. A commanded creature can still take reactions as normal.",
            "6. You can replace the ally from this glyph path's statistics with those of a similar creature of up to CR 2.",
            "7. Captivate or Inspire: At-will; free action; You can use this feature in one of two ways. Either your words keep the attention of all NPCs that hear them for as long as you speak, or your words inspire all NPCs that hear them to gain a +1 bonus to AC and global AB for the next hour. In either case, you choose which NPCs are affected. If anyone in the crowd is attacked while you are speaking to them, you lose the crowd's attention.",
            "8. Leaders inspire confidence, and confidence comes from real ability. You gain 3 points to distribute among your ability scores as you wish.",
            "9. You can replace the ally from this glyph path's statistics with those of a similar creature of up to CR 8.",
            "10. Mind of a Leader: 1/week; bonus action; When you develop a plan that involves the ally from this glyph path, you can ask the DM one very general question about what is likely to happen if you carry out the plan, getting a simple, brief answer."
        ]
    },
    {
        "name": "Fights with Panache",
        "description": "Fighting with style and flamboyancy",
        "tiers": [
            "1. With your attacks, you add stylish moves, entertaining quips, or a certain 'something' that entertains or impresses others. One creature you choose within 30' of you who can see you gains adv on their next d20 roll if taken within 2 rounds.",
            "2. While wielding a non-heavy weapon, +2 to DEX saving throws.",
            "3. Acrobatic Attack: At-will; free action; You leap into the attack, twisting or flipping through the air. If you roll a natural 17 or 18, you can treat the attack as a critical hit if it hits. You cannot use this feature while your stealth is impeded by your body armour.",
            "4. Flamboyant Boast: At-will; free action; You boastfully describe an act that you will accomplish right before you attempt it. If an average person would find the action difficult, or impossible, and you succeed on it, creatures who witnessed it and are not your allies have disadvantage on all d20 rolls until the end of their next turn. If you fail at the task, all of your attempts to affect or attack onlookers who saw you have disadvantage for 10 minutes.",
            "5. Mobile Fighter: 1/min; free action; As part of your attack, you can leap on or over obstacles, swing from ropes, run along narrow surfaces, or otherwise move around the battlefield at your normal speed as if the tasks were trivial. You cannot use this feature while your stealth is impeded by your body armour.",
            "6. While wielding a non-heavy weapon, you can block attacks made against an ally near you. Choose one creature within 5' of you. They have advantage on DEX saving throws until you choose to end this effect or you are no longer within range of each other. You have -2 to DEX saving throws while this effect persists.",
            "7. When attempting a DEX saving throw, you can instead treat it as a CHA saving throw.",
            "8. Return to Sender: 1/min; free action; If you block a melee attack, you can immediately make an attack of opportunity against the attacker.",
            "9. Allies in combat with you have +2 on their advantaged rolls.",
            "10. While wielding a non-heavy weapon, +3 to CHA saving throws."
        ]
    },
    {
        "name": "Speaks with a Silver Tongue",
        "description": "speaking manipulatively",
        "tiers": [
            "1. +2 to all social skills. You also become proficient in reading and writing two new languages of your choice.",
            "2. +2 to all social skills, animal handling, and performance.",
            "3. Verbal Misdirection: 2/min; free action; With fast talk and bewildering words, you can confuse and distract anyone that you're speaking with, giving you advantage on social interactions with that person for 10 minutes.",
            "4. Play to the Crowd: 1/min; free action; You give a speech that is both rousing and terrifying. Those within 30' of you who can hear and understand you have either advantage or disadvantage (your choice for each individual) on their next d20 roll.",
            "5. Castigate: 1/SR; bonus action; You intimidate any opponent within 120' of you who understands speech (even if it is not your language) so much that all their d20 rolls have disadvantage for 1 minute.",
            "6. Stay the Course: 1/LR; bonus action; When your companions are flagging, you can help inspire them with a well-timed word or two. Any ally within 5' of you can immediately heal as if they had just consumed a level 1 (+1 for each level tier) healing potion.",
            "7. Entrancing Speech: 1/week; bonus action; Everyone within 120' of you who can hear and understand you takes no actions for as long as you do not move and use your turns to speak soothing and calming words. If an affected creature is attacked during this time, they break out of the trance immediately.",
            "8. Command: 1/month; bonus action; A target within 30' of you obeys any command you give as long as they can hear and understand you. Furthermore, as long as you continue to do nothing but issue commands (taking no other actions), you can give that same target a new command. This effect ends when you stop issuing commands or they are out of range.",
            "9. You become proficient in reading and writing two new languages of your choice.",
            "10. +3 to animal handling."
        ]
    },
    {
        "name": "Finds the Faerie Trods",
        "description": "manipulating space through fey magic",
        "tiers": [
            "1. Blink: At-will; bonus action; By squeezing through a weak point in space you teleport 5' in any direction.",
            "2. You are able to walk the longer trods of the fey, allowing you to take shortcuts through the cracks in space when travelling. Overworld travel times are halved for you and your party and you can move as a bonus action.",
            "3. Fairy Ring: 1/min; bonus action; You find the spot within 120' of you where the coherency of 3-dimensional space is weakest. Once found, anyone who enters this space (usually a 5' cube) teleports to a location tied to this ring. You do not know where the ring leads, travel is one-way, and it only lasts for 10 minutes once found.",
            "4. Corpse Road: 1/SR; bonus action; You find a path between space tread frequently by the fairies and other spirits of the Feywild. For the next 10 minutes, so long as you are following the direction of this road, you may travel up to 120' every 6 seconds as a free action.",
            "5. Crossroads: 1/LR; bonus action; You locate a gateway into a realm of the fey, a tiny extradimensional space. The gateway only lasts for 10 minutes after you find it, taking the form of an archway, doorway, or other opening. Anyone can enter the crossroads once found. Inside is a spherical room with enough space for 5 medium creatures to sit comfortably. Those inside can leave at any time with but a though, but anything they place within will go away once no one inhabits that particular pocket reality anymore.",
            "6. Catch a Sprite: 1/week; bonus action; You find an invisible fairy and cut it off from its trods, keeping it from escaping. The fairy in this condition becomes slightly visible as a luminous humanoid shape. At this point you may ask one task of the fairy, that it will execute upon release. This task must be relatively simple and straightforward such as 'get the key from the jailer' or 'trip the man on his way down the stairs'. The fairy cannot engage in combat for you, but it can pull mischievious tricks that border on dangerous.",
            "7. Your Blink feature now teleports you up to 10'.",
            "8. You gain +10' of speed.",
            "9. Your Fairy Ring feature can now be used twice per minute.",
            "10. Your Corpse Road feature can now be used twice per minute."
        ]
    },
    {
        "name": "Learns from Adversity",
        "description": "learning from and recollecting past adventures",
        "tiers": [
            "1. Experience has honed your reaction times, because those who act first gain the advantage in most situations. You have +2 to initiative and checks to solve puzzles.",
            "2. Adversity has made you touger. CON +1. Additionally, even if you can do something well, you have learned that you can always do it better. Whenever you have advantage on a roll, it becomes double advantage.",
            "3. Life's trials have toughened you and made you hard to read. You have +2 to any check or save to resist another creature's attempt to discern your true feelings, beliefs, or plans. You likewise have the same bonus for resisting torture, telepathic intrusion, and mind control.",
            "4. Your mind is stronger for overcoming bad experience. WIS +1.",
            "5. You don't live as long as you have without learning what makes others tick. If a creature you can see has a special weakness, such as a vulnerability to loud noises, a negative Wisdom modifier, and so on, you know what it is (ask and DM will tell).",
            "6. Tall Tale: 1/min; bonus action; You tell a short anecdote to a an enemy that can understand you about something you have witnessed in your life that is so over the top, yet so convincing, that the enemy makes a DC 15 WIS saving throw or has disadv on all its d20 rolls for 1 minute.",
            "7. Seize Opportunity: 1/SR; free action; You have learned that you have to react instantly when danger threatens. If you block an attack, you can instantly take a standard action. If you use this action to attack, you have advantage on the attack roll. If you use this action, you do not have a standard action during your next turn.",
            "8. Experience has taught you a lot, including that luck is sometimes something that you have to make for yourself. When you roll a 1 on a d20 roll, you can reroll it. You must use the new result.",
            "9. Learning from adversity includes recognising when to move quickly. DEX +1.",
            "10. Lethal Ploy: 1/LR; bonus action; Long experience has revealed to you that subterfuge is your friend in dangerous situations. You push, attack, or distract the target in some seemingly inconsequential way that leads to the target's death. The target must be of CR 1 or lower."
        ]
    },
    {
        "name": "Emerged from the Obelisk",
        "description": "becoming crystalline",
        "tiers": [
            "1. You are composed of animate, translucent crystal the colour of amber. Your crystal body grants you +2 AC and +2 CON. However, you are not quick and you DEX saving throws have disadvantage. Certain conditions, like non-magical diseases and poisons, do not affect you.",
            "2. Your crystalline body repairs itself more slowly than that of living flesh. You only have half of your usual hit dice available to you for healing.",
            "3. Amber Levitation: 1/min; bonus action; You learn how to energise your crystalline form and lift away from the pull of gravity. You can levitate 5' in any direction each round for up to 1 minute.",
            "4. Inhabit Crystal: 1/SR; bonus action; You transfer your body and whatever you are carrying into a crystal at least the size of your index finger. While in the crystal, you are aware of what is going on around it, seeing and hearing through the crystal. You can even speak through the crystal and carry on conversations. You cannot take actions other than to exit the crystal as a bonus action. You remain within as long as you wish, but you are not in stasis and must exit to eat, drink, sleep, and so on as normal (breathing is not an issue). If the crystal is destroyed or takes major damage while you are within it, you immediately exit and become unconscious for 3 rounds.",
            "5. You can attempt a Strength saving throw of DC 10 to avoid being knocked down, pushed back, or moved against your will even if the affect attempting to move you does not allow it. Additionally, you gain STR +1.",
            "6. Crystal Lens: At-will; bonus action; You can focus the inherent energy surging through your crystalline body. This allows you to fire a blast of energy that deals 2d8 + your level force damage to a target within 240' of you (uses your Glyph AB).",
            "7. Resonant Frequency: At-will; bonus action; You can infuse an object that you can hold in one hand with a special vibration generated from your core. The object functions more efficiently and effectively for 1 minute. At the end of that minute, the resonant frequency ramps up exponentially until the object finally shatters from the energy buildup. Anything within 5' of the detonation takes 2d8 + your level force damage (uses your Glyph AB).",
            "8. Resonant Quake: 1/month; bonus action; You can infuse the ground beneath you with a special vibration generated from your core. This creates a small quake whose epicentre you can select within 240' of you. Everyone within 30' of the epicentre is subject to 3d10 + your level bludgeoning damage. However, you have disadvantage on all of you d20 rolls until the end of your next turn.",
            "9. Return to the Vein: 1/month; bonus action; You transfer your body and personal posessions into a crystal of any size and exit from another crystal of any size, including any mineral veins you are aware of. You must know of the crystal you are going to use as an exit before you enter the first crystal.",
            "10. You have -3 to DEX saving throws and +6 to CON."
        ]
    },
    {
        "name": "Plays Thunderous Music",
        "description": "playing magical music",
        "tiers": [
            "1. Warming Melody: At-will; bonus action; You perform as song that literally warms the air around you, with a focal point of your choice. Deal 1d6 + level fire damage to a target within 5' of you. This feature may be used to ignite small fires.",
            "2. You gain proficiency (or +2) in either playing a musical instrument of your choice, or performing songs with your voice. You may use this skill when making checks for features in this glyph path. Additionally, you gain +2 to History checks related to music.",
            "3. Chilling Chant: 2/min; bonus action; Your performance draws the heat out of the world, causing frost and ice to form all around you. You deal 2d4 + level cold damage to all creatures within 5' of you. If used near a body of water, sustained use of this feature can produce enough ice to walk on.",
            "4. Cacaphonous Signal: 1/min; bonus action; The song you play or sing sounds like atonal garbage to most, but invokes magic to charge the air around them. All creatures within 30' of you take 1d8 + level lightning damage. If used outdoors more than 3 times in an hour, this feature will summon a storm to the area.",
            "5. You gain expertise (or +4) in the instrument or vocal talent you previously chose. You also increase your bonus to History checks related to music to +4.",
            "6. Penetrating Tone: 1/LR; bonus action; You hold a single long note that invokes magic to shake the earth around you. All creatures and large objects within 120' of you take 1d8 + level bludgeoning damage. Creatures and precarious objects affected are knocked prone.",
            "7. At your discretion you may target a single creature with one of the area of effect features from this glyph path, rather than hitting the entire area.",
            "8. CHA +2.",
            "9. Your Warming Melody feature now deals 1d10 + level fire damage.",
            "10. You increase your bonus to History checks related to music to +7."
        ]
    },
    {
        "name": "Sees Beyond",
        "description": "magical sight",
        "tiers": [
            "1. You can automatically perceive creatures and objs that are normally invisible, out of phase, or only partially on this plane. When looking for things more conventionally hidden, you have advantage on the related check.",
            "2. See Through Matter: 1/min; bonus action; You can see through matter as if it were transparent. You can see through up to 6 inches of material for 6 seconds. Doing so is a perception check whose DC is based on the quality of the material.",
            "3. Find the Hidden: 1/SR; bonus action; You see the traceries of objects as they move through space and time. You can sense the distance and direction of any specific inanimate object that you have touched. This takes anywhere between 1 second and hours of unbroken Concentration, depending on what the DM feels is appropriate due to time, distance, or other mitigating circumstances. However, you do not know in advance how long it will take.",
            "4. Sensor: 1/SR; bonus action; You create an immobile, invisible sensor within 5' of you that lasts for 24 hours. At any time during that duration, you can Concentrate to see, hear, and smell through the sensor, no matter how far you move from it. The sensor does not grant you sensory capabilities beyond the norm.",
            "5. Remote Viewing: 1/week; bonus action; Distance is an illusion, as all space is one space. With great Concentration, you can see another place. This ability can be used in one of two different ways. First, pick a spot a specific direction away from you and in a specific direction. You can see from that vantage point as if you had used your Sensor feature there, but only for one minute. Secondly, think of a place that you have seen before, either conventionally or using the application of this feature. You can see from that vantage point as if you had used your Sensor feature there, but only for up to 12 seconds. Either of these applications takes anywhere from 1 second to hours of Concentration, depending on what the DM feels is appropriate due to time, distance, or other mitigating circumstances. However, you don't know in advance how long it will take.",
            "6. See Through Time: 1/month; bonus action; Time is an illusion, as all time is one time. With great Concentration, you can see into another time. You specify a time period regarding the place where you now stand. Interestingly, the easiest time to view is about 100 years in the past or future. Viewing farther back or ahead is a nearly impossible task. This takes anywhere from 1 second to hours of Concentration, depending on what the DM feels is appropriate due to time, distance, or other mitigating circumstances. However, you don't know in advance how long it will take.",
            "7. Mental Projection: 1/week; bonus action; Your mind fully leaves your body and manifests anywhere you choose within 5' of you. Your projected mind can remain apart from your body for up to 24 hours. This effect ends early if your HP is reduced to 0 or if your projection touches your resting body. Your disembodied mind is a psychic construct that looks like you, though its frayed edges trail off into nothingness. You control this body as if it were your normal body and can act and move as you normally would with a few exceptions. You can move through solid objects, and you ignore any terrain feature that would impede your movement. Your attacks inflict -6 damage (to a minimum of 1) and you take -6 damage from physical sources, unless they can affect transplanar or phased beings. Regardless of the source, you take all damage as psychic damage. Your mind can travel up to 1 mile (1.5km) from your body. Your physical body is helpless until this effect ends. You cannot use your physical senses to perceive anything (including recognising when your body is taking damage). If this effect is ended early by your body reaching 0 HP, you are stunned until the end of your next turn as you try to reorient yourself to your predicament.",
            "8. You possess such a high level of awareness that it is very difficult to surprise, hide from, or sneak up on you. You gain +6 to all initiative and perception checks.",
            "9. Gain proficiency/+2 in perception.",
            "10. You can now use your See Through Matter feature at-will."
        ]
    },
    {
        "name": "Commands Flesh",
        "description": "summoning a minion from your flesh",
        "tiers": [
            "1. Spawn: 2/min; bonus action; Your flesh bunches up and buds off a small, CR 1/2 creature that can survive independently for 10 minutes before it shrivels and dies. The creature obeys basic commands, but is not intelligent enough to perform tasks complex enough that they would require a skill check. The creature is strong enough to pick up small items, but not enough to wield weapons. Creatures not actively following a command follow their own motives, whatever those may be. The creatures have 11 AC, 10 maximum HP, +3 AB, and deal 1d4 + 1 B damage. All spawn have a speed of 30'.",
            "2. You can reabsorb your creatures from your Spawn feature, healing 1d6 HP for each one reintegrated into your flesh.",
            "3. Willful Mutation: 1/SR; bonus action; You can force your body to develop a random beneficial mutation temporarily for 10 minutes.",
            "4. You can now spawn CR 1 creatures with your Spawn feature. Optionally, you can elect to leave them as CR 1/2 creatures, but they can fly with stubby, malformed wings. The CR 1 creatures have 12 AC, 20 maximum HP, +4 AB, and deal 1d6 + 2 B damage. All flying spawn have a flying speed of 120'.",
            "5. Forceful Absorption: 1/SR; bonus action; With some effort, you can try to forcibly absorb a CR 1 or lower creature of your size of smaller, as long as it is organic and from the same plane as you, by defeating them in a contested CHA check. Absorbing a creature causes you to heal 1d6 HP.",
            "6. Whispers Within: 1/SR; bonus action; The things within your flesh listen and learn and plot. Sometimes you overhear them and sometimes you can interrogate them. Things you may have forgotten or missed, things you couldn't see behind you, secret, silent thoughts you are not sensitive enough to receive - the things inside you hear and see all. Your mind can slip inside yourself and ask a question of the riders within, which they must answer to the best of their abilities, though whether they tell you the whole truth or not is another matter.",
            "7. You can now spawn CR 2 creatures with your Spawn feature. Optionally, you can elect to leave them as CR 1 creatures, but they can fly with stubby, malformed wings. The CR 2 creatures have 13 AC, 30 maximum HP, +5 AB, and deal 1d8 + 3 B damage.",
            "8. Your increasing ability to control the creatures you set free from your body now extends their lives. Through force of will, you can reshape your own form, budding off a portion of your flesh and permanently reducing your maximum HP by 2 to make a new, permanent spawn. When the spawn dies, you regain the lost maximum HP.",
            "9. Your body has become a perfect factory for generating creatures, CON +2.",
            "10. You can use your Spawn feature at-will, and they can become CR 3 creatures. The CR 3 creatures have 14 AC, 40 maximum HP, +6 AB, and deal 1d10 + 4 B damage."
        ]
    },
    {
        "name": "Tells Improbable Tales",
        "description": "telling stories and tall tales",
        "tiers": [
            "1. You choose just the right words to make your audience believe what you're saying. You gain proficiency/+2 in deception and gain +2 to any checks made as a result of storytelling.",
            "2. You may become proficient in a new language with 10 hours of study with native speakers.",
            "3. Upstaging: 2/min; bonus action; By spinning a story you draw the attention of a creature within 30' of you, causing them to focus on you rather than others. This can serve as a distraction in or out of combat.",
            "4. Suspension of Disbelief: 1/min; bonus action; You speak to a sentient target within 30' of you, retelling their current situation to them and causing them to believe it for the next 10 minutes. For example, saying 'you are not on fire, you are safe at home' may cause a target to calmly sit down while aflame.",
            "5. You gain expertise/+2 in deception and gain a further +2 to any checks made as a result of storytelling.",
            "6. The tales you tell of your exploits quickly become folk legends. You and your companions find it much easier to acquire positions of authority, connections, wealth, and other benefits of your near-mythic reputation.",
            "7. Bard's Tongue: 1/year; bonus action; The things you say often come true. You may use this feature and make a proclamation, such as 'we will win the day' or 'you shall find the lost prince'. Unless you actively work to thwart this statement or much greater forces are at work against you, your statement will come true. You should work with the DM to find an interesting and story-worthy way for this to happen.",
            "8. Deception +2.",
            "9. Gain proficiency in reading and writing 2 new languages of your choice.",
            "10. You can now use your Upstaging feature at-will, and it can affect up to 2 creatures per activation."
        ]
    },
    {
        "name": "Controls Beasts",
        "description": "gaining a beast minion",
        "tiers": [
            "1. A beast of up to CR 1 of your size or smaller accompanies you and follows your instructions. The beast companion acts on your turn. If your beast companion dies, you can hunt in the wild for 1d6 days to find a new one.",
            "2. Soothe the Savage: 2/min; bonus action; You calm a beast within 30' of you. You must speak to it (although it does not need to understand your words), and it must see you. It remains calm for 1 minute or for as long as you Concentrate on this feature.",
            "3. Communication: 2/min; bonus action; You can convey a basic concept to a creature that normally cannot speak or understand speech. The creature can also give you a very basic answer to a simple question.",
            "4. A beast larger than you of up to CR 1 serves you as a mount and follows your instructions. While you are mounted on it, the creature can move and you can attack on your turn, which grants your attack advantage. The mount acts on your turn. If the mount dies, you can hunt in the wild for 3d6 days to find a new one.",
            "5. When you and your beast companion are within 5' of each other, you gain +4 global damage and both of you grant disadvantage to incoming attacks.",
            "6. Beast Eyes: 1/min; bonus action; You can sense through your beast companion's senses if it is within 1.5km (1 mile) of you. This effect lasts up to 10 minutes.",
            "7. Your beast companion can now be a beast of up to CR 2 of your size or smaller.",
            "8. Beast Call: 1/LR; bonus action; You summon a beast of up to CR 2 to help you temporarily. This creature does your bidding for as long as you Concentrate on this feature, but you must use a bonus action to direct them. Creatures are native to the area and arrive under their own power, so if you are in an unreachable place, this feature will not work.",
            "9. When you and your beast companion are within 5' of each other, you can share damage inflicted on either of you, with any distribution of your choice. Only the damage reduction of the target initially damaged comes into play. Additionally, your beast companion can now be a beast of up to CR 3 of your size or smaller.",
            "10. Control the Savage: 1/week; bonus action; You can control a calm beast within 30' of you. You control it for as long as you Concentrate on this feature, and cannot perform any types of actions during your turns."
        ]
    },
    {
        "name": "Follows the Stars",
        "description": "being guided by the stars",
        "tiers": [
            "1. If you can see the stars, you always know which way is north.",
            "2. Your normal vision becomes darkvision.",
            "3. Under a starry sky, you have advantage on all d20 rolls.",
            "4. Regardless of where you are, you can always see what the sky above you looks like.",
            "5. Rightly Guided: 1/min; Pick a destination, until your next long rest you will always know whether or not you are going toward it, and if a particular path will get you closer to your target.",
            "6. Protected by the Stars: 1/week; free action; you may reroll a 1 on a d20 roll.",
            "7. In the Stars: 1/SR; free action; Your knowledge of the stars' positions gives you some ability to predict the future. When taking any type of action, you may use this feature to see if the intended action will have a negative consequence for you. You will also get basic knowledge of why the action has negative consequences.",
            "8. When the Stars are Right: 1/year; free action; Your ability to understand the ways of the moving lights above helps you predict the most opportune moment to pursue a specific goal. After describing what you want to accomplish, roll 2d6. The result is how many days from today the best time to work toward your goal is. On that day, you gain advantage on all non-attack or saving throw d20 rolls.",
            "9. You can never become lost while you can see the stars.",
            "10. Your normal vision becomes truesight."
        ]
    },
    {
        "name": "Creates Chaos",
        "description": "disrupting magic chaotically",
        "tiers": [
            "1. Disturbance: At-will; bonus action; You emit a magical pulse from your body, frazzling magic in the area. Any magical effects within 30' of you go haywire in ways you cannot predict. This disturbance lasts for 10 minutes and causes all spells cast within 30' of you to have disadvantage on any checks they make, or grant advantage to any saving throws they prompt.",
            "2. Touch of Chaos: 2/min; bonus action; You touch an object or creature and disrupt the magic within and around them, dealing 1d10 + your level force damage.",
            "3. Spell Scramble: 1/min; reaction; You disrupt the magic within a specific nearby area, cancelling any one spell cast within 120' of you. This feature may only be used while the spell being targeted is being cast.",
            "4. Wild Spell: 1/SR; bonus action; You empower the surrounding magical to do as it wishes, creating a powerful, though random, effect, similar to that of Wild Magic. The nature of the effect is determined by the DM, but any damage it deals will be force damage equal to 1d12 + your level.",
            "5. You are no longer affected by Wild Magic effects, nor is anything or anyone within 5' of you.",
            "6. Chaotic Form: 1/month; bonus action; You allow the magic around and inside of you to do as it pleases, adapting and modifying you at a terrifying rate and turning you into a roiling mass of randomly changing materials. You may move your ability score points around as you see fit while in this form, which lasts for one hour. You can breathe and otherwise exist in any conditions, and your AC becomes 17 and unmodifiable. Should you need a particular tool for any task, your body may take that shape.",
            "7. Your Disturbance feature now affects all spells cast within 60' of you.",
            "8. Your Touch of Chaos feature can now be used at will.",
            "9. Your Spell Scramble feature can now be used twice per minute.",
            "10. Your Wild Spell feature can now be used twice per minute."
        ]
    },
    {
        "name": "Lives Underwater",
        "description": "boosting your underwater effectiveness",
        "tiers": [
            "1. You have evolved into surviving underwater. You gain the Aquatic mutation.",
            "2. You gain +2 to athletics for swimming and +2 to initiative.",
            "3. You develop an uncanny connection with a Giant Octopus. This particular octopus is adapted to survive both land and sea environments and will serve you faithfully in your journeys. If killed, it will take up to 2 months to find a suitable replacement that you can bond with.",
            "4. You gain +2 to Dexterity saving throws.",
            "5. You have advantage on attack rolls against creatures who have a lower initiative bonus than you.",
            "6. You suffer no penalties for undertaking any task underwater.",
            "7. You gain +2 to any skill checks pertaining to or interacting with the ocean.",
            "8. At-one with the Sea: 1/LR; bonus action; For the next 20 minutes, you gain +50' swim speed. During this time, water-based creatures will not hurt you, unless you attack first.",
            "9. You double the amount of healing you receive while you are submerged in water.",
            "10. You gain +2 dmg res while underwater."
        ]
    },
    {
        "name": "Lets it Ride",
        "description": "gambling and leaning into luck",
        "tiers": [
            "1. Snake Eyes: At-will; bonus action; The laws of probability change around you, granting you double advantage on gambling-related skill checks for the next 10 minutes.",
            "2. The spirits of the air favour you. You have critical requirement -1 for all d20 rolls.",
            "3. The DM must inform you one turn in advance when you are about to be specifically targeted in combat.",
            "4. Whenever you score a critical on any d20 roll in combat, you gain a bonus action.",
            "5. Hot Cards: 1/LR; bonus action; You infuse a held object with luck. For the next 10 minutes, all d20 rolls involving the object have critical requirement -2.",
            "6. Impossible Play: 1/month; free action; You may only use this feature while attempting an action that would normally have a DC of 30 or higher. You treat the DC as 15 for this action.",
            "7. You Snake Eyes feature now lasts 1 hour.",
            "8. You have critical requirement -1 for all d20 rolls.",
            "9. Whenever you are informed in advance of being targeted in combat, you also find out which creature will be targeting you.",
            "10. Whenever you score a critical on any d20 roll in combat, you gain 2 bonus actions."
        ]
    },
    {
        "name": "Takes the Shape of Beasts",
        "description": "shapeshifting",
        "tiers": [
            "1. Tiny Spy: At-will; bonus action; You change your form into that of a tiny beast. While in this form you gain advantage on stealth checks and +2 to Dexterity saving throws, but have double disadvantage on attack rolls. You use your own senses while in this creature form. You can only use the raw damage of the beast's attacks, and only its melee weapon attacks.",
            "2. While in creature form your senses come to match those of your new body, rather than mimicking those of your regular form.",
            "3. Bestial Form: 1/min; bonus action; You take the form of a beast of your own size or smaller and with a maximum CR equal to your level divided by 4. You can only use the raw damage of the beast's attacks, and only its melee weapon attacks.",
            "4. While in creature form you gain one of the creature's special forms of attack of your choice. You can either enable the effects of one of its melee weapon attacks beyond the raw damage or enable another of its actions that is not a melee weapon attack, which works at full potential.",
            "5. Half Shift: 1/LR; bonus action; You may partially transform into a creature so that you may use one of its passive features, senses, or actions. Unlike other changes, Half Shifts only last for 10 minutes at a time.",
            "6. Monstrous Form: 1/week; bonus action; You change shape to that of any beast you have assisted in killing before. You can only use the raw damage of the beast's attacks, and only its melee weapon attacks.",
            "7. Your Tiny Spy feature now only has single disadvantage on its attack rolls.",
            "8. While in creature form, your senses improve by one tier of sense.",
            "9. You can now use your Bestial Form feature twice per minute.",
            "10. While in creature form, you can gain two more of the creature's special forms of attack of your choice."
        ]
    },
    {
        "name": "Hunts Humanoids",
        "description": "hunting and combating humanoids",
        "tiers": [
            "1. You gain +2 to on skill checks to track, search for, interact with, and hide from humanoids.",
            "2. You deal +4 weapon damage against humanoids.",
            "3. Humanoid Sense: 2/min; free action; For one hour, through scent, specific signs, and past experience, you know when humanoids other than those you choose are within 120' of you.",
            "4. Your weapon proficiency increases by 1 tier.",
            "5. Answering Attack: 1/min; free action; If you are struck by a creature within 5' of you, you can make an immediate melee attack against that attacker. The attack has disadvantage.",
            "6. When there are 2 or more enemies within 5' of you at once, you can use them against each other. You gain advantage on your Dexterity saving throws or attack rolls (your choice each round) against them.",
            "7. You deal +6 weapon damage against humanoids.",
            "8. Your attacks and saving throws have advantage against humanoids.",
            "9. You cannot have disadvantage on attacks or saving throws against humanoids.",
            "10. Your weapon proficiency increases by 1 tier."
        ]
    },
    {
        "name": "Controls Gravity",
        "description": "manipulating gravity",
        "tiers": [
            "1. Weighty: At-will; bonus action; You briefly increase the weight of a target within 30' of you enough to stop them in their tracks, preventing the target from moving and giving them disadvantage on any d20 rolls until the end of their next turn.",
            "2. Hover: At-will; bonus action; You float slowly into the air. You can Concentrate and use further bonus actions to remain motionless in the air, or float up to 30' from the ground, but no more; otherwise, you drift with the wind or with any momentum you have gained. This effect lasts up to 10 minutes.",
            "3. By manipulating gravity's pull on yourself, you gain +2 DEX.",
            "4. Define Down: 1/SR; bonus action; The natural gravity within a 30' cube that you are within 5' of changes directions so that it flows in the direction you determine for a few seconds, then snaps back. Affected creatures are tossed up to 20' in the chosen direction and take damage as if they had fallen that amount.",
            "5. Gravity Cleave: 1/min; bonus action; You can harm a target within 30' of you by rapidly increasing gravity's pull on one portion of their body and decreasing it on another, dealing 2d8 + your level bludgeoning damage.",
            "6. Field of Gravity: 1/SR; free action; When you wish it, a field of manipulated gravity around you pulls incoming ranged projectiles to the ground. You are immune to such attacks until the start of your next turn. You must be aware of an attack to foil it. This feature does not work on magic projectiles.",
            "7. Flight: 1/SR; bonus action; You can float and fly through the air for 1 hour. You gain a flying speed of 85'.",
            "8. Improved Gravity Cleave: 1/decade; bonus action; You can harm a group of targets within 120' of you by rapidly increasing gravity's pull on one portion of each of their bodies and decreasing it on another, dealing 2d8 + your level bludgeoning damage. The targets must be within 5' of each other.",
            "9. Weight of the World: 1/week; You can increase a target's weight dramatically. The target is pulled to the ground and cannot move physically under its own power for 1 minute. The target must be within 30' of you.",
            "10. Your Weighty feature now has a maximum range of 90'."
        ]
    },
    {
        "name": "Turns the Tables",
        "description": "turning dangerous situations into advantageous ones",
        "tiers": [
            "1. Defensive Maneuvre: At-will; bonus action; You strike at an enemy with a melee weapon attack, and then move away from them up to 30'.",
            "2. You enjoy double advantage on initiative rolls.",
            "3. Adapt: 1/min; free action; After suffering damage from an elemental source (fire, cold, lightning, or acid), you may use this feature to enjoy +2 AC vs that damage type for the next hour.",
            "4. Once you have taken 20 or more damage in a battle, you become ferocious for the rest of the fight. While in this mode, you gain advantage on melee attack rolls when the attack is made against a creature who has done damage to you in this battle.",
            "5. Whenever you make an attack using a limited feature, you enjoy +1 to any values derived from your ability score(s).",
            "6. Observe Technique: 1/week; free action; After suffering damage from a particular action, spell, or feature by a humanoid, you may activate this feature, allowing you to employ the same power for the rest of the current combat.",
            "7. Your Defensive Maneuvre now allows you to move up to 60'.",
            "8. +2 to initiative.",
            "9. Your Adapt feature can now be used twice per minute.",
            "10. You now become ferocious after taking 5 or more damage in a combat."
        ]
    },
    {
        "name": "Forever Changes",
        "description": "mutating and de-mutating rapidly",
        "tiers": [
            "1. At the end of each long rest, gain a beneficial mutation. You keep it until your next long rest.",
            "2. Toolkit: 2/min; bonus action; With Concentration, you can shape your fingers, toes, or other appendages into simple tools with no moving parts such as lockpicks, hooks, or knives. These can be used as weapons to deal 1d6 + your level damage, and grant advantage on relevant checks for 10 minutes, whereafter your appendages revert to normal.",
            "3. Oddly Familiar: 1/min; free action; You can trigger a change in your physiology, changing your sex and appearance to match someone you have touched in the last 24 hours.",
            "4. You have advantage on the beneficial mutation you gain at the end of each long rest.",
            "5. Reactive Adaption: 1/min; free action; Your changes start forming reactively to your situation. When attacked, you can roll a d20: 1-5, attacked body part develops a bony coating, granting +3 AC against the current attack and the next one; 6-10, attacked body part phases out of existence for the duration of the attack; 11-15, attacked body part warps to grab the attacking weapon or projectile, disarming melee weapons but still taking damage, or negating damage from projectiles; 16-20, a bony spur juts out, inflicted 1d6 + your level damage on the attacker by flinging the weapon or projectile back at them.",
            "6. Human Weapon: 1/SR; bonus action; You can change your body into a deadly weapon, growing spikes, blades, armour, or claws. Whilst transformed, you gain +3 AC and deal +4 damage with natural weapons until the start of your next turn. However, you look terrifying in this form and all pleasant social checks have double disadvantage.",
            "7. When using your Oddly Familiar feature, you can now choose to adopt any appearance of your choice instead of those only recently touched.",
            "8. You can now choose to gain a random powerful mutation instead of a beneficial one at the end of your long rests. You do not gain advantage for powerful mutations.",
            "9. You have advantage on powerful mutations you can gain at the end of each long rest.",
            "10. Your forever changing body reacts and adapts to whatever circumstances attempt to disrupt it. You can breathe underwater and are immune to the negative effects of being in high gravity. You are immune to environmental hazards other than extreme heat/cold and vacuums, and you can choose to not gain any mutations you would usually gain."
        ]
    },
    {
        "name": "Brandishes an Exotic Shield",
        "description": "conjuring and utilising a force shield",
        "tiers": [
            "1. You manifest a small plane of pure force, which takes on a shield-like shape with the barest flicker of a thought. You can dismiss it just as easily. To use the force shield, you must hold it in one of your hands. You are proficient in the use of this shield, as well as as a melee weapon (dealing 1d4 + your level force damage). While unconscious or sleeping, the force field dissipates. You can enchant this shield as if it were a regular shield.",
            "2. Force Bash: At-will; free action; You can use this feature whenever you deal damage with an attack from your shield. The attack deals -2 damage, but grants your target disadvantage on all d20 rolls until the end of their next turn.",
            "3. Your force shield produces an envelope of force that enfolds you while you are holding it, granting you +1 AC.",
            "4. Healing Pulse: 1/min; You and all creatures you choose within 5' of you can expend a hit die to gain its healing benefits. Creatures you have already used all of their hit dice gain no benefit from this feature. Creatures who do not have hit dice regain a number of hit points equal to their CR.",
            "5. You can throw your force shield up to 30' as a weapon, dealing the same damage.",
            "6. Your force shield now pulses with dangerous energy whenever you manifest it. Each time you use your shield as a melee or thrown weapon, if inflict +6 damage.",
            "7. Force Wall: 1/LR; bonus action; You can trigger the energy in your force shield to expand outward in all directions to create an immobile plane of solid force up in a 10' radius from the shield for up to 1 hour or until you choose. You cannot use the shield while this effect is occurring. The plane of force wall conforms to the space available. While the force wall remains in place, the only other feature from this glyph path is Healing Pulse.",
            "8. If you throw your force shield as a weapon at a target within 30' of you, whether it hits or misses, it will attack up to 2 additional targets within 30'.",
            "9. When you make a melee or thrown attack and hit with the force shield, it releases an explosion of energy, inflicting 4 additional damage on the target and all creatures within 5' of the target. If you use this feature with a melee attack, you and creatures behind you are not affected by this explosion.",
            "10. The damage of your force shield is increased to 1d8 + your level."
        ]
    },
    {
        "name": "Channels the Wisdom of the Philosophers",
        "description": "fostering a mental connection with a lord from your background",
        "tiers": [
            "1. Rather than the usual benefits of the Help action, you enjoy double advantage on the check if the helper is proficient in the check.",
            "2. You gain a connection to a lord of your home city (or the nearest equivalent) who watches over you and attempts to make sure you do well in the world.",
            "3. Helping Hand: 2/min; bonus action; You sublimate your reflexes, trusting to the instincts of your lord back home. For the next 10 minutes you deal +2 damage with any weapon with which you are proficient. At the end of this time, you deal -2 damage on all attacks for 1 hour.",
            "4. Psychic Shield: 1/min; bonus action; You call upon your lord to shield you from psychic attacks, granting you +2 to Wisdom saving throws for the next hour.",
            "5. Extended Sublimation: 1/SR; bonus action; The DM takes over your character for 3 rounds, during which time your lord acts as they will through your body. Generally, your lord cannot attack through you, but can speak and have proficiency in all social interaction tasks and a +5 modifier in Charisma.",
            "6. You gain proficiency in meditation. If you succeed in entering a meditative state during a short rest, you recover 12 additional hit points.",
            "7. One Mind: 1/week; bonus action; You completely merge minds with your lord. While in this strange mental state all of your ability scores have a +2 bonus. Lasts for 1 hour.",
            "8. +2 to checks with which you are receiving the Help action.",
            "9. Your lord gains sway and status in another city of your choice.",
            "10. You can now use your Helping Hand feature at-will, and the damage penalty it grants is reduced to -1."
        ]
    }
]