{
    "powerful": [
        {
            "name": "Darksight",
            "description": "120' darkvision."
        },
        {
            "name": "No breath",
            "description": "You don't need to breathe"
        },
        {
            "name": "No water",
            "description": "you don't need to eat, drink, or sleep to survive."
        },
        {
            "name": "Chameleon skin",
            "description": "Your skin changes colours as you wish. Stealth adv."
        },
        {
            "name": "Savage bite",
            "description": "Your mouth widens surprisingly, and hidden, pointed teeth emerge when you wish it. Bite natural weapon as bonus, 1d8 + level P."
        },
        {
            "name": "Gluey globs",
            "description": "You can produce gluey globs at your fingertips. Adv on checks related to climbing and keeping grip. 30' range fling natural weapon, no damage but target's physical tasks have disadv until end of your next turn."
        },
        {
            "name": "Face dancing",
            "description": "You can alter your features enough to give you adv on disguise checks."
        },
        {
            "name": "Sense magic",
            "description": "You can sense the presence of an active magical object or effect within 30'. You don't learn details or the precise location."
        },
        {
            "name": "Stinger in finger",
            "description": "Stinger natural weapon as bonus, 1d4 P and make second atk for 1d10 + lvl psn"
        },
        {
            "name": "Stinger in elbow",
            "description": "Stinger natural weapon as bonus, 1d6 P and make second atk for 1d10 + lvl psn"
        },
        {
            "name": "Spit needles",
            "description": "30' range spit natural weapon as bonus, 1d4 P and make second atk for 1d10 + lvl psn"
        },
        {
            "name": "Spit acid",
            "description": "30' range spit natural weapon as bonus, 1d6 + lvl acid"
        },
        {
            "name": "Spit webs",
            "description": "You can make up to 10' of a strong, ropelike material between long rests at the rate of 1'/min. Webbing has 9 AC and 30 HP. Also 30' range spit natural weapon, no dmg but target's physical tasks have disadv until end of your next turn."
        },
        {
            "name": "Filtered lungs",
            "description": "Adv on CON saves vs vapours or noxious gases. Can survive in hostile breathing environment (eg. underwater, vacuum) up to 10 mins"
        },
        {
            "name": "Disruptive field",
            "description": "2/min; bonus action; Disrupt magical objects and constructs within 5' (auto-success). All targets cease to function while in range of your field. End as free action"
        },
        {
            "name": "Disruptive field",
            "description": "2/min; bonus action; Disrupt flesh within 5' (CON save). All creatures within range take 1d4 + level nec"
        },
        {
            "name": "Disruptive field",
            "description": "At-will; bonus action; Disrupt thoughts within 5'. Spellcasting attacks for all creatures in range have disadvantage, and saves against spells originating from within the field have adv."
        },
        {
            "name": "Magnetic flesh",
            "description": "You attract or repel metal when you desire. Not only do small metal objects cling to you, but adv for climbing metal or keeping grip on metal. Also adv on DEX saves vs metallic effects."
        },
        {
            "name": "Gravity negation",
            "description": "2/min; bonus action; Float slowly into air. If concentrating, can control movement at half normal speed; otherwise, drift with wind or any momentum gained. Effect lasts up to 10 mins."
        },
        {
            "name": "Telepathy",
            "description": "2/min; bonus action; Can speak telepathically with others within 30'. Communication is 2-way, but other party must be willing and able to comm. Don't have to see target, but must know it's within range. Can have more than 1 active contact at once, but must establish contact with each target individually. Each contact lasts up to 10 mins."
        },
        {
            "name": "Pyrokinesis",
            "description": "At-will; bonus action; Can cause flammable obj you can see within 5' to spontaneously catch fire. Fire natural weapon, 1d6 + lvl fire."
        },
        {
            "name": "Telekinesis",
            "description": "2/min; bonus action; Can exert force on objs within 30'. Once activated, power has STR 11, and can use it to move objs, push against objs, and so on. Power lacks fine control to wield weapon or move objs with much speed, so in most situations, not means of atk. Cannot use on own body. Power lasts for 1 hour."
        },
        {
            "name": "Phaseshifting",
            "description": "2/min; bonus action; Can pass slowly thru solid barriers at 1 inch per round (min 1 round to pass through barrier). Cannot act (other than moving) or perceive until pass entirely through barrier. Cannot pass thru magical barriers."
        },
        {
            "name": "Power object",
            "description": "1/LR; bonus action; You can charge a wondrous item to give it 1 additional charge."
        },
        {
            "name": "Drain power",
            "description": "At-will; bonus action; Can drain power from artifacts and relics, allowing you to heal 1 HP per round for number of rounds equal to level of item. Must concentrate on this each round."
        },
        {
            "name": "Regeneration",
            "description": "Whenever you roll for initiative, recover 2 hit points."
        },
        {
            "name": "Feed off pain",
            "description": "1/round, when creature within 5' suffers 6+ dmg in 1 hit, you can recover 1 HP."
        }
    ],
    "beneficial": [
        {
            "name": "Strengthened bones",
            "description": "+2 STR"
        },
        {
            "name": "Improved circulation",
            "description": "+2 CON"
        },
        {
            "name": "Improved musculature",
            "description": "+2 STR"
        },
        {
            "name": "Improved nervous system",
            "description": "+2 DEX"
        },
        {
            "name": "Improved neural processes",
            "description": "+2 INT"
        },
        {
            "name": "Thick hide",
            "description": "+1 AC"
        },
        {
            "name": "Increased lung capacity",
            "description": "Can hold breath for 5 minutes."
        },
        {
            "name": "Adhesion pads",
            "description": "Hands and feet nave naturally adhesive pads. Adv on checks to climb, keep footing, and retain grip."
        },
        {
            "name": "Slippery skin",
            "description": "Secrete slippery oil. Adv on escaping grapples, restrains, and bonds. Can squeeze 1 size smaller."
        },
        {
            "name": "Telekinetic shield",
            "description": "Reflexively use telekinesis to ward away effects, giving adv on DEX saves."
        },
        {
            "name": "Suggestive voice",
            "description": "Voice is so perfectly modulated that grants adv on all social skills."
        },
        {
            "name": "Processor dreams",
            "description": "When you sleep, process info so that after you wake, you have adv on any knowledge checks held over from previous day. Eg. if needing to make nature check to determine if plant is poisonous, can sleep on it and make determination next with adv"
        },
        {
            "name": "Poison immunity",
            "description": "Immune to all poisons"
        },
        {
            "name": "Disease immunity",
            "description": "Immune to all diseases"
        },
        {
            "name": "Fire resistance",
            "description": "+6 fire resistance."
        },
        {
            "name": "Cold resistance",
            "description": "+8 cold res"
        },
        {
            "name": "Psychic resistance",
            "description": "+6 psy res"
        },
        {
            "name": "Acid resistance",
            "description": "+10 acid res"
        },
        {
            "name": "Puncture resistance",
            "description": "+4 P res"
        },
        {
            "name": "Slicing resistance",
            "description": "+4 S res"
        },
        {
            "name": "Bludgeoning resistance",
            "description": "+4 B res"
        },
        {
            "name": "No scent",
            "description": "You cannot be tracked or located by scent, and you never have offensive odours."
        },
        {
            "name": "Scent",
            "description": "You can sense creatures, objs, and terrain by scent as well as a normal human can by sight. You can detect scents with that degree of accuracy only in 30', but you can sense strong odours from 120' away. Like a hound, you can track creatures by their scent."
        },
        {
            "name": "Sense material",
            "description": "You can sense presence of any single substance within 30', although you don't learn details or precise location. You and DM work together to determine the substance when you mutate (eg. water, iron, steel, granite, wood, flesh, salt)."
        }
    ],
    "distinctive": [
        {
            "name": "Extra mouth",
            "description": "On [hand OR face OR stomach]. Mouth is filled with razor-sharp teeth. Bite natural weapon, 1d8 + lvl P. You can also speak with 2 voices at once."
        },
        {
            "name": "Snakelike arm",
            "description": "One of your arms ends in a fanged mouth. Bite natural weapon, 1d8 P and make another atk for 1d10 + lvl psn. Cannot use this arm for anything other than biting."
        },
        {
            "name": "Tendrils on forehead",
            "description": "[4-6] tendrils, each [30-60]cm long, come out of your forehead. They can grasp and carry anything that your hand could, although a large object would block your vision."
        },
        {
            "name": "Tendrils instead of fingers",
            "description": "Your fingers tendrils 30cm long. Adv on checks for climbing, grappling, and keeping grip. Further, you can effectively pick up and hold 2 objs in each hand rather than 1. You cannot wield more than 1 weapon per hand."
        },
        {
            "name": "Tendrils instead of arms",
            "description": "[1-2] arms are tendrils 2m long. Although you lose the fine manipulative ability of fingers and a thumb, you can still grasp objs, have +5' reach, and gain adv on grappling checks."
        },
        {
            "name": "Tendrils instead of eyes",
            "description": "You are blind, but each eye socket has a retractable tendril that is 3m long. These tendrils can feel around repidly to give you a physical sense of everything within 5'. Further, they can be used to manipulate very light objs."
        },
        {
            "name": "Tendrils instead of [legs OR feet]",
            "description": "[1-2] [legs OR feet] are tendrils that are 2m long. You can still walk and move normally, and you have adv on grappling checks. The tendrils are prehensile enough to grasp large objs."
        },
        {
            "name": "Scaly body",
            "description": "+2 AC."
        },
        {
            "name": "Covered in spiny [needles OR spikes]",
            "description": "Any creature hiting you with its body automatically takes 2 thorns dmg."
        },
        {
            "name": "Quills",
            "description": "You have quills that you can launch from your body. 30' range natural weapon, 1d10 + lvl P. This attack loses its penalty for atking within 5' of a creature if the only one is its target."
        },
        {
            "name": "Carapace",
            "description": "+2 AC."
        },
        {
            "name": "Chlorophyll",
            "description": "You gain nutrients from the sun and do not need to eat or breathe if you have daily exposure to sunlight. Your skin is green."
        },
        {
            "name": "Extra joint in arms",
            "description": "Your arms are long and jointed so that you have 2 elbows in each. You have +5' reach and can strike foes from unexpected angles. This grants adv on melee atk rolls. However, you can only attack with finesse weapons and must use Dexterity for them."
        },
        {
            "name": "Extra joint in legs",
            "description": "Your legs are long and jointed so that you have 2 knees in each. Your speed is increased by 90', and you gain adv on all climbing and balancing checks. Your jump distance is increased by 5'."
        },
        {
            "name": "Spider legs from torso",
            "description": "In addition to your normal limbs, [6 OR 8] spiderlike legs, each 2m long, extend from your sides. Your speed is increased by 5' and they grant adv on balance and climbing checks, and checks/saves against being forcibly moved."
        },
        {
            "name": "Extra arms",
            "description": "You have [1-2] extra arms. They can hold objs, wield weapons, hold a shield, and so on. This does not increase the number of attacks you can attempt."
        },
        {
            "name": "Extra legs",
            "description": "You have 2 extra legs. +5' speed. Adv on balance and saves/checks against being forcibly moved."
        },
        {
            "name": "Spider legs",
            "description": "Instead of normal legs, you have a wide torso with [6 OR 8] spiderlike legs. +5' sp, adv on balance and climbing checks, adv on checks/saves vs being forcibly moved"
        },
        {
            "name": "Snake tail",
            "description": "You have a prehensile tail that is 2m long. Adv on all grapple checks. The tail can grasp large objs."
        },
        {
            "name": "Snake tail instead of legs",
            "description": "Instead of legs, you have a snaky tail that is 2.5m long (you are large). You move at the same sp and have adv on grapple checks. The tail is prehensile enough to grasp large objs."
        },
        {
            "name": "Stinging tendril",
            "description": "You have a prehensile [tendril OR tail] that grows from some part of your body and ends in a poisonous stinger. Stinger natural weapon, 1d6 P and make another atk for 1d10 + lvl psn. It can't be used for anything but atking."
        },
        {
            "name": "Eyes on stalks",
            "description": "Your eyes are on stalks and can move in any direction, independently of each other. You can peek around corners without exposing yourself to danger. Adv on initiative and percep."
        },
        {
            "name": "Hand eyes",
            "description": "Extra eyes on [hands OR fingers]. You can peek around corners without exposing yourself to danger. Adv on init and percep."
        },
        {
            "name": "Aquatic",
            "description": "Your body is streamlined and finned, your fingers and toes webbed. You gain double adv for swimming, and you can see perfectly underwater (as if above water). Although you have lungs, you also have gills, so you can breathe underwater."
        },
        {
            "name": "Wings",
            "description": "You have [feathered OR fleshy] wings on your back that allow you to glide, carried by the wind. They are not powerful enough to enable you to fly."
        }
    ],
    "harmful": [
        {
            "name": "Deformed leg",
            "description": "-5' sp."
        },
        {
            "name": "Deformed [face OR appearance]",
            "description": "Disadv on persuasion, deception, and performance."
        },
        {
            "name": "Deformed [arm OR hand]",
            "description": "Disadv on all tasks involving the part."
        },
        {
            "name": "Malformed brain",
            "description": "All knowledge skills have disadv."
        },
        {
            "name": "Mentally vulnerable",
            "description": "All WIS saves have disadv."
        },
        {
            "name": "Slow and lumbering",
            "description": "Disadv on all DEX saves."
        },
        {
            "name": "Sickly",
            "description": "Disadv on all CON saves."
        },
        {
            "name": "Horrible growth",
            "description": "A [large goiter OR immobile tendril OR useless extra eye] hangs from your face, granting disadv on all persuasion, deception, and performance checks. Double disadv with creatures of same race as you"
        },
        {
            "name": "Useless limb",
            "description": "1 of your limbs is [unusable OR missing]."
        },
        {
            "name": "Useless eye",
            "description": "1 of your eyes is [unusable OR missing]. Tasks involving eyesight have disadv."
        },
        {
            "name": "Useless ear",
            "description": "1 of your ears is [unusable OR missing]. Tasks involving hearing have disadv."
        }
    ]
}