[
    {
        "name": "Grotesque",
        "description": "You are distressingly deformed. -2 CHA, then gain another mutation."
    },
    {
        "name": "Corrupted Organs",
        "description": "Your guts writhe. Whenever you are reduced to 0 hit points, all creatures within 30' must make a WIS save or be frightened of you until save."
    },
    {
        "name": "Bat Wings",
        "description": "Huge and flappy. You gain a fly speed equal to your walking speed."
    },
    {
        "name": "Burst of Speed",
        "description": "1/LR, as a glyphic action, you can double your speed for 10mins."
    },
    {
        "name": "Barrel Chest",
        "description": "+2 CON, max CON, and you gain max HP equal to your prof bonus."
    },
    {
        "name": "Lamarckian Evolution",
        "description": "One of your hands turns into a random tool, granting you an expertise die in ability checks with a random STR-, DEX-, or WIS-based skill."
    },
    {
        "name": "Hooved",
        "description": "Your feet become hooves."
    },
    {
        "name": "Unstable",
        "description": "Whenever you are reduced to 0 hit points, parasitic limbs erupt from your body and make the Grapple maneuver on your behalf on all adj creatures. This grapple cannot be removed unless you choose to do so."
    },
    {
        "name": "Crab Arm",
        "description": "One of your hands becomes a claw, which is a natural weapon dealing 1d8 B, but its attack rolls have a -1d4 penalty. You can attack with it as a glyphic action."
    },
    {
        "name": "Hook Fingers",
        "description": "On both hands, they are bony. This is a natural weapon dealing 1d6 S dmg. You can attack with it as a glyphic action. You cannot wield non-unarmed weapons."
    },
    {
        "name": "Patterned Skin",
        "description": "Your skin is stripy in a colour of your choice."
    },
    {
        "name": "Inside Out",
        "description": "You are, horribly, inside out. Your Charisma is always 1 and your maximum hit points are halved."
    },
    {
        "name": "Hole",
        "description": "You have a mysterious hole right through your forehead."
    },
    {
        "name": "Poison Spot",
        "description": "The spot is bright blue and the size of a coin, and migrates around your body. Whenever a creature touches you, they must make a Constitution saving throw or take poison dmg equal to your level multiplied by your proficiency bonus."
    },
    {
        "name": "1000 Noses",
        "description": "They cover your body. You gain 30' of blindsight, which uses your sense of smell."
    },
    {
        "name": "Extra Mouths",
        "description": "Gain 2d6 extra mouths on your head and neck."
    },
    {
        "name": "Neck Frill",
        "description": "Can inflate as a glyphic action to force all beasts that can see you to make a WIS save or be frightened of you until save."
    },
    {
        "name": "Foul Stench",
        "description": "You smell of burnt meat and hair. You subtract 1d4 from your Stealth checks."
    },
    {
        "name": "Magnetic Sense",
        "description": "Can detect magnetic north unless within 30' of a strong magnetic field or anything made of iron."
    },
    {
        "name": "Hinged Head",
        "description": "Your head opens like a box, with an enormous, toothy mouth that stretches ear to ear."
    },
    {
        "name": "Leathery Hide",
        "description": "Your base AC while unarmoured is equal to 12 + your DEX mod."
    },
    {
        "name": "Lightning Speed",
        "description": "You become incredibly nimble. Your speed is increased by 10'."
    },
    {
        "name": "Venomous",
        "description": "Your unarmed hits deal +1d4 psn dmg."
    },
    {
        "name": "Spike Teeth",
        "description": "Your teeth are long and serrated."
    },
    {
        "name": "The Vapours",
        "description": "You emit clouds of stinking yellow vapour from your ears. Subtract 1d4 from your Stealth checks."
    },
    {
        "name": "Milk",
        "description": "1/LR, you can reduce a single creature's fatigue by 1 level by being milked and having them drink it. If you go 3+ days without being milked, you have vulnerability to all dmg until you are milked. You cannot milk yourself."
    },
    {
        "name": "Monkey Tail",
        "description": "You can hold items (but not wield weapons) with your tail, and gain an expertise die in athletics checks made to climb."
    },
    {
        "name": "Bizarre Colour",
        "description": "Your skin flickers between two colours (red, orange, yellow, green, blue, purple)."
    },
    {
        "name": "Leather Skin",
        "description": "Your skin is lumpy and warty. You cannot wear armour, but your base AC while unarmoured is equal to 12 + your DEX mod."
    },
    {
        "name": "Insane Risks",
        "description": "You are immune to the frightened condition, but you have no sense of danger."
    },
    {
        "name": "Pheromones",
        "description": "Beasts struggle to move towards you (as per the frightened condition) while within 20' of you."
    },
    {
        "name": "Atrophy",
        "description": "A random one of your limbs becomes withered and useless. If you lose a leg, your speed is halved. If you lose an arm, you cannot hold anything in that arm."
    },
    {
        "name": "Inverted",
        "description": "Your legs and arms are swapped. Subtract 1d4 from all sleight of hand checks."
    },
    {
        "name": "Hulking Arms",
        "description": "They grow huge as your legs shrink, but you can walk on them to avoid any penalty to your movement. +2 STR and max STR."
    },
    {
        "name": "Sensitive Skin",
        "description": "You get an unpleasant, itchy rash whenever you touch silver."
    },
    {
        "name": "Bird Wings",
        "description": "They are vestigial."
    },
    {
        "name": "Stabbing Limb",
        "description": "One of your arms becomes a sharp point of bone, which becomes a natural weapon with the same stats as a dagger (except for the Thrown trait)."
    },
    {
        "name": "Mute",
        "description": "Your tongue disappears and you cannot speak."
    },
    {
        "name": "Spores",
        "description": "Whenever you are reduced to 0 hit points, you coat a 30' radius around you in purple, hallucinogenic spores. All creatures in that radius must make a CON save or become confused until save."
    },
    {
        "name": "Unusual Genitals",
        "description": "Your genitals are bizarre."
    },
    {
        "name": "Single Bird Wind",
        "description": "Grows from a random limb, it is useless."
    },
    {
        "name": "Feeble Jaw",
        "description": "You have an enormous overbite."
    },
    {
        "name": "Third Eye",
        "description": "On your forehead."
    },
    {
        "name": "Dog Face",
        "description": "Your face is replaced with a hound's."
    },
    {
        "name": "Perfect Memory",
        "description": "You gain an expertise die in history checks to recall things you have sensed."
    },
    {
        "name": "Bad Posture",
        "description": "Your head is swapped with a random one of your legs. You need to hop to move with the remaining leg. -20' sp."
    },
    {
        "name": "Skin Flaps",
        "description": "Like fleshy flying fox wings. They provide no benefit."
    },
    {
        "name": "Long Nose",
        "description": "Your nose is protruding and sharp."
    },
    {
        "name": "Strange Walk",
        "description": "Your joints are used in an odd order. -5' sp."
    },
    {
        "name": "Crown of Tentacles",
        "description": "2d10 tiny tentacles grow in a ring around your head."
    },
    {
        "name": "Spider Neck",
        "description": "Whenever you are reduced to 0 hit points, your head is revealed to be a giant spider living on top of your body, and you can control it as a CR 1/8 beast minion. You cannot be brought above 0 hit points unless the spider is in your body's space."
    },
    {
        "name": "Mental Backsliding",
        "description": "-2 INT. You cannot read or write."
    },
    {
        "name": "Hair Migration",
        "description": "All of your head hair migrates to a random side of your head in a huge tuft."
    },
    {
        "name": "Cyclops",
        "description": "Your eyes migrate to the centre of your forehead and fuse into one."
    },
    {
        "name": "The Fits",
        "description": "Your mind isn't quite right. Whenever you enter for the first time on your turn or start your turn in bright light, you must make a DC 15 INT save or be dazed until your next turn."
    },
    {
        "name": "Boiling Obesity",
        "description": "Fat descreases your speed by 10'."
    },
    {
        "name": "Finger Mouths",
        "description": "Each of your fingers ends in a tiny lamprey mouth. You can eat with them."
    },
    {
        "name": "Rearrangeable",
        "description": "You can slide your limbs around to new positions. It takes 1hr per limb."
    },
    {
        "name": "Fly Cluster",
        "description": "A pocket of writhing fly legs appears on a random one of your arms."
    },
    {
        "name": "Toe Growth",
        "description": "Your big toes grow as large as the rest of your foot. You cannot wear boots."
    },
    {
        "name": "Alluring Face",
        "description": "All your facial blemishes migrate to a spot on your back. +2 CHA and max CHA."
    },
    {
        "name": "Strange Voice",
        "description": "Something has gone awry with your vocal cords. Your voice sounds like a distressed cat mewling."
    },
    {
        "name": "Fractal Fingers",
        "description": "On a random one of your hands, you have 2d1000 fingers. You cannot drop objects held in that hand unintentionally."
    },
    {
        "name": "Horrible Bloating",
        "description": "Something is wrong with your guts. At the end of each rest, you must make a DC 15 Constitution saving throw or lose 1 hit point."
    },
    {
        "name": "Foul Stench",
        "description": "You smell like rotting fish and boiled hooves. You have -4 to stealth checks."
    },
    {
        "name": "Bilious Vomit",
        "description": "As a glyphic action, you can vomit acid in a 10' cone. All creatures in the cone automatically take 1d4 glyphic acid dmg. This cannot be used again until you take a rest, and that rest has no effect."
    },
    {
        "name": "Illusion of Normality",
        "description": "At the end of each long rest, you make a DC 15 CON save. On a success, you suppress the effects of all your mutations until your next long rest."
    },
    {
        "name": "Concealed Mutation",
        "description": "Your other mutations fade, appearing only when you have 3+ levels of Strife or are bloodied. This includes their effects."
    },
    {
        "name": "Bloated Tongue",
        "description": "Doesn't fit in your mouth, making speaking difficult. You have -2 to Persuasion and Deception checks."
    },
    {
        "name": "Revival",
        "description": "A missing body part, organ, or limb regenerates fully."
    },
    {
        "name": "Spider Gland",
        "description": "You can excrete 10' of rope at the end of each LR."
    },
    {
        "name": "1000 Eyes",
        "description": "They cover your body. -3 CHA and you cannot be surprised."
    },
    {
        "name": "Second Face",
        "description": "On your stomach. It can see and smell, but not hear or speak. While you are unarmoured, this grants you +2 to Perception checks for sight and smell."
    },
    {
        "name": "Metal Skin",
        "description": "Your skin is covered in metal plates. You cannot swim or wear armour. Your base AC is 18, with no DEX added."
    },
    {
        "name": "Migratory Fingers",
        "description": "Rearranged on hands, pointing in all directions. You cannot hold weapons."
    },
    {
        "name": "Neck Pouch",
        "description": "Can be inflated to become big and red."
    },
    {
        "name": "Puny",
        "description": "You shrivel like a raisin, shrinking 1 size category. -3 to all ability scores."
    },
    {
        "name": "Cheerful",
        "description": "Nothing can go wrong and everything will turn out for the best. This affects your attitude, and grants you a +2 bonus to saves against fear."
    },
    {
        "name": "Frog Tongue",
        "description": "Can be used as a natural weapon with the same stats as the Whip weapon. You can attack with it as a glyphic action."
    },
    {
        "name": "Face Bubble",
        "description": "Your eyes are protected by a clear dome across your face. You gain a +2 bonus to saves against blindness."
    },
    {
        "name": "Glow Pockets",
        "description": "Can glow as brightly as a candle at-will. This sheds 5' of bright light and a further 5' of dim."
    },
    {
        "name": "Goat Horns",
        "description": "Small and pointy."
    },
    {
        "name": "Climber's Eye",
        "description": "You gain a +4 bonus to survival checks to find climbing routes. You have the constant desire to be high up."
    },
    {
        "name": "Elastic Face",
        "description": "Your facial features slide around in wild animation as you talk."
    },
    {
        "name": "Spell Tumour",
        "description": "Gain a spell in a lump on your head. You gain a spell-triggering chaotic modifier."
    },
    {
        "name": "Chameleon Eyes",
        "description": "They bulge, and you can look in 2 directions at once, granting you a +2 bonus to Perception checks."
    },
    {
        "name": "Pelican Mouth",
        "description": "+2 to STR checks to carry creatures and objects that are smaller than you."
    },
    {
        "name": "Detachable Tail",
        "description": "Newt-like. It falls off whenever you become bloodied."
    },
    {
        "name": "Suckers",
        "description": "Your fingers end in suction cups. +2 to STR checks to lift objects."
    },
    {
        "name": "Extra Cranial Lobes",
        "description": "+3 INT."
    },
    {
        "name": "Thick Skull",
        "description": "-3 INT, +3 CON. You are immune to debilitation."
    },
    {
        "name": "Oily",
        "description": "All of your bodily fluids can be used as smelly oil. You can produce 1 flask per LR normally."
    },
    {
        "name": "Tentacle Fingers",
        "description": "Wiggly."
    },
    {
        "name": "Strange Voice",
        "description": "Something has gone awry with your vocal cords. Your voice sounds like Donald Duck's."
    },
    {
        "name": "Spores",
        "description": "Whenever you are reduced to 0 hit points, you coat a 30' radius in thick yellow spores, which reveals invisible creatures and objects unless an action is spent removing the spores."
    },
    {
        "name": "Turtle Shell",
        "description": "Base AC is 16 with no DEX added. You cannot wear armour or regular clothes. -3 DEX."
    },
    {
        "name": "Swap",
        "description": "A random mutation you already have is replaced by another roll on this table. Reroll if you have no existing mutations."
    },
    {
        "name": "Unstable",
        "description": "Any body part chopped off combusts in 3 rounds."
    },
    {
        "name": "Breasts",
        "description": "6 in 2 rows of 3."
    },
    {
        "name": "Patterned Skin",
        "description": "Darker/lighter checkers"
    },
    {
        "name": "Pig Tail",
        "description": "Curly."
    },
    {
        "name": "Coloured Pupils",
        "description": "Your pupils are (random of red, orange, yellow, green, blue, purple)"
    },
    {
        "name": "Compound Eyes",
        "description": "Many little eyeballs, like a fly's eye."
    },
    {
        "name": "Detachable Leg",
        "description": "Falls off whenever you become bloodied. Can be reattached as an action. While missing a leg you have half speed."
    },
    {
        "name": "Telescoping Neck",
        "description": "Can grow or shrink as needed, up to 1 foot either way."
    },
    {
        "name": "Baby Bird Heads",
        "description": "A ring of them around your neck. They cheep silently."
    },
    {
        "name": "Strange Voice",
        "description": "Something has gone awry with your vocal cords. Your voice sounds like water spiralling down a drain."
    },
    {
        "name": "Suggestible",
        "description": "Whenever you are told to do something, you must pass a DC 15 WIS save or be compelled to do it."
    },
    {
        "name": "Worm",
        "description": "Your legs fuse into one. You have a -1d4 penalty on athletics checks to climb and animal handling checks to stay atop a mount."
    },
    {
        "name": "Confident",
        "description": "You are absolutely convinced your mutations make you sexually appealing, but this has no bearing on your physical qualities."
    },
    {
        "name": "Evil Eye",
        "description": "One of your eyes becomes black and weeps tar-like tears. You have a -1d4 penalty to Perception checks that rely on sight."
    },
    {
        "name": "1000 Ears",
        "description": "They cover your body. While not deafened, you gain 30' of blindsight."
    },
    {
        "name": "Trouble with Names",
        "description": "You cannot remember anyone's name, unless you spend 1 minute concentrating on them."
    },
    {
        "name": "Mimic",
        "description": "You can mimic all voices, music, and natural sounds."
    },
    {
        "name": "Wattles",
        "description": "Like a turkey's neck."
    },
    {
        "name": "Slime Trail",
        "description": "You sweat a horrible, stinking ooze. You receive a -1d4 penalty on Stealth checks."
    },
    {
        "name": "Mysterious Dot",
        "description": "You project a red dot from one eye, like a laser pointer. 100' range."
    },
    {
        "name": "Headless",
        "description": "Your head shrinks into your chest. All of your head's features migrate to your chest. While armoured, you gain a -1d4 penalty to Perception and Charisma checks."
    },
    {
        "name": "Compulsive Dancing",
        "description": "Whenever you hear music, you must pass a DC 15 WIS save or compulsively dance until the music ends."
    },
    {
        "name": "Earthworm Blood",
        "description": "Your blood is now earthworms."
    },
    {
        "name": "Stabbing Limb",
        "description": "One arm becomes a long serrated spike of bone. This counts as any sword weapon of your choice, and can be enchanted. You cannot hold items in that hand any more."
    },
    {
        "name": "Donkey Ears",
        "description": "Tufted with fur."
    },
    {
        "name": "Sensitive Eyes",
        "description": "You cannot bear direct sunlight, granting you a -1d4 penalty on attack rolls and Perception checks while in sunlight."
    },
    {
        "name": "Scorpion Tail",
        "description": "As a glyphic action, you can attack with the tail to deal 1d4 psn dmg."
    },
    {
        "name": "Mantis Arm",
        "description": "One arm gains several extra joints. Can extend to 10' long, granting +10' reach, and folds up to normal size."
    },
    {
        "name": "Insect Hatred",
        "description": "All insects instinctively fear or hate you. You do not count shelters found through the Seek Shelter journey activity as Havens."
    },
    {
        "name": "Mind Split",
        "description": "You start hearing voices. The voices are all you, or part of you. They consistently offer terrible advice."
    },
    {
        "name": "Bad Posture",
        "description": "Your head is swapped with one of your arms."
    },
    {
        "name": "Two Necks",
        "description": "Attached to one head. You can sing in harmony with yourself, granting you an expertise die in Performance checks when performing on your own."
    },
    {
        "name": "Lamarckian Evolution",
        "description": "One of your hands turns into a flesh version of the last tool you used. It can no longer hold equipment, but you gain an expertise die on all uses of that tool."
    },
    {
        "name": "Asymmetry",
        "description": "Everything you have 2 of you now have 1 of. Roll for each to see if it's on the left or right side. You have a -1d4 penalty on all checks, your speed is halved, and you can only hold 1 item at a time."
    },
    {
        "name": "Iron Keratin",
        "description": "You have fingernails, toenails, and teeth of iron. You can chew through anything up to the toughness of leather. You gain a +1 bonus to the attack and damage rolls of natural weapons involving your nails or teeth."
    },
    {
        "name": "1000 Sores",
        "description": "They cover your body. -3 CHA and CON."
    },
    {
        "name": "Comb",
        "description": "Like a rooster's head crest."
    },
    {
        "name": "Trouble With Nouns",
        "description": "You can't remember the words for 'things', unless you spend 1 minute concentrating on them."
    },
    {
        "name": "Serrated Teeth",
        "description": "All your teeth become fearsomely sharp. You can use them as a glyphic action that deals 1d6 P dmg."
    },
    {
        "name": "Resilient",
        "description": "+1 phys dmg res."
    },
    {
        "name": "Booming Hoot",
        "description": "1/LR, you can hoot incredibly loudly which can be heard within 2km."
    },
    {
        "name": "Iron Skin",
        "description": "Your skin flakes are made up of rusty layers of iron. You cannot wear armour, but your natural AC is equal to 16 (no DEX)."
    },
    {
        "name": "Bristly Beard",
        "description": "Black, long, and coarse."
    },
    {
        "name": "Pin Face",
        "description": "Your head shrinks to a narrow point. Your eyes are on either side like tennis balls. You have -3 to all ability scores."
    },
    {
        "name": "Long Spine",
        "description": "Your legs shrink to keep your overall height the same. Your speed is halved."
    },
    {
        "name": "Temperature Sensitive Hair",
        "description": "Your hair varies from purple (when you are cold) to red (when you are hot)."
    },
    {
        "name": "Retractable Head",
        "description": "Can shrink into torse, leaving only hair exposed. Doing so blinds and deafens you, but reduces the natural d20 rolls of incoming atks by 1."
    },
    {
        "name": "Pheromones",
        "description": "Insects find you very attractive and want to lick you."
    },
    {
        "name": "Goat Legs",
        "description": "2 of your legs become goat legs. You are not slowed by rocky or earthy difficult terrain."
    },
    {
        "name": "Unsettling Laughter",
        "description": "Your laugh requires small children and non-player party members to make a DC 15 WIS save or want to leave."
    },
    {
        "name": "Bizarre Colour",
        "description": "Your skin becomes a new colour (red, orange, yellow, green, blue, purple)."
    },
    {
        "name": "Musk Gland",
        "description": "For marking territory. It smells intriguing."
    },
    {
        "name": "Stinging Skin",
        "description": "Anyone you touch or who touches you must make a DC 15 CON save or be debilitated for 1rnd."
    }
]