{
    "Thaddeus": [
        "Partner: whenever Thaddeus receives a substantial hit, you can react to heal him for 1d6 HP",
        "Partner: whenever you overheal Thaddeus, he gains the excess amount in temp HP",
        "Identity: the first time you go down each combat, you gain +5 outgoing healing and +30' fly sp for the remainder of combat, and the next time you recover HP, all foes within 60' of you take 1d6 radiant damage, which scales with your outgoing healing",
        "Identity: whenever you actively heal another creature while a boss is within 60' of you, the boss takes radiant spell dmg equal to the amount of you healed. This scales with your outgoing healing first, and then your spell modifiers afterwards."
    ],
    "Zacharias": [
        "Partner: whenever you help Thaddeus with an ability check, he adds a d8 expertise die to the result",
        "Partner: whenever you are healed by Thaddeus, your next Spectral Influence roll gains a bonus equal to half the amount you were healed for. This does not stack",
        "Identity: as a free action once on each of you turns, you can make a history check against the standard DC of a creature you can see. On a success, it gains vulnerability to your choice of 2 random dmg types. It can only have one of these effects at a time.",
        "Identity: while an ally within 60' of you is down, all foes within 60' of you are rattled and all allies in the same area gain a d6 expertise die on stabilising checks."
    ],
    "Siggusmondo": [
        "Partner: on substantial hit vs a creature adj to Vehemir, Vehemir can react to make an unarmed attack against the creature",
        "Partner: whenever you or Vehemir score a killing blow, the other gains a dmg bonus to their next hit equal to the highest of the overkill dmg or half the killing blow's total damage. This can persist across combats",
        "Identity: on your first whip hit of each round, your target makes a WIS save against your maneuver DC. on a fail, they are frightened of you for 1d4 rounds. On a sub fail, they are dominated by you for 1d4 rounds.",
        "Identity: whenever you are hit by a creature, that creature takes 1d6 P dmg, which scales as if it were your weapon damage"
    ],
    "Vehemir": [
        "Partner: whenever Siggusmondo is hit by a creature, you gain an expertise die on your next attack roll against that creature. If this brings the attack roll to 30+, the attack becomes a crit. This does not stack",
        "Partner: while adj to Siggusmondo, your first unarmed wep hit of each turn deals 1d6 additional piercing damage, which can only be scaled as if it were Siggusmondo's weapon damage",
        "Identity: affixes related to spells on your items no longer affect your spells, and instead affect your unarmed weapons. Global dmg affects your unarmed weapons at double potency.",
        "Identity: whenever you are hit, make a concentration save. if you aren't wild shaped, on a failed save you immediately wild shape at no cost. If you are, on a failed save you gain +3 unarmed dmg for the remainder of combat"
    ]
}