{
    "uncommon": [
        {
            "name": "Ring of the Adder",
            "effects": [
                "As a bonus action, you can say 'Coluber' to animate the ring's crest into a poisonous snake's head (counts as a minion) for 1 minute, or until you speak the command word again to revert it and recover all the minion's HP.",
                "As an atk from the Attack action, you can have the minion make a melee weapon atk with an AB equal to your prof bonus. On a hit, it deals 1d6 P and the target must pass a CON save DC 15 or take 3d6 psn.",
                "While animated, the minion can be attacked. It has 15 AC and 20 HP. If killed, the ring shatters and is destroyed."
            ]
        },
        {
            "name": "Ring of Striding and Springing",
            "effects": [
                "You have a minimum of 30' speed.",
                "Your jump distance is tripled, though this does not increase your maximum travel distance."
            ]
        },
        {
            "name": "Ring of the Python",
            "effects": [
                "As an action, you can say 'Pythonidae' and throw the ring onto the ground within 10' of you. It becomes a Giant Constrictor Snake ( https://5e.tools/bestiary.html#giant%20constrictor%20snake_mm ) minion, until bonus action + speaking the command word again when it reverts to a ring in the minion's space and recovers all the minion's HP.",
                "You must be conscious to command the minion.",
                "If the minion is killed, it reverts to ring form, which is then shattered and destroyed."
            ]
        },
        {
            "name": "Ring of Warmth",
            "effects": [
                "You have 50% resistance to cold damage.",
                "You and everything you wear and carry are unharmed by extreme cold climates."
            ]
        },
        {
            "name": "Ring of Vengeance",
            "effects": [
                "+1 global damage.",
                "[CURSE] While attuned, you become unwilling to part with the ring, keeping it on your person at all times. You have disadvantage on attack rolls while not wearing the ring.",
                "[CURSE] While worn, whenever you are damaged by a creature, pass a DC 15 WIS save or you must attempt to use your movement and actions each turn to make a melee weapon attack against the creature that damaged you until either you or it drops to 0 hit points, or until you cannot reach the creature to make the attack in a turn.",
                "[CURSE] Curse can be broken with Banishment spell in addition to usual methods, forcing the vengeful spirit to leave."
            ]
        },
        {
            "name": "Ring of the Winterlands",
            "effects": [
                "You have 50% resistance to cold damage.",
                "You ignore difficult terrain from ice/snow.",
                "You are unharmed by extreme cold climates.",
                "You ignore the penalties of cold weather on your journey activities."
            ]
        },
        {
            "name": "Ring of the Sewers",
            "effects": [
                "While attuned, all rats are indifferent toward you and will not attack you unless you threaten or harm them.",
                "The ring has 3 charges, 1d3 of which are restored whenever you finish a long rest.",
                "As an action, can rub the ring and expend a charge to cause a Swarm of Rats (https://5e.tools/bestiary.html#swarm%20of%20rats_mm) to fall out from your other hand. The swarm is not a minion.",
                "Whenever a Swarm of Rats that isn't under another creature's control is within 30' of you, you can make a CHA check contested by the swarm's WIS check. If you succeed, the swarm becomes your minion for as long as you maintain this effect as an action each turn. If either you lose control of the swarm or it succeeds the contested check, it is immune to these effects for 24hrs."
            ]
        },
        {
            "name": "Ring of Fish Command",
            "effects": [
                "The ring has 3 charges, 1d3 of which are restored whenever you finish a long rest.",
                "By expending 1 charge as an action, you can cast Dominate Beast (DC 15) on any creature that has an innate swim speed."
            ]
        },
        {
            "name": "Signet of P'all",
            "effects": [
                "The ring has 3 charges, 1d3 of which are restored whenever you finish a long rest.",
                "By expending 1 charge as an action, you can cast Charm Person (DC 13).",
                "Aside from its magical properties, the ring is an indicator of P'all's recognition and favour."
            ]
        },
        {
            "name": "Signet of Gawdian",
            "effects": [
                "The ring has 3 charges, 1d3 of which are restored whenever you finish a long rest.",
                "By expending 1 charge as an action, you can cast Heroism.",
                "Aside from its magical properties, the ring is an indicator of Gawdian's recognition and favour."
            ]
        },
        {
            "name": "Ring of Jumping",
            "effects": [
                "You can cast Jump as a bonus action at-will, but can only target yourself when you do so."
            ]
        },
        {
            "name": "Band of Wound Closure",
            "effects": [
                "You stabilise whenever you start your turn dying.",
                "Double the amount of healing you recieve while conscious."
            ]
        },
        {
            "name": "Finder's Ring",
            "effects": [
                "Whenever you make an Insight check, you can roll a d4 and add the number rolled to the check.",
                "As an action once per long rest, you can look through the ring to examine an object to identify the aura of the last creature that touched it. Make an Insight check against a DC of 13 + the number of days since the last contact occurred. On a success, you learn the creature's type and can immediately use the ring to cast Locate Creature to find that creature."
            ]
        },
        {
            "name": "Band of Thoughts",
            "effects": [
                "The band has 3 charges, 1d3 of which are restored at the end of a long rest.",
                "As an action, you can expend 1 charge to cast Detect Thoughts (DC 13)."
            ]
        },
        {
            "name": "Band of Web",
            "effects": [
                "The band has 7 charges, 1d6 + 1 of which are recovered at the end of a long rest.",
                "As an action, you can expend 1 charge to cast Web (DC 15).",
                "If you expend the band's last charge, roll a d20. On a 1, the band crumbles into ash and is destroyed."
            ]
        },
        {
            "name": "Occultant Band",
            "effects": [
                "Over a period of 1min 1/SR, you can study a creature killed by someone in your party within the last 24hrs, then grant the creature who slew it a d10. Once within the next hr, that creature can add the d10 to a d20 roll.",
                "While touching the band 1/LR while adj to a creature killed within the past 24hrs, you can cast the Augury spell. The course of action you inquire about with the spell does not need to have any connection to the dead creature."
            ]
        },
        {
            "name": "Earworm",
            "effects": [
                "You gain prof in Deep Speech.",
                "The ring has 4 charges, 1d4 of which are recovered at the end of a long rest.",
                "You can cast the following spells by expending charges (DC 15): Detect Thoughts (2 charges) or Dissonant Whispers (1 charge). Whenever you cast Detect Thoughts in this way, the information gleaned is also sent to the nearest aberration on your plane.",
                "[CURSE] You cannot unattune from the ring, as it burrows one end of its loop into your flesh."
            ]
        },
        {
            "name": "Ring of Padstowe",
            "effects": [
                "As an action, you can touch the ring to cast one of the following spells with your own spellcasting stats: Fly, Invisibility, Levitate, Protection from Evil and Good, Entangle, Faerie Fire, Shillelagh, and Speak with Animals. Each spell can only be cast 1/LR in this way.",
                "Whenever you cast a spell with either a somatic or material component that can inflict the charmed condition on a failed save, you can impose disadv on the save."
            ]
        },
        {
            "name": "Wolf's Bite",
            "effects": [
                "You have +1 to ability checks and saves.",
                "[CURSE] You have werewolf lycanthropy."
            ]
        },
        {
            "name": "Ring of Proof against Detection and Location",
            "effects": [
                "You cannot be targeted by Divination magic or perceived through magical scrying sensors."
            ]
        },
        {
            "name": "Ring of Archery",
            "effects": [
                "+2 bow weapon AB.",
                "+2 bow weapon dmg."
            ]
        },
        {
            "name": "+1 Ring of the War Mage",
            "effects": [
                "+1 spell AB."
            ]
        },
        {
            "name": "Slumbering Dragon-Touched Focus",
            "effects": [
                "You have adv on init."
            ]
        },
        {
            "name": "Ring of Mind Shielding",
            "effects": [
                "You are immune to magic that reads your thoughts, determines whether you are lying, or learns your creature type.",
                "Creatures can only telepathically communicate with you if you allow it.",
                "As an action, you can make the ring invisible until you either use another action to make it visible, take it off, or die.",
                "If you die while wearing the ring, your soul enters it unless it already houses a soul. You can remain in the ring or depart for the afterlife. While you are inside the ring, you can telepathically communicate with any creature wearing it, which the wearer cannot prevent."
            ]
        },
        {
            "name": "Loop of Object Reading",
            "effects": [
                "While looking through the ring, you have adv on Arcana checks made to reveal information about a creature or obj you can see.",
                "1/LR, you can cast the Identify spell while looking through the ring."
            ]
        },
        {
            "name": "Ring of Intellect",
            "effects": [
                "Your INT is 19."
            ]
        }
    ],
    "rare": [
        {
            "name": "Sunforger",
            "effects": [
                "As an action, you can throw the ring up to 120' to a point you can see. When it reaches that point, it erupts in an explosion. Each creature within 20' of the point must make a DC 15 DEX save, taking 6d6 fire dmg on a failed save, or half as much otherwise. Afterwards, you can use an action to cause the ring to reappear on your finger. You cannot cause it to explode again until you finish a short or long rest. This counts as a throwing attack.",
                "If you have not recalled the ring back to you 24hrs after throwing it, it reforms at the point where it exploded and you lose your attunement to it."
            ]
        },
        {
            "name": "Ring of X-ray Vision",
            "effects": [
                "As an action, you can say 'Transparere'. For 1 minute afterwards, if you look through the ring, you can see into and through solid matter. This vision extends for 30'. To you, solid objs within that range appear transparent and do not prevent light from passing through them. The vision penetrates 1 foot of stone, 1 inch of common metal, or up to 3 feet of wood or dirt. Anything thicker blocks the vision, as does any amount of lead."
            ]
        },
        {
            "name": "Ring of Force Resistance",
            "effects": [
                "You have 50% resistance force damage."
            ]
        },
        {
            "name": "Molten Bronze Ring",
            "effects": [
                "You have 50% resistance to fire damage."
            ]
        },
        {
            "name": "Devotee's Ring",
            "effects": [
                "Whenever you hit with a weapon attack, the attack deals 1d8 additional radiant damage.",
                "As a bonus action once per long rest, you can say 'Devotio'. For 1 minute afterwards, the ring emanates a thin cloud of incense out to 10'. At the start of each of your turns, you and any other creatures in the incense each regain 1d4 hit points."
            ]
        },
        {
            "name": "Mind Loop",
            "effects": [
                "Whenever you hit with a weapon attack, the attack deals 2d4 additional psychic damage.",
                "Any creature that takes psychic damage from your weapon attacks must succeed on a DC 15 WIS save or had disadvantage on INT, WIS, and CHA saves for 1 minute, or until it passes a passive save."
            ]
        },
        {
            "name": "Ring of Building",
            "effects": [
                "You can cast Mending as an action.",
                "You can rub the ring as a reaction when an obj or structure you can see within 300' of you takes dmg, causing it to be imm to that dmg and any further dmg of the same type until the start of your next turn.",
                "You can rub the ring as an action to cast Fabricate, Move Earth, Passwall, or Summon Construct, and that spell cannot be cast from the ring again until you finish a long rest."
            ]
        },
        {
            "name": "Ring of Rulership",
            "effects": [
                "Once per long rest, as an action, you may present the ring and command obedience from each creature of your choice that you can see within 120'. Each target must succeed on a DC 15 WIS save or be charmed by you for 8hrs, or until it is harmed by you or your companions, or commanded to do something contrary to its nature.",
                "While a creature is charmed by this ring, it regards you as its trusted leader."
            ]
        },
        {
            "name": "Ring of Piercing Vulnerability",
            "effects": [
                "You have 50% resistance to P dmg.",
                "[CURSE] You have 50% vulnerability to B and S dmg."
            ]
        },
        {
            "name": "Dragon's Wrath Ring",
            "effects": [
                "Whenever you roll a 20 on a wep atk, each foe adj to the atk's target takes 5 $nonPhysType dmg.",
                "L11+: +1d6 {nonPhysType} dmg to your wep hits."
            ]
        },
        {
            "name": "Sign of Binding",
            "effects": [
                "The sign has 7 charges, 1d6 + 1 of which are recovered at the end of a long rest.",
                "If you expend the sign's last charge, roll a d20. On a 1, the sign crumbles into ash and is destroyed.",
                "As an action, you can expend the sign's charges to cast the following spells (DC 17): Hold Monster (5 charges) or Hold Person (2 charges).",
                "As a reaction to making a save to avoid being staggered or restrained, you can expend 1 charge from the sign to gain adv on the save. You can do the same for checks/saves to escape grapples."
            ]
        },
        {
            "name": "Protective Sign",
            "effects": [
                "The ring is initially locked with a magical keyhole (DC 20 to pick). It does nothing else while locked by someone other than you.",
                "As an action, you can touch the ring and cause it to lock as if you cast Arcane Lock on it.",
                "Add the following spells to your spell list: Arcane Lock, Dispel Magic, Globe of Invulnerability, Glyph of Warding, Mordenkainen's Private Sanctum, Protection from Evil, and Symbol.",
                "The sign has 3 charges, 1d3 of which are recovered at the end of a long rest.",
                "If you spend 1min studying the sign, you can expend 1 charge to replace one of your prepared spells with an Abjuration one from your spell list.",
                "Whenever you cast an Abjuration spell, you can expend 1 charge to grant a creature you can see within 30' of you 2d10 temp HP."
            ]
        },
        {
            "name": "Ring of Thunder Resistance",
            "effects": [
                "You have 50% resistance to thunder dmg."
            ]
        },
        {
            "name": "Sign of Fireballs",
            "effects": [
                "The sign has 7 charges, 1d6 + 1 of which are recovered at the end of a long rest.",
                "As an action, you can expend charges to cast Fireball (DC 15). For 1 charge, you cast the 3rd-lvl version of the spell, and can increase the spell lvl by 1 for each additional charge you spend.",
                "If you expend the sign's last charge, roll a d20. On a 1, the sign crumbles into ashes and is destroyed."
            ]
        },
        {
            "name": "Sign of Enemy Detection",
            "effects": [
                "The sign has 7 charges, 1d6 + 1 of which are recovered at the end of a long rest.",
                "As an action, you can expend 1 charge and say 'Inimicus' to know the direction of the nearest hostile creature to you within 60' for the next min."
            ]
        },
        {
            "name": "Acheron Sign",
            "effects": [
                "You are immune to effects that turn undead.",
                "As an action 1/LR, you can gain 1d4 + 4 temporary hit points.",
                "1/LR, when you hit a creature with a melee wep atk, you can fill the target with unsettling dread, granting them disadvantage on their next save before the end of your next turn. This has no effect if the target is immune to the frightened condition."
            ]
        },
        {
            "name": "Butcher's Sign",
            "effects": [
                "1/turn, you can reroll the wep dmg dice for a melee wep atk.",
                "+1 wep S crit range."
            ]
        },
        {
            "name": "Ring of Wonder",
            "effects": [
                "The ring has 7 charges, 1d6 + 1 of which are recovered at the end of a long rest.",
                "As an action, you can expend 1 charge and choose a target within 120' of you. This target can be a creature, obj, or point in space. Roll a d100 and triger the following effect (DC 15). Ignore any range limits the effects may have, and any effects that allow you to chosen targets in an area instead select them randomly:",
                "Table: https://5e.tools/items.html#wand%20of%20wonder_dmg"
            ]
        },
        {
            "name": "Shadowfell Brand",
            "effects": [
                "+60' darkvision.",
                "You have adv on Stealth checks.",
                "1/LR when dmg'd, you can react to take half dmg."
            ]
        },
        {
            "name": "Battering Ring",
            "effects": [
                "The ring has 3 charges, 1d3 of which are recovered at the end of a long rest.",
                "On pushing a creature within your reach away from you, you can expend 1 charge to push them an additional 10', also knock them prone, or both."
            ]
        },
        {
            "name": "Flame Tongue",
            "effects": [
                "As a bonus action, you can say 'flamma' to cause harmless flames to erupt from the ring. The flames last until you say the word again as another bonus action.",
                "The flames shed bright light for 40' and dim for another 40'.",
                "While the ring is ablaze, your melee wep hits deal +2d6 fire dmg."
            ]
        },
        {
            "name": "Ring of Padstowe",
            "effects": [
                "As an action, you can touch the ring to cast one of the following spells with your own spellcasting stats: Fly, Invisibility, Levitate, Protection from Evil and Good, Cure Wounds (3rd lvl), Dispel Magic, and Protection from Energy (light only). Each spell can only be cast 1/LR in this way.",
                "Whenever you cast a spell with either a somatic or material component that can inflict the charmed condition on a failed save, you can impose disadv on the save."
            ]
        },
        {
            "name": "Ring of the Gods",
            "effects": [
                "You know whether there is a celestial or fiend within 30' of you, as well as its exact location, provided it isn't behind total cover.",
                "At the end of each LR, you can pray to a Xiloan to receive and store in the ring their signature spell for that day: The Cloud (Ice Knife), Aroshi (Chaos Bolt), P'all (Find Familiar), Mensis (Searing Equation), Gawdian (Divine Favor).",
                "The ring has 3 charges, 1d3 of which are recovered after a long rest. You can expend 1 charge to cast the spell stored in the ring."
            ]
        },
        {
            "name": "Voyager Ring",
            "effects": [
                "+1 spell AB.",
                "The ring has 10 charges, 1d6 + 4 of which are recovered after a long rest. If the last charge is expended, roll a d20. On a 1, the ring vanishes forever.",
                "As an action, you can expend charges to cast one of the following spells, using your own spell save DC: Banishment (4 charges), Blink (3 charges), Misty Step (2 charges), Passwall (5 charges), or Teleport (7 charges)."
            ]
        },
        {
            "name": "Docent",
            "effects": [
                "The docent is a true neutral sentient item with 16 INT, 14 WIS, and 14 CHA. It perceives the world thru your senses, communicates telepathically with you, and can speak/read/understand Common, Giant, and 1d4 languages of the DM's choice.",
                "A docent is designed to advise and assist its wearer. Its properties are under its own control, and if you have a bad relationship with your docent, it might refuse to assist you.",
                "Whenever you end your turn with 0 HP, the docent can make a Medicine check with a +6 bonus against a DC of 13. On a success, you are stabilised.",
                "Whenever the docent knows fewer than 6 languages and it hears or reads one through your senses, it can learn that language.",
                "The docent has a +7 bonus to one of the following skills (d4): 1. Arcana, 2. History, 3. Investigation, or 4. Nature.",
                "The docent knows one of the following spells and can cast it at-will (d6): 1-2. Detect Evil and Good or 3-6. Detect Magic."
            ]
        },
        {
            "name": "Ring of Staggering",
            "effects": [
                "The ring has 7 charges, 1d6 + 1 of which are recovered after a long rest. If you expend the ring's last charge, roll a d20. On a 1, it crumbles into ash and is destroyed.",
                "As an action, you expend 1 charge to cause a thin blue ray to streak from the ring to a creature you can see within 60' of you. The target must make a DC 15 CON save or be staggered until save."
            ]
        },
        {
            "name": "Ring of Seeing",
            "effects": [
                "The ring has 3 charges, 1d3 of which are recovered after a long rest.",
                "As an action, you can say 'video' and expend 1 charge to gain 120' of truesight whenever you look through the ring, for 10mins."
            ]
        },
        {
            "name": "Ring of Spell Resistance",
            "effects": [
                "You have adv on saves vs spells."
            ]
        },
        {
            "name": "Protection Stone",
            "effects": [
                "+1 AC."
            ]
        },
        {
            "name": "Ring of Acid Resistance",
            "effects": [
                "You have 50% resistance to acid dmg."
            ]
        },
        {
            "name": "Ring of Evasion",
            "effects": [
                "The ring has 3 charges, 1d3 of which are recovered after a LR.",
                "Whenever you fail a DEX save, you may react to spend 1 charge and succeed on that save instead."
            ]
        },
        {
            "name": "Ring of Padstowe",
            "effects": [
                "As an action, you can touch the ring to cast one of the following spells with your own spellcasting stats: Fly, Invisibility, Levitate, Protection from Evil and Good, Stone Shape, Wall of Fire, and Wind Wall. Each spell can only be cast 1/LR in this way.",
                "Whenever you cast a spell with either a somatic or material component that can inflict the charmed condition on a failed save, you can impose disadv on the save."
            ]
        },
        {
            "name": "Ring of Wounding",
            "effects": [
                "HP lost to your wep dmg can only be recovered through rests.",
                "1/turn, on wep hit, you can inflict a 1d4 nec DoT, stacking until DC 15 CON save or a creature takes an action to Medicine DC 15 them."
            ]
        },
        {
            "name": "Pariah's Ring",
            "effects": [
                "+1 AC for every 2 allies adjacent to you (up to +3).",
                "Whenever an adjacent creature you can see takes damage, you can react to take the damage instead. When you do so, the damage gets fully converted to force."
            ]
        },
        {
            "name": "Reveler's Ring",
            "effects": [
                "+2 to your spell save DC.",
                "1/LR, as action, you can cast Otto's Irresistable Dance."
            ]
        },
        {
            "name": "Ring of Speed",
            "effects": [
                "As a bonus action you can click your heels together, gaining the following bonuses for up to 10 minutes, or until you click your heels again as another bonus action. After the total amount of time you have used this effect for reaches 10 minutes between long rests, it cannot be used again until you complete a long rest.",
                "Your speed is doubled.",
                "Incoming opportunity attacks have disadvantage."
            ]
        },
        {
            "name": "Stirring Scaled Ornament",
            "effects": [
                "You are imm to the charmed and frightened conditions.",
                "Allies within 30' of you have adv on saves vs charm and fright."
            ]
        },
        {
            "name": "Medium Barrier Ring",
            "effects": [
                "While unarmoured, your base AC is equal to 15 + DEX mod (max 2). You can still wear a shield and gain this benefit."
            ]
        }
    ],
    "very rare": [
        {
            "name": "Ring of Fire Giant Strength",
            "effects": [
                "Your Strength is always equal to 25."
            ]
        },
        {
            "name": "Piercer",
            "effects": [
                "You regain the maximum possible number of hit points from incoming healing while conscious.",
                "[CURSE] You have disadvantage on Journey activity checks."
            ]
        },
        {
            "name": "Brass Dragon Ring",
            "effects": [
                "You have adv on saves against the Frightful Presence and breath weapons of dragons.",
                "You have 50% resistance to fire dmg.",
                "1/LR, as an action, you can magically discern the distance and direction of the nearest brass dragon within 30 miles of you."
            ]
        },
        {
            "name": "Ring of Frost Giant Strength",
            "effects": [
                "Your Strength is always equal to 23."
            ]
        },
        {
            "name": "Dimensional Loop",
            "effects": [
                "+1 to STR saves.",
                "You gain 30' of darkvision.",
                "As a bonus action 1/LR, you can send your body out of phase, granting adv on Stealth checks to hide, and imposing disadv on incoming atks.",
                "As a free action 1/LR, you can choose a space within 60' of you to consider adj to you until the end of your turn. Amongst the standard benefits this provides, your movement through this fold ignores opp atks.",
                "If the Loop is worn by a living creature, it triggers a Wild Magic Surge whenever one of its powers is used."
            ]
        },
        {
            "name": "Loop of Striking",
            "effects": [
                "The loop has 10 charges, 1d6 + 4 of which are regained at the end of a long rest.",
                "On melee wep hit, you can expend up to 3 of the loop's charges to deal an addition 1d6 force dmg per charge expended.",
                "If you expend the loop's last charge, roll a d20. On a 1, the loop loses all its magic."
            ]
        },
        {
            "name": "Ring of Telekinesis",
            "effects": [
                "You can cast Telekinesis at no cost, but can only target objs that are not being worn/carried."
            ]
        },
        {
            "name": "Golgari Keyrune",
            "effects": [
                "As an action, you can say 'Golgari' and place the ring on the ground in an empty space adj to you to cause it to transform into a Giant Scorpion. If there isn't enough space for the Scorpion, the ring doesn't transform. The Scorpion is your minion and lasts up to 6hrs before reverting into a ring.",
                "The ring reverts early if the Scorpion drops to 0 HP or you say 'Golgari' again.",
                "After the ring reverts for any reason, it cannot transform again for 2 days."
            ]
        },
        {
            "name": "Fire Absorbing Rune",
            "effects": [
                "You have 50% resistance to fire dmg.",
                "On taking fire dmg 1/LR, you can react to gain imm to that instance of fire dmg, and you regain a number of hit points equal to half the dmg you would have taken."
            ]
        },
        {
            "name": "Dancing Rune",
            "effects": [
                "As a bonus action, you can toss the ring into the air and say 'dancer' to transform it into a copy of your onhand weapon and animate it as a minion. The minion cannot be targeted or take dmg, and uses your AB and ability mod for its dmg. It has a fly speed of 30', and you must use your bonus action to control it each turn (except when it is first summoned).",
                "If the animated ring is ever more than 30' away from you, it reverts to ring form and falls to the ground.",
                "After the animated ring's 4th atk, it flies back to you, reverts to ring form, and returns to your finger."
            ]
        },
        {
            "name": "Rune of Frost",
            "effects": [
                "You have 50% resistance to cold damage.",
                "The ring has 10 charges, 1d6 + 4 of which are replenished at the end of a long rest. If the last charge is expended, roll a d20. On a 1, the ring turns to water and is destroyed.",
                "As an action if you can cast spells, you can expend charges to cast one of the following spells, using your own spell save DC: Cone of Cold (5 charges), Fog Cloud (1 charge), Ice Storm (4 charges), or Wall of Ice (4 charges)."
            ]
        },
        {
            "name": "Leadership Stone",
            "effects": [
                "+2 CHA."
            ]
        },
        {
            "name": "Psychic Absorbing Ring",
            "effects": [
                "You have 50% resistance to psy dmg.",
                "1/LR, on taking psy dmg, you can react to gain imm to that instance and heal HP equal to half the original dmg."
            ]
        },
        {
            "name": "Ring of Padstowe",
            "effects": [
                "As an action, you can touch the ring to cast one of the following spells with your own spellcasting stats: Fly, Invisibility, Levitate, Protection from Evil and Good, Control Weather, Cure Wounds (upcast to 5th lvl), and Wall of Thorns. Each spell can only be cast 1/LR in this way.",
                "Whenever you cast a spell with either a somatic or material component that can inflict the charmed condition on a failed save, you can impose disadv on the save."
            ]
        },
        {
            "name": "Copper Dragon Ring",
            "effects": [
                "You have adv on saves against the Frightful Presence and breath weapons of dragons.",
                "You have 50% resistance to acid dmg.",
                "1/LR, as an action, you can magically discern the distance and direction of the nearest copper dragon within 30 miles of you."
            ]
        },
        {
            "name": "Strength Stone",
            "effects": [
                "+2 STR."
            ]
        },
        {
            "name": "Fortitude Stone",
            "effects": [
                "+2 CON."
            ]
        },
        {
            "name": "Spellguard Ring",
            "effects": [
                "You have adv on magical saves.",
                "Incoming spell atks have disadv."
            ]
        },
        {
            "name": "Peregrine Ring",
            "effects": [
                "+60' fly speed.",
                "You have adv on init rolls."
            ]
        },
        {
            "name": "Oathring",
            "effects": [
                "1/LR, when you make a ranged wep atk, you can say 'swift death to you who have wronged me' to designate the atk's target as your sworn enemy until it dies or for 1 week. You can have only 1 sworn enemy at a time.",
                "Whenever you make a ranged wep atk against your sworn enemy, you have adv on the atk roll, the target has no benefit from non-total cover, and you suffer no disadv from long range. On a hit, the atk deals +3d6 P dmg.",
                "[CURSE] While your sworn enemy lives, you have disadv on non-ranged wep atks."
            ]
        },
        {
            "name": "Duskvagrant's Ring",
            "effects": [
                "You have 50% resistance to psn and acid dmg.",
                "You are imm to the psn'd condition.",
                "As an action 1/LR, you can say 'Limus' to cause your body to assume the amorphous qualities of an ooze. For the next min, you can move through a space as narrow as 1 inch wide without squeezing.",
                "As an action 1/LR, you can exhale acid in a 30' line that forces a DC 15 DEX save. Creatures take 8d8 acid dmg on a fail, or half as much on a succ.",
                "[CURSE] You cannot unattune from the ring, as its power comes from ooze that it injects into your body. You become permanently poisoned while attuned to the ring without wearing it.",
                "If you die while attuned to the ring, a Black Pudding erupts from your corpse and engulfs your corpse. It is allied with Aroshi."
            ]
        },
        {
            "name": "Ring of Stone Giant Strength",
            "effects": [
                "Your Strength is always equal to 23."
            ]
        },
        {
            "name": "Amethyst Lodestone",
            "effects": [
                "You have adv on Strength saves.",
                "The ring has 6 charges, 1d6 of which are recovered after a long rest.",
                "As a bonus action, you can expend 1 charge to gain a flying speed (hover) equal to your walking speed for 10mins.",
                "As an action, you can expend 1 charge to focus gravity around a creature you can see within 60' of you. They must pass a DC 18 STR save or be pushed up to 20' in a direction of your choice.",
                "As an action, you can expend 3 charges to cast the Reverse Gravity spell (DC 18)."
            ]
        },
        {
            "name": "Ring of Regeneration",
            "effects": [
                "+1 passive regen.",
                "If you lose a body part, it regrows after 1d6 + 1 days if you have at least 1 HP the whole time, otherwise the process is interrupted and must be started again."
            ]
        },
        {
            "name": "Duskcrusher",
            "effects": [
                "As a bonus action, you can cause the ring sprout a jewel of crackling radiance. This emits 15' of bright light and a further 15' of dim. This light is sunlight. You can dismiss the jewel as an action.",
                "While the jewel is active, your melee wep base dmg is converted to rad, and your melee wep hits deal +1d8 rad dmg vs undead.",
                "1/LR while the jewel is active, you can cast Sunbeam (DC 15)."
            ]
        },
        {
            "name": "Bronze Dragon Ring",
            "effects": [
                "You have adv on saves against the Frightful Presence and breath weapons of dragons.",
                "You have 50% resistance to light dmg.",
                "1/LR, as an action, you can magically discern the distance and direction of the nearest bronze dragon within 30 miles of you."
            ]
        },
        {
            "name": "Arcane Propulsion Ring",
            "effects": [
                "You gain a STR-based natural melee weapon that projects from the ring. It deals 1d8 force dmg and has the Thrown (20'/60') trait."
            ]
        },
        {
            "name": "Chronolometer",
            "effects": [
                "+1 to INT saves.",
                "The first time you attune to this ring, choose a language you don't know. You know that language while attuned to the ring.",
                "1/LR, on turn start, roll a d6. On a 1-3, you slow down time, gaining an additional standard action and doubling your speed for the turn. On a 4+, you go forward in time to warn yourself of what is to come. The next time you fail a d20 roll, you can reroll the check and take either result.",
                "1/LR, when a creature you can see within 30' of you takes dmg, you can react to grant that creature an immediate standard action that it can take.",
                "[CURSE] While the ring is outside of the Shimmering Library, its magic can function sporadically or with unpredictable side effects, as determined by the DM."
            ]
        },
        {
            "name": "Loop of the Veil",
            "effects": [
                "+2 WIS and WIS max.",
                "+60' darkvision.",
                "You have adv on percep checks to find hidden doors and paths.",
                "[CURSE] All non-magical flames within 30' of you automatically extinguish.",
                "[CURSE] Your fire dmg is halved."
            ]
        },
        {
            "name": "Nine Lives Stealer",
            "effects": [
                "The ring has 1d8 + 1 charges when found, which cannot be recovered.",
                "On crit vs a creature with fewer than 100 HP, it must succeed on a DC 15 CON save or be slain instantly as the ring rips its life force from its body. Constructs and undead are immune to this effect. If a creature is slain by this effect, the ring loses 1 charge.",
                "When the ring's last charge is expended, it becomes mundane."
            ]
        },
        {
            "name": "Living Ring",
            "effects": [
                "[CURSE] When you put the ring on, tendrils sprout from it and burrow into your finger from the ring's inner side. You cannot remove the ring willingly.",
                "You gain 50% resistance to nec, psn, and psy dmg.",
                "[CURSE] Whenever you complete a LR, you must either feed half your hit dice to the ring (rounded up) or gain 1 level of fatigue."
            ]
        },
        {
            "name": "Blue Dragon Ring",
            "effects": [
                "You have adv on saves against the Frightful Presence and breath weapons of dragons.",
                "You have 50% resistance to light dmg.",
                "1/LR, as an action, you can magically discern the distance and direction of the nearest blue dragon within 30 miles of you."
            ]
        },
        {
            "name": "Insight Stone",
            "effects": [
                "+2 WIS."
            ]
        },
        {
            "name": "Poison Absorbing Ring",
            "effects": [
                "You have 50% resistance to psn dmg.",
                "1/LR, on taking psn dmg, you can react to gain imm against that instance of dmg and heal equal to half psn dmg dealt."
            ]
        },
        {
            "name": "Ring of the Planes",
            "effects": [
                "As an action, you can name a location that you are familiar with on another plane of existence, then make a DC 15 Intelligence check. On a success, you cast Plane Shift. On a fail, you and each creature and object within 15' of you travel to a random destination (roll d100, 1-60 is random location on plane you named, 61+ is on any random plane)."
            ]
        },
        {
            "name": "Intellect Stone",
            "effects": [
                "+2 INT."
            ]
        }
    ],
    "legendary": [
        {
            "name": "Ring of Djinni Summoning",
            "effects": [
                "You can say 'Jinn' as an action to summon a particular Djinni from the Elemental Plane of Air. It appears in an unoccuddd space you choose within 120' of you, and remains as long as you concentrate, to a maximum of 1hr, or until it drops to 0 HP. It then returns to its home plane. If it returned above 0 HP, it cannot be summoned again for 24hrs. Otherwise, the ring becomes mundane.",
                "While summoned, the Djinni is friendly to you and your companions. It obeys any commands you give it, no matter what language you use. If you fail to command it, the Djinni defends itself against attackers but takes no other actions."
            ]
        },
        {
            "name": "Ring of Invulnerability",
            "effects": [
                "You have resistance to non-magical dmg.",
                "Once per long rest, you can use an action to make yourself immune to non-magical dmg for 10mins."
            ]
        },
        {
            "name": "Stormclasp",
            "effects": [
                "You have 50% resistance to light and thunder dmg.",
                "Your Strength is always equal to 21 [L11+: 23], unless it would usually be higher.",
                "1/LR, as an action, you may become a Storm Avatar for 1min, gaining the following benefits: immunity to light and thunder dmg; when you hit with a wep atk that normally deals B dmg, it deals thunder instead. P and S are similarly converted to light; As a bonus action, you can choose 1 creature you can see within 30' to be struck by lightning, forcing them to pass a DC 15 DEX save or take 3d6 [L11+: 4d6] light, or half as much on a success.",
                "L11+: While transformed into a Storm Avatar, you gain 30' of fly speed and can hover."
            ]
        },
        {
            "name": "Ascendant Dragon-Touched Focus",
            "effects": [
                "You have adv on init rolls.",
                "Your weapons gain the Conduit trait.",
                "If your name starts with A-->I, whenever you use a spell slot to cast a spell that deals acid, cold, fire, light, or psn dmg, roll a d6, and you gain a bonus equal to the number rolled to one of the spell's dmg rolls.",
                "If your name starts with A-->I, you can cast Hold Monster and Rime's Binding Ice, each once per long rest.",
                "If your name starts with J-->R, whenever you use a spell slot to cast a spell, you can immediately teleport to an unoccupied space you can see within 15' of you.",
                "If your name starts with J-->R, you can cast Rary's Telepathic Bond and Raulothim's Psychic Lance, each once per long rest.",
                "If your name starts with S-->Z, whenever a creature you can see within 30' of you makes a save, you can use your reaction to give that creature adv on the save.",
                "If your name starts with S-->Z, you can cast Fizban's Platinum Shield and Legend Lore, each once per long rest.",
                "1/LR, when casting a lvl'd spell, you can treat the spell as if it were cast using a 9th-lvl spell slot."
            ]
        },
        {
            "name": "Ring of Mind Reading",
            "effects": [
                "While touching the ring, you can cast the Scrying spell (DC 17) with it.",
                "You can use an action to cast the Detect Thoughts spell (DC 17) while Scrying is active through the ring, targeting creatures you can see within 30 feet of the spell's sensor. You do not need to concentrate on this Detect Thoughts to maintain it during its duration, but it ends if Scrying ends."
            ]
        },
        {
            "name": "Focus of Answering",
            "effects": [
                "You can use your reaction to make a melee weapon attack against any creature in your reach that deals damage to you. You have advantage on the attack roll, and any damage dealt by the attack ignores immunities and resistances."
            ]
        },
        {
            "name": "Holy Avenger",
            "effects": [
                "Your wep hits deal +2d10 rad dmg vs fiends and undead.",
                "You project a 10' aura that grants allies adv on mag saves."
            ]
        },
        {
            "name": "Spell Ring",
            "effects": [
                "This ring can store 1 spell of up to 5th lvl at a time.",
                "When first found, roll a d6 and subtract 1. That is the level of spell in the ring (randomly chosen).",
                "While the ring contains no spell, any creature can cast a levelled spell up to 5th lvl into it by touching it while casting. The spell has no effect other than being stored.",
                "While touching the ring, you can cast the spell stored in it, using the stats of the original caster. This consumes the contained spell and the ring becomes empty.",
                "If the ring is empty when you see a creature casting a spell within 60' of you, you can touch the ring as a reaction to attempt to interrupt the spell. If the spell is of 3rd lvl or lower, it has no effect and is instead stored in the ring. A higher-levelled spell requires you to make an INT check of DC 10 + the spell's lvl. On a success, it has no effect other than being stored in the ring."
            ]
        },
        {
            "name": "Avenger of the Feral Guardian",
            "effects": [
                "While shapeshifted, you have a +1 bonus to melee atk and dmg rolls [L11+: +2].",
                "While shapeshifted, +1 AC [L11+: +2].",
                "As an action 1/LR, you can cast Polymorph on yourself to shapeshift into a Giant Owl [L11+: Cave Bear]. You retain your mental ability scores when using the spell in this way.",
                "If the ring is empty when you see a creature casting a spell within 60' of you, you can touch the ring as a reaction to attempt to interrupt the spell. If the spell is of 3rd lvl or lower, it has no effect and is instead stored in the ring. A higher-levelled spell requires you to make an INT check of DC 10 + the spell's lvl. On a success, it has no effect other than being stored in the ring."
            ]
        },
        {
            "name": "Avenger of the Stilled Tongue",
            "effects": [
                "As a bonus action 1/LR, you can cast any spell from your spell list without expending a spell slot or using any verbal or somatic component.",
                "[CURSE] Vecna watches anyone wearing this ring. He can write cryptic msgs on the inside of its band, which appear at midnight and fade after being read."
            ]
        },
        {
            "name": "Anulus Infinitus",
            "effects": [
                "The following spells are added to your spell list: https://5e.tools/items.html#grimoire%20infinitus%20(awakened)_egw",
                "You can have 1 [L11+: 2] additional spell prepared.",
                "L11+: You have adv on magical saves."
            ]
        },
        {
            "name": "Regeneration Stone",
            "effects": [
                "At the end of each short rest, you heal 15 HP if you are conscious.",
                "At the end of each journey activity a member of your party undertakes, you heal 15 HP."
            ]
        },
        {
            "name": "P'all's Beholder Stone",
            "effects": [
                "You gain 120' of darkvision, which also penetrates magical darkness.",
                "The stone has 10 charges, 1d6 + 3 of which are recovered after a long rest.",
                "As an action, you can expend charges to cast one of the following spells (DC 16): Charm Person (1 charge), Disintegrate (6 charges), Fear (3 charges), Finger of Death (7 charges), Flesh to Stone (6 charges), Hold Person (2 charges), Ray of Enfeeblement (2 charges), Sleep (1 charge), Slow (3 charges), or Telekinesis (5 charges).",
                "[CURSE] When you attune to the stone, tendrils erupt from it and burrow into your flesh. You cannot remove it willingly.",
                "[CURSE] While you are in the Colossal Tower, P'all can see through your eyes."
            ]
        },
        {
            "name": "Blackloop",
            "effects": [
                "Blackloop is a sentient chaotic evil ring with 17 INT, 10 WIS, and 19 CHA. It has hearing and darkvision of 120'. It communicates telepathically with its wearer, its voice deep and echoing, and can also speak/read/understand Common and any other languages you know.",
                "Blackloop speaks with an imperious tone, as thought accustomed to being obeyed. Its purpose is to consume souls. It doesn't care whose souls it eats, including yours. The ring believes that all matter and energy sprang from a void of negative energy and will one day return to it. Blackloop is meant to hurry that process along.",
                "On wep KB, the ring devours the target's soul, unless it is a construct or undead. A creature whose soul has been devoured by the ring can only be restored to life by the Wish spell.",
                "Whenever the ring devours a soul, you gain temp HP equal to the creature's max HP. While you have this temp HP, you also have adv on any d20 rolls.",
                "You are aware of the presence of any creatures within 60' of you that are not constructs or undead.",
                "You cannot be charmed or frightened.",
                "The ring can cast Haste 1/LR. It decides when to cast the spell and has its own concentration for it.",
                "[CURSE] On wep hit vs undead, you take 1d10 nec dmg and the undead heals 1d10 HP. If this nec dmg reduces you to 0 HP, the ring devours your soul.",
                "[CURSE] If the ring goes 3+ days without consuming any souls, a conflict between it and you occurs during your next long rest."
            ]
        },
        {
            "name": "Talarith",
            "effects": [
                "+1d6 force dmg to your wep hits.",
                "1/SR, as an action, you can summon a golem minion that looks identical to you. The golem has the same statistics as you, including all of your equipment, except for this ring. The golem vanishes if it reaches 0 HP, or after 1hr."
            ]
        },
        {
            "name": "Loop of Telepathy",
            "effects": [
                "You can cast Scrying (save DC 17) at-will.",
                "While scrying with the loop, you can communicate telepathically with creatures you can see within 30' of the spell's sensor. As an action 1/LR, you can also cast Suggestion (DC 17) through the sensor on one of those creatures. You don't need to concentrate on Suggestion when it is cast in this way, though it ends if the Scrying ends."
            ]
        },
        {
            "name": "Defender",
            "effects": [
                "The first time you make a wep atk on each of your turns, you can reduce your wep AB by up to 3 in order to gain that much AC, both until the start of your next turn. You must choose to do this before you make your atk roll."
            ]
        },
        {
            "name": "Loop of the Prism",
            "effects": [
                "+60' of darkvision.",
                "On atk hit vs a beast, dragon, or monstrosity of up to CR 5 (L11+: CR 10), or when you grapple one, you can cast Dominate Monster (DC 13 (L11+: DC 15)) on the target. On a successful save, the creature is immune to this effect until it completes a LR. Otherwise, a larger, shimmering image of the ring appears as a collar around the target's neck until it is no longer affected by the spell. You can only have 1 creatured affected by the spell at once, but it doesn't require your concentration."
            ]
        },
        {
            "name": "Ring of Air Elemental Command",
            "effects": [
                "You have adv on atks vs elementals from the Elemental Plane of Air, and they have disadv on atks vs you.",
                "The ring has 5 charges, 1d4 + 1 of which are recovered after a LR.",
                "You can expend 2 charges to cast Dominate Monster (DC 17) on an Air Elemental.",
                "You are imm to fall dmg.",
                "You gain proficiency in Auran.",
                "If your party kills an Air Elemental, you gain 50% resistance to light dmg, a fly sp (hover) equal to your sp, and can cast the following spells by expending charges (DC 17): Chain Lightning (3 charges), Gust of Wind (2 charges), Wind Wall (1 charge)."
            ]
        },
        {
            "name": "Nightfall Ring",
            "effects": [
                "1/LR, by spending 10 minutes activating the ring, you can cause night to fall within 10 miles of you. The artificial nightfall lasts for 24hrs, until you cancel it as an action, or until you take the ring off."
            ]
        },
        {
            "name": "Ring of Lordly Might",
            "effects": [
                "The ring has 6 buttons on it, each numbered 1-6. You can press one as a bonus action, and its effects last until you push a different button or until you cancel it by pressing the same button again.",
                "1. Flames erupt from your melee weapons, shedding bright light for 40' and dim light for a further 40'. Add 2d6 fire dmg to your melee weapon hits.",
                "2. Two crescent-shaped blades spring out from your melee weapons, changing their dmg dice to 1d10 S and replacing all of their traits with just the Sweep trait.",
                "3. A spear point springs from your melee weapons, changing their dmg dice to 1d8 P and replacing all of their traits with just Thrown (40'/120').",
                "4. The ring transforms into a ladder up to 50' tall that can bear up to 4 tonnes.",
                "5. The ring transforms into a handheld battering ram that grants you +10 to STR checks to break through barriers.",
                "6. The ring gives you a constant indication of where north is, as well as your approximate vertical distance from surface ground.",
                "1/LR, on melee wep hit, you can force the target to make a DC 17 CON save. On a fail, they take 4d6 additional nec dmg and you regain HP equal to half that dmg.",
                "1/LR, on melee wep hit, you can force the target to make a DC 17 STR save. On a fail, they are staggered until save.",
                "1/LR, on melee wep hit, you can force the target to make a DC 17 WIS save. On a fail, they are fright of you until save."
            ]
        },
        {
            "name": "Ring of Invisibility",
            "effects": [
                "As an action, you can become invisible, or end this invisibility.",
                "The ring has a maximum duration of 2hrs, which is deducted from while you are using the invisibility. Whenever you spend a full day not using the invisibility, the ring regains up to 2hrs of duration."
            ]
        },
        {
            "name": "Ruby Weave Ring",
            "effects": [
                "At the end of each LR, choose a spell from any spell list. You count as having this spell prepared until your next LR."
            ]
        },
        {
            "name": "Moonring",
            "effects": [
                "[CURSE] If the ring considers you craven, erratic, corrupt, or at odds with preserving and protecting elvenkind, it rejects you - you make d20 rolls with disadv for 24hrs, after which the ring is destroyed.",
                "The ring is a sentient neutral good item with 12 INT, 10 WIS, and 12 CHA. It has hearing + darkvision out to 120 feet. It communicates by transmitting emotions, sending a tingling sensation through its wearer's hand when it wants to communicate something it has sensed. It can communicate more explicitly through dreams while the wearer is asleep.",
                "The ring seeks the advancement of elvenkind and elven ideals: courage, loyalty, beauty, music, and life. The ring is overconfident.",
                "The ring has a rune on it for each creature that has attuned to it (1d6 + 1 initially). Each rune provides a random weapon modifier."
            ]
        },
        {
            "name": "Infiltrator's Ring",
            "effects": [
                "You have adv on Sleight of Hand checks made to pick locks (this does not affect Rob journey activity checks).",
                "You have adv on Stealth checks made to move silently (this affects Scout journey activity checks).",
                "L11+: As a bonus action, you can transform the ring into a magical +1 dagger, or back into ring form.",
                "L11+: As an action, you can cast each of the following spells 1/LR each: Alter Self, Invisibility, Knock, or Pass Without Trace."
            ]
        }
    ],
    "artifact": [
        {
            "name": "Ring of the Black Crown",
            "effects": [
                "The ring is a sentient lawful evil object with INT 20, WIS 12, and CHA 18. It has hearing and darkvision of 120'. It communicates telepathically with its wearer and is prof in common + infernal.",
                "A greedy Erinyes named Xartaza lives within the ring. She wants to recruit more souls for Asmodeus, so the ring pushes its wearer toward lawful evil actions by manipulating their dreams. A former war general, Xartaza hates demons and Mensis, and relishes crafting sound battle plans in any conflict.",
                "You gain prof in Infernal.",
                "As a bonus action, you can say 'Xartaza' to cause the ring to erupt into flame, shedding bright/dim light for 40'/40'. While ablaze, your wep hits deal 1d6 (L11+: 2d6) additional fire dmg. Flames last until you use another bonus action or are no longer wearing the ring.",
                "1/LR, as action, can summon Imp (L11+: Bearded Devil) minion that lasts 10mins.",
                "L11+: You have 50% resistance to psn dmg."
            ]
        },
        {
            "name": "Dekella, Ring of Thassa",
            "effects": [
                "+2d10 cold dmg to your wep hits.",
                "If you devote yourself spiritually to The Cloud, you can breathe underwater and gain a swimming speed of 60'.",
                "If you do not devote yourself spiritually to The Cloud, you have -1 global AB and -1 to your DCs.",
                "1/LR, as an action, you can change the condition of the sea within 1 mile of you, creating strong winds and heavy rain that cause violent waves or calming a storm. In either case, the unnatural weather lasts 1hr before returning to normal.",
                "1/LR, you can cast Dominate Monster (DC 18), but only on beasts and monstrosities with an innate swim speed.",
                "1/LR, you can case True Polymorph (DC 18), but you must cast it on a creature to turn it into a kind of creature that has an innate swim speed."
            ]
        },
        {
            "name": "Ring of Iggwilv",
            "effects": [
                "The ring has 8 charges, of which it recovers 1d8 at the end of each long rest.",
                "As an action, you may cast Hideous Laughter (DC 20).",
                "You may expend charges from the ring to cast any of the following spells (all DC 20): Magic Circle (1 charge), Magic Jar (3 charges), Planar Ally (3 charges), Planar Binding (2 charges), Plane Shift (to the Infinite Rooms of the Black Cathedral only; 3 charges), or Summon Fiend (Demon only; 3 charges)",
                "Whenever you make an Intelligence check to discern information about demons or a Survival check related to the Black Cathedral, you can add double your prof bonus to the check.",
                "When you make a dmg roll for a spell you cast against a fiend, you use the maximum possible result instead of rolling.",
                "Whenever you cast Magic Circle and only name fiends, or Planar Binding targeting a fiend, the spell is upcast to 9th lvl. Additionally, the fiend has disadvantage on its save against the spell.",
                "As an action once per long rest, you can target a fiend you can see that is trapped within a Magic Circle. It must pass a DC 20 CHA save with disadvantage or become trapped within the ring. You know a creature's widely-known name and its depravities while it is trapped.",
                "[CURSE] Whenever you finish a long rest, the creature trapped in the ring of the highest CR can attempt to possess you. You must pass a DC 20 CHA save, or are possessed by the creature, which controls you completely. The possessing creature can release you as an action, appearing in the closest unoccupied space. On a successful save, that creature cannot attempt to possess you for 7 days.",
                "When you first find the ring, it already contains 1d4 random demons."
            ]
        },
        {
            "name": "Ring of Vecna",
            "effects": [
                "[CURSE] When you attune to the ring, your left eye rots away and falls out. You can see out of the ring.",
                "[CURSE] If you unattune from the ring, you die.",
                "[CURSE] Your Alignment changes to Neutral Evil.",
                "You have truesight.",
                "As an action, you can see into and through solid matter until you end the effects as a bonus action. This vision has a radius of 30', and can penetrate 1 foot of stone, 1 inch of common metal, and 3 feet of wood/dirt. Lead cannot be seen through.",
                "The ring has 8 charges. 1d4 + 4 charges are recovered at the end of a long rest.",
                "You can expend charges as an action to cast any of the following spells (DC 18): Clairvoyance (2 charges), Crown of Madness (1 charge), Disintegrate (4 charges), Dominate Monster (5 charges), or Eyebite (4 charges).",
                "[CURSE] Whenever you cast a spell from this ring, there is a 5% chance that Vecna tears your soul from your body, devours it, and takes control of your body. You are killed and your body becomes an NPC under the DM's control."
            ]
        },
        {
            "name": "The Bloody End",
            "effects": [
                "The ring is a sentient lawful evil item with 22 INT, 18 WIS, and 24 CHA. It has hearing and darkvision to a range of 120'. It communicates telepathically with its wearer and is prof in Common and Infernal for speaking aloud.",
                "A tyrannical Pit Fiend named Izeelzee lives within the ring. It pushes its wielder to subjugate others and to never back down from a challenge. If the wearer doesn't demand fealty from others, the ring will do so on their behalf.",
                "You become proficient in Infernal.",
                "As an action, you can cast one of the following spells (DC 13 (L11+: DC 15)): Charm Person, Dominate Person, Fear. Each spell can only be cast 1/LR.",
                "You have adv on Intimidation checks.",
                "L11+: On wep KB, you can force each creature of your choice within 15' of you to make a DC 15 WIS save or be frightened of you until the end of your next turn. This can be done 1/LR.",
                "L11+: When hit by a melee atk, you can react to deal 1d6 psy thorns dmg to the atker."
            ]
        },
        {
            "name": "Will of the Talon",
            "effects": [
                "The ring is a sentient lawful evil item with 14 INT, 15 WIS, and 19 CHA. It has hearing and darkvision out to 120'. It communicates telepathically with its wearer and is proficient in Common, Draconic, and Infernal for speaking aloud.",
                "A short-tempered Bone Devil named Ashtyrion lives within the ring. It is greedy and values strong leadership. It demands that its wielder take decisive action to keep order in high-pressure situations - and to always take a fair of treasure in return.",
                "You gain prof in Draconic and Infernal.",
                "As a bonus action 1/LR, you can force each creature of your choice within 30' of you that is aware of you to make a DC 13 (L11+: DC 15) WIS save. On a fail, a creature becomes frightened of you until save. On succeeding against or ending the effect, it is immune to this power for 24hrs.",
                "As an action, you can exhale destructive energy. Choose the properties of a Dragonborn breath weapon and exhale it. All affected creatures make a DC 13 (L11+: DC 15) save, taking 3d6 (L11+: 4d6) dmg on a fail or half as much on a success. You can only do this with each dmg type 1/LR.",
                "L11+: You have 50% resistance to acid, cold, fire, light, and psn dmg."
            ]
        },
        {
            "name": "Khrusor, Ring of Gawdian",
            "effects": [
                "+2d8 rad dmg to your wep hits.",
                "If you devote yourself spiritually to Gawdian, you gain 15 temp HP at the end of each LR.",
                "If you do not devote yourself spiritually to Gawdian, you have -1 global AB and -1 to your DCs.",
                "The ring sheds sunlight in a 30' radius and dim light for an additional 30'.",
                "1/LR, when you take dmg from an adj creature, you can react to make a melee wep atk against that creature. On a hit, the target is blinded until the start of its next turn.",
                "The ring has 10 charges, 1d6 + 4 of which are replenished at the end of a long rest.",
                "You can expend the ring's charges to cast the following spells (DC 18): Guiding Bolt (1 charge), Daylight (3 charges, targeting the ring only), Sunbeam (6 charges)."
            ]
        },
        {
            "name": "Sign of the Dwarvish Lords",
            "effects": [
                "+2 CON.",
                "You have adv on Persuasion vs Dwarves.",
                "50% chance at the end of each LR to grow a full beard, or a much thicker one if you already have one.",
                "If you are not a Dwarf, you gain adv on saves vs psn'd and 50% resistance vs psn dmg.",
                "You gain 60' of darkvision.",
                "If you are not a Dwarf, you gain prof in Dwarvish.",
                "Your weapons gain the Thrown (20'/60') trait.",
                "+1d8 B dmg to your thrown wep hits, which increases to +2d8 vs giants.",
                "+14 wep crit dmg.",
                "On wep crit, 5% chance to chop off one of your target's limbs, if possible.",
                "As a free action, you can say 'Dweorg' to have the ring shed 10' of bright light and 10' of dim until you say the word again.",
                "If you are a Dwarf, you gain immunity to psn dmg.",
                "If you are a Dwarf, you gain an expertise die in Crafting Creation checks for metal weapons and armour.",
                "Once per long rest as an action, you can cast Conjure Elemental, summoning an Earth Elemental always.",
                "As an action once every 3 days, you can touch the ring to a fixed piece of Dwarven stonework to cast Teleport. If your intended destination is underground, there is no chance of any error in the spell.",
                "[CURSE] Whenever you finish a long rest, you look more and more like a Dwarf, and completely look like one after 7 days. Effect can be reversed by removing a curse from the wearer."
            ]
        },
        {
            "name": "Sign of Kas",
            "effects": [
                "The sign is a sentient chaotic evil ring with 15 INT, 13 WIS, and 16 CHA. It has hearing and darkvision out to 120'. It communicates telepathically with its wearer and can speak proficiently in Common.",
                "The sign's purpose is to bring ruin to liches, their worshipers, minions, works, and artifacts.",
                "You have +1 crit range with melee wep atks.",
                "Your melee wep hits deal +2d10 S dmg against undead creatures.",
                "If the sign isn't bathed in blood within 1min of you rolling init, you must make a DC 15 CHA save. On a success, you take 3d6 psy dmg. On a fail, you are dominated by the sign's sentience, which demands that it be bathed in blood. The spell's effect ends when this demand is met.",
                "Add 1d10 to your init.",
                "Whenever you would make a melee wep atk, you may transfer some or all of the wep's AB to your AC, which lasts until the start of your next turn.",
                "Once per long rest each, as an action, you can cast one of the following spells (DC 18): Call Lightning, Divine Word, or Finger of Death."
            ]
        },
        {
            "name": "Mighty Sign of Leuk-o",
            "effects": [
                "As a free action 1/turn, you can shapeshift into a Mighty Servant of Leuk-o (https://5e.tools/bestiary.html#mighty%20servant%20of%20leuk-o_tce).",
                "Two creatures can be attuned to the sign at once, but only one of them can be shapeshifted with it at a time.",
                "[CURSE] If a creature shapeshifted into the Mighty Servant loses half the form's HP, each creature attuned to the sign must make a DC 20 WIS save or be charmed for 24hrs. When charmed in this way, a creature goes on a destructive spree, seeking to destroy structures and atk any unattuned creatures within sight, starting with those threatening the Mighty Servant form.",
                "There is a hidden self-destruction code for the sign (DM knows). If 2 creatures attuned to it spend their actions for 3 consecutive turns thinking about the code while touching the ring, it explodes. All creatures within 100' of the ring must make a DC 25 DEX save. On a fail, a creature takes 25d6 force, 25d6 light, and 25d6 thunder dmg, or half as much on a succ. This deals triple dmg to objs and structs. The attuned creatures are both killed instantly and their corpses evaporate.",
                "[CURSE] If the above self-destruction process begins, the charm effect from above is triggered, but only turning the attuned creatures against each other."
            ]
        },
        {
            "name": "Sign of Broken Mirrors",
            "effects": [
                "The sign is a sentient chaotic evil ring with 21 INT, 24 WIS, and 24 CHA. It has hearing and darkvision out to 120'. It comms telepathically with its wearer, and can speak/read/understand Abyssal and Common.",
                "An insane Glabrezu demon named Ragazuu lives within the sign. The ring years to cause chaos. It learns its wearer's principles, then uses those ideals to encourage reckless action. It whispers ideas of revolution.",
                "You gain prof in Abyssal.",
                "On wep KB vs humanoid, Ragazuu remembers the target's appearance until the sign is attuned to a new creature.",
                "As an action, you can change your form to match any humanoid Ragazuu remembers. You can revert as an action, and you do so when you die.",
                "L11+: As an action, you can cast one of the following spells (DC 15, 1/LR each): Fabricate, Hallucinatory Terrain, Majro Image, or Phantasmal Killer."
            ]
        },
        {
            "name": "Ruin's Wake",
            "effects": [
                "The ring is a sentient chaotic evil item with 20 INT, 16 WIS, and 22 CHA. It has hearing and darkvision of 120', can communicate telepathically with its wearer, and can speak/read/understand Abyssal, Common, and Orcish.",
                "A slaughter-loving Balor demon named Yarrowish lives within the ring. It desires only to draw blood and pushes its wearer to solve problems with violence.",
                "You gain proficiency in Abyssal and Orcish.",
                "+1d8 P [L11+: +2d8] dmg to your wep hits.",
                "1/SR, as a reaction when you are hit by a melee atk, you can make a melee wep atk with adv against the atker.",
                "L11+: 1/LR, when you make a thrown wep atk, you can say 'ruina' to transform the proj into a bolt of lightning, forming a line that extends to a creature you can see within 120' of you. Each creature in the line must make a DC 15 DEX save, taking 8d6 light dmg on a failed save, or half as much dmg on a success."
            ]
        },
        {
            "name": "Teeth of Ronald Gascon",
            "effects": [
                "As an action, you can pull a tooth from the ring, rolling 1d20 on the following chart: https://5e.tools/items.html#teeth%20of%20dahlver-nar_tce . Each tooth can only be pulled once (round down when rolling a missing tooth).",
                "You may sow any tooth you pull from the ring. To do so, place it on the ground in an empty space within your reach, or throw it into an empty space within 10' of you in a body of water that is at least 50'x50'. Upon doing so, the tooth burrows into the ground or vanishes into the water, leaving no hole behind. The creatures in the Creatures Summoned column appear in an empty space as close to where the tooth was sown as possible. These are allies to you, speak all languages you speak, and linger for 10mins before disappearing, unless otherwise noted.",
                "Alternatively, you may implant any tooth you pull from the ring. To do so, place it in your mouth, causing one of your own teeth to fall out, and the new one takes its place, resizing to fit your mouth. Once implanted, you gain the effect from the Implanted Effect column. The tooth cannot be removed voluntarily. If removed after your death, the tooth vanishes. You can have a maximum number of the teeth implanted at once equal to 1 + your CON mod. If exceeded, the new tooth replaces one of the previous teeth randomly.",
                "Once all the teeth have been pulled from the ring, it vanishes. The ring then reforms will all its teeth in a random location at a random point on the Material Plane."
            ]
        },
        {
            "name": "Grovelthrash",
            "effects": [
                "Grovelthrash is a sentient, neutral evil ring with 18 INT, 15 WIS, and 19 CHA. It has hearing and darkvision of 120'. It communicates telepathically with its wearer and can speak, read, and understand Abyssal, Common, and Infernal.",
                "A covetous Ultraloth named Ciria lives within Grovelthrash. The ring values material possessions and doling out pain. It compliments its wearer whenever they claim treasure and takes pleasure in harming others.",
                "You gain prof in Abyssal and Infernal.",
                "You can have your melee wep hits deal +2d6 B dmg, but then you take 1d6 psy dmg.",
                "Your melee wep hits deal double dmg to objs and structs.",
                "You have adv on Insight checks made to discern a lie spoken in a language you understand.",
                "L11+: You gain an burrowing speed equal to your speed. You can use this speed to move through ice.",
                "L11+ 1/LR, when a creature you can see within 30' of you hits you with an atk, you can react to deal an amount of psy dmg to the atker equal to the dmg you took from the atk."
            ]
        },
        {
            "name": "Silken Spite",
            "effects": [
                "Silken Spite is a sentient, chaotic evil ring with 13 INT, 15 WIS, and 15 CHA. It has hearing and darkvision of 120'. It communicates telepathically with its wearer and can speak, read, and understand Abyssal, Common, Elvish, and Undercommon.",
                "[CURSE] A murderous Yochlol named Sinnafex lives within Silken Spite. The ring speaks in whispers, pushing its wearer to trust no one and to kill those who cause the slightest personal offence.",
                "You gain prof in Abyssal, Elvish, and Undercommon.",
                "You gain +60' darkvision.",
                "As an action, you can coat your weapon in poison until it scores a hit. That hit forces its target to make a DC 13 (L11+: DC 15) CON save or become psn'd for 1hr. On a sub fail, it is also uncon until it takes dmg or is woken as an action.",
                "You can walk on vertical surfaces and upside down.",
                "You gain climbing sp equal to your sp.",
                "You cannot be caught in webs of any sort and can move through them as if they were diff terrain.",
                "L11+: As an action, you can cast each of the following spells 1/LR each (DC 15): Cloudkill, Darkness, Levitate, or Web."
            ]
        },
        {
            "name": "Band of the Wanderer",
            "effects": [
                "[CURSE] Every month, your alignment shifts one grid space towards chaotic neutral, and you become more and more compelled to engage with and explore the most dangerous planes.",
                "The band has 7 charges, 1d4 + 4 of which are recovered after a LR.",
                "As an action, you can expend charges to cast one of the following spells (DC 17): Contact Other Plane (3 charges), Demiplane (6 charges), Gate (7 charges), Plane Shift (5 charges), or Teleportation Circle (3 charges)."
            ]
        },
        {
            "name": "Baba Yaga's Ring",
            "effects": [
                "You can swap this ring between visible or invisible at will as a free action.",
                "The ring has 12 charges, all of which are recovered after a LR.",
                "On melee wep hit, you can expend up to 3 of the loop's charges to deal an additional 1d8 force dmg per charge expended."
            ]
        }
    ]
}