{
    "uncommon": [
        {
            "name": "Ring of the Adder",
            "effects": [
                "As a bonus action, you can say 'Coluber' to animate the ring's crest into a poisonous snake's head (counts as a minion) for 1 minute, or until you speak the command word again to revert it and recover all the minion's HP.",
                "As an atk from the Attack action, you can have the minion make a melee weapon atk with an AB equal to your prof bonus. On a hit, it deals 1d6 P and the target must pass a CON save DC 15 or take 3d6 psn.",
                "While animated, the minion can be attacked. It has 15 AC and 20 HP. If killed, the ring shatters and is destroyed."
            ]
        },
        {
            "name": "Amulet of Striding and Springing",
            "effects": [
                "You have a minimum of 30' speed.",
                "Your jump distance is tripled, though this does not increase your maximum travel distance."
            ]
        },
        {
            "name": "Ring of the Python",
            "effects": [
                "As an action, you can say 'Pythonidae' and throw the ring onto the ground within 10' of you. It becomes a Giant Constrictor Snake ( https://5e.tools/bestiary.html#giant%20constrictor%20snake_mm ) minion, until bonus action + speaking the command word again when it reverts to a ring in the minion's space and recovers all the minion's HP.",
                "You must be conscious to command the minion.",
                "If the minion is killed, it reverts to ring form, which is then shattered and destroyed."
            ]
        },
        {
            "name": "Ring of Warmth",
            "effects": [
                "You have 50% resistance to cold damage.",
                "You and everything you wear and carry are unharmed by extreme cold climates."
            ]
        },
        {
            "name": "Ring of Vengeance",
            "effects": [
                "+1 global damage.",
                "[CURSE] While attuned, you become unwilling to part with the ring, keeping it on your person at all times. You have disadvantage on attack rolls while not wearing the ring.",
                "[CURSE] While worn, whenever you are damaged by a creature, pass a WIS save (DC 15) or you must attempt to use your movement and actions each turn to make a melee weapon attack against the creature that damaged you until either you or it drops to 0 hit points, or until you cannot reach the creature to make the attack in a turn.",
                "[CURSE] Curse can be broken with Banishment spell in addition to usual methods, forcing the vengeful spirit to leave."
            ]
        },
        {
            "name": "Amulet of the Winterlands",
            "effects": [
                "You have 50% resistance to cold damage.",
                "You ignore difficult terrain from ice/snow.",
                "You are unharmed by extreme cold climates."
            ]
        },
        {
            "name": "Amulet of the Sewers",
            "effects": [
                "While attuned, all rats are indifferent toward you and will not attack you unless you threaten or harm them.",
                "The amulet has 3 charges, 1d3 of which are restored whenever you finish a long rest.",
                "As an action, can squeeze the amulet and expend a charge to cause a Swarm of Rats (https://5e.tools/bestiary.html#swarm%20of%20rats_mm) to fall out from your other hand. The swarm is not a minion.",
                "Whenever a Swarm of Rats that isn't under another creature's control is within 30' of you, you can make a CHA check contested by the swarm's WIS check. If you succeed, the swarm becomes your minion for as long as your maintain this effect as an action each turn. If either you lose control of the swarm or it succeeds the contested check, it is immune to these effects for 24hrs."
            ]
        },
        {
            "name": "Ring of Fish Command",
            "effects": [
                "The ring has 3 charges, 1d3 of which are restored whenever you finish a long rest.",
                "By expending 1 charge as an action, you can cast Dominate Beast (DC 15) on any creature that has an innate swim speed."
            ]
        },
        {
            "name": "Signet of P'all",
            "effects": [
                "The ring has 3 charges, 1d3 of which are restored whenever you finish a long rest.",
                "By expending 1 charge as an action, you can cast Charm Person (DC 13).",
                "Aside from its magical properties, the ring is an indicator of P'all's recognition and favour."
            ]
        },
        {
            "name": "Ring of Jumping",
            "effects": [
                "You can cast Jump as a bonus action at-will, but can only target yourself when you do so."
            ]
        },
        {
            "name": "Periapt of Wound Closure",
            "effects": [
                "You stabilise whenever you start your turn dying.",
                "Double the amount of HP you heal from hit dice."
            ]
        }
    ],
    "rare": [
        {
            "name": "Sunforged Amulet",
            "effects": [
                "As an action, you can throw the amulet up to 120' to a point you can see. When it reaches that point, it erupts in an explosion. Each creature within 20' of the point must make a DC 15 DEX save, taking 6d6 fire dmg on a failed save, or half as much otherwise. Afterwards, you can use an action to cause the amulet to reappear around your neck. You cannot cause it to explode again until you finish a short or long rest. This counts as a throwing attack.",
                "If you have not recalled the amulet back to you 24hrs after throwing it, it reforms at the point where it exploded and you lose your attunement to it."
            ]
        },
        {
            "name": "Ring of X-ray Vision",
            "effects": [
                "As an action, you can say 'Transparere'. For 1 minute afterwards, if you look through the ring, you can see into and through solid matter. This vision extends for 30'. To you, solid objs within that range appear transparent and do not prevent light from passing through them. The vision penetrates 1 foot of stone, 1 inch of common metal, or up to 3 feet of wood or dirt. Anything thicker blocks the vision, as does any amount of lead."
            ]
        },
        {
            "name": "Ring of Force Resistance",
            "effects": [
                "You have 50% resistance force damage."
            ]
        },
        {
            "name": "Molten Bronze Skin",
            "effects": [
                "While attuned, the bronze coats your entire body. You have 50% resistance to fire damage."
            ]
        },
        {
            "name": "Devotee's Amulet",
            "effects": [
                "Whenever you hit with a weapon attack, the attack deals 1d8 additional radiant damage.",
                "As a bonus action once per long rest, you can say 'Devotio'. For 1 minute afterwards, the amulet emanates a thin cloud of incense out to 10'. At the start of each of your turns, you and any other creatures in the incense each regain 1d4 hit points."
            ]
        },
        {
            "name": "Mind Loop",
            "effects": [
                "Whenever you hit with a weapon attack, the attack deals 2d4 additional psychic damage.",
                "Any creature that takes psychic damage from your weapon attacks must succeed on a DC 15 WIS save or had disadvantage on INT, WIS, and CHA saves for 1 minute, or until it passes a passive save."
            ]
        },
        {
            "name": "Amulet of Building",
            "effects": [
                "You can cast Mending as an action.",
                "You can touch the amulet as a reaction when an obj or structure you can see within 300' of you takes dmg, causing it to be imm to that dmg and any further dmg of the same type until the start of your next turn.",
                "You can touch the amulet as an action to cast Fabricate, Move Earth, Passwall, or Summon Construct, and that spell canot be cast from the cape again until you finish a long rest."
            ]
        },
        {
            "name": "Amulet of Rulership",
            "effects": [
                "Once per long rest, as an action, you may present the amulet and command obedience from each creature of your choice that you can see within 120'. Each target must succeed on a DC 15 WIS save or be charmed by you for 8hrs, or until it is harmed by you or your companions, or commanded to do something contrary to its nature.",
                "While a creature is charmed by this amulet, it regards you as its trusted leader."
            ]
        }
    ],
    "very rare": [
        {
            "name": "Amulet of Fire Giant Strength",
            "effects": [
                "Your Strength is always equal to 25."
            ]
        },
        {
            "name": "Piercer [ring]",
            "effects": [
                "You regain the maximum possible number of hit points from expended hit dice.",
                "[CURSE] You have disadvantage on Journey activity checks."
            ]
        },
        {
            "name": "Brass Dragon Amulet",
            "effects": [
                "+1 AC.",
                "You have adv on saves against the Frightful Presence and breath weapons of dragons.",
                "You have 50% resistance to fire dmg.",
                "1/LR, as an action, you can magically discern the distance and direction of the nearest brass dragon within 30 miles of you."
            ]
        },
        {
            "name": "Ring of Frost Giant Strength",
            "effects": [
                "Your Strength is always equal to 23."
            ]
        }
    ],
    "legendary": [
        {
            "name": "Ring of Djinni Summoning",
            "effects": [
                "You can say 'Jinn' as an action to summon a particular Djinni from the Elemental Plane of Air. It appears in an unoccuddd space you choose within 120' of you, and remains as long as you concentrate, to a maximum of 1hr, or until it drops to 0 HP. It then returns to its home plane. If it returned above 0 HP, it cannot be summoned again for 24hrs. Otherwise, the ring becomes mundane.",
                "While summoned, the Djinni is friendly to you and your companions. It obeys any commands you give it, no matter what language you use. If you fail to command it, the Djinni defends itself against attackers but takes no other actions."
            ]
        },
        {
            "name": "Ring of Invulnerability",
            "effects": [
                "You have resistance to non-magical dmg.",
                "Once per long rest, you can use an action to make yourself immunte to non-magical dmg for 10mins."
            ]
        },
        {
            "name": "Stormclasp",
            "effects": [
                "You have 50% resistance to light and thunder dmg.",
                "Your Strength is always equal to 21 [L11+: 23], unless it would usually be higher.",
                "1/LR, as an action, you may become a Storm Avatar for 1min, gaining the following benefits: immunity to light and thunder dmg; when you hit with a wep atk that normally deals B dmg, it deals thunder instead. P and S are similarly converted to light; As a bonus action, you can choose 1 creature you can see within 30' to be struck by lightning, forcing them to pass a DC 15 DEX save or take 3d6 [L11+: 4d6] light, or half as much on a success.",
                "L11+: While transformed into a Storm Avatar, you gain 30' of fly speed and can hover."
            ]
        },
        {
            "name": "Ascendant Dragon-Touched Focus [ring]",
            "effects": [
                "You have adv on init rolls.",
                "Your weapons gain the Conduit trait.",
                "If your name starts with A-->I, whenever you use a spell slot to cast a spell that deals acid, cold, fire, light, or psn dmg, roll a d6, and you gain a bonus equal to the number rolled to one of the spell's dmg rolls.",
                "If your name starts with A-->I, you can cast Hold Monster and Rime's Binding Ice, each once per long rest.",
                "If your name starts with J-->R, whenever you use a spell slot to cast a spell, you can immediately teleport to an unoccupied space you can see within 15' of you.",
                "If your name starts with J-->R, you can cast Rary's Telepathic Bond and Raulothim's Psychic Lance, each once per long rest.",
                "If your name starts with S-->Z, whenever a creature you can see within 30' of you makes a save, you can use your reaction to give that creature adv on the save.",
                "If your name starts with S-->Z, you can cast Fizban's Platinum Shield and Legend Lore, each once per long rest.",
                "1/LR, when casting a lvl'd spell, you can treat the spell as if it were cast using a 9th-lvl spell slot."
            ]
        }
    ],
    "artifact": [
        {
            "name": "Ring of the Black Crown",
            "effects": [
                "The ring is a sentient lawful evil object with INT 20, WIS 12, and CHA 18. It has hearing and darkvision of 120'. It communicates telepathically with its wearer and is prof in common + infernal.",
                "A greedy Erinyes named Xartaza lives within the ring. She wants to recruit more souls for Asmodeus, so the ring pushes its wearer toward lawful evil actions by manipulating their dreams. A former war general, Xartaza hates demons and Mensis, and relishes crafting sound battle plans in any conflict.",
                "You gain prof in Infernal.",
                "As a bonus action, you can say 'Xartaza' to cause the ring to erupt into flame, shedding bright/dim light for 40'/40'. While ablaze, your wep hits deal 1d6 (L11+: 2d6) additional fire dmg. Flames last until you use another bonus action or are no longer wearing the ring.",
                "1/LR, as action, can summon Imp (L11+: Bearded Devil) minion that lasts 10mins.",
                "L11+: You have 50% resistance to psn dmg."
            ]
        },
        {
            "name": "Dekella, Ring of Thassa",
            "effects": [
                "Thassa's ring thrums with the icy currents of the deep ocean. Whenever you hit with a wep atk, the target takes an additional 2d10 cold dmg.",
                "If you devote yourself spiritually to Thassa, you can breathe underwater and gain a swimming speed of 60'.",
                "If you do not devote yourself spiritually to Thassa, you have -1 global AB and -1 to your DCs.",
                "1/LR, as an action, you can change the condition of the sea within 1 mile of you, creating strong winds and heavy rain that cause violent waves or calming a storm. In either case, the unnatural weather lasts 1hr before returning to normal.",
                "1/LR, you can cast Dominate Monster (DC 18), but only on beasts and monstrosities with an innate swim speed.",
                "1/LR, you can case True Polymorph (DC 18), but you must cast it on a creature to turn it into a kind of creature that has an innate swim speed."
            ]
        },
        {
            "name": "Amulet of Iggwilv",
            "effects": [
                "The amulet has 8 charges, of which it recovers 1d8 at the end of each long rest.",
                "As an action, you may cast Hideous Laughter (DC 20).",
                "You may expend charges from the amulet to cast any of the following spells (all DC 20): Magic Circle (1 charge), Magic Jar (3 charges), Planar Ally (3 charges), Planar Binding (2 charges), Plane Shift (to the Infinite Rooms of the Black Cathedral only; 3 charges), or Summon Fiend (Demon only; 3 charges)",
                "Whenever you make an Intelligence check to discern information about demons or a Survival check related to the Black Cathedral, you can add double your prof bonus to the check.",
                "When you make a dmg roll for a spell you cast against a fiend, you use the maximum possible result instead of rolling.",
                "Whenever you cast Magic Circle and only name fiends, or Planar Binding targeting a fiend, the spell is upcast to 9th lvl. Additionally, the fiend has disadvantage on its save against the spell.",
                "As an action once per long rest, you can target a fiend you can see that is trapped within a Magic Circle. It must pass a DC 20 CHA save with disadvantage or become trapped within the amulet. You know a creature's widely-known name and its depravities while it is trapped.",
                "Whenever you finish a long rest, the creature trapped in the amulet of the highest CR can attempt to possess you. You must pass a DC 20 CHA save, or are possessed by the creature, which controls you completely. The possessing creature can release you as an action, appearing in the closest unoccupied space. On a successful save, that creature cannot attempt to possess you for 7 days.",
                "When you first find the amulet, it already contains 1d4 random demons."
            ]
        },
        {
            "name": "Ring of Vecna",
            "effects": [
                "[CURSE] When you attune to the ring, your left eye rots away and falls out. You can see out of the ring.",
                "[CURSE] If you unattune from the ring, you die.",
                "[CURSE] Your Alignment changes to Neutral Evil.",
                "You have truesight.",
                "As an action, you can see into and through solid matter until you end the effects as a bonus action. This vision has a radius of 30', and can penetrate 1 foot of stone, 1 inch of common metal, and 3 feet of wood/dirt. Lead cannot be seen through.",
                "The ring has 8 charges. 1d4 + 4 charges are recovered at the end of a long rest.",
                "You can expend charges as an action to cast any of the following spells (DC 18): Clairvoyance (2 charges), Crown of Madness (1 charge), Disintegrate (4 charges), Dominate Monster (5 charges), or Eyebite (4 charges).",
                "[CURSE] Whenever you cast a spell from this ring, there is a 5% chance that Vecn tears your soul from your body, devours it, and takes control of your body. You become an NPC under the DM's control.",
                "Whenever you finish a long rest, the creature trapped in the amulet of the highest CR can attempt to possess you. You must pass a DC 20 CHA save, or are possessed by the creature, which controls you completely. The possessing creature can release you as an action, appearing in the closest unoccupied space. On a successful save, that creature cannot attempt to possess you for 7 days.",
                "When you first find the amulet, it already contains 1d4 random demons."
            ]
        }
    ]
}