[
    {
        "name": "Cloning",
        "description": "replace random affix with exact copy of another random affix. Item must be chosen first."
    },
    {
        "name": "Scourging",
        "description": "add random negative affix, then min equivalent-value positive affix."
    },
    {
        "name": "Combination",
        "description": "the affixes of 2 chosen items are randomly distributed across the 2 items, ignoring base limitations. Items must be chosen first."
    },
    {
        "name": "Fate",
        "description": "reroll a random affix, retaining the original affix's point value as the minimum point value for the new affix. Item must be chosen first."
    },
    {
        "name": "Empowerment",
        "description": "randomly apply 1 upgrade point; if impossible, adds new random affix. Item must be chosen first."
    },
    {
        "name": "Enhancement",
        "description": "Add new random affix"
    },
    {
        "name": "Attunement",
        "description": "Turn any non-relic into a relic, dynamically building thematic affixes as needed"
    },
    {
        "name": "Learning",
        "description": "Instantly level one of your relic slots or one of your attuned items; reroll if none in party"
    },
    {
        "name": "Negation",
        "description": "Random affix is negated, resultant points are distributed randomly. Item must be chosen first."
    },
    {
        "name": "Brittleness",
        "description": "Body armour gets -1 AC and random hard-tripled enchant added to its base item"
    },
    {
        "name": "Experimentation",
        "description": "A random affix evolves into its experimental form [prompt = 'Design a homebrew $class archetype for dungeons & dragons 5th edition inspired by a magic item with the following properties:']. The same affix will always evolve into the same effect. Item must be chosen first."
    },
    {
        "name": "Scouring",
        "description": "A random affix is rerolled into a new crafted affix of a chosen Affinity, ignoring the point value of the original affix. Item must be chosen first."
    }
]