[
    {
        "name": "Cloning",
        "description": "replace random affix with exact copy of another random affix. Item must be chosen first."
    },
    {
        "name": "Scourging",
        "description": "add random negative affix, then min equivalent-value positive affix."
    },
    {
        "name": "Combination",
        "description": "the affixes of 2 chosen items are randomly distributed across the 2 items, ignoring base limitations. Items must be chosen first."
    },
    {
        "name": "Fate",
        "description": "reroll a random affix, retaining the original affix's point value as the minimum point value for the new affix. Item must be chosen first."
    },
    {
        "name": "Empowerment",
        "description": "randomly apply 1 upgrade point; if impossible, adds new random affix. Item must be chosen first."
    },
    {
        "name": "Enhancement",
        "description": "Add new random affix"
    },
    {
        "name": "Attunement",
        "description": "Turn any non-relic into a relic, dynamically building thematic affixes as needed"
    },
    {
        "name": "Learning",
        "description": "Instantly level one of your relic slots or one of your attuned items; reroll if none in party"
    },
    {
        "name": "Negation",
        "description": "Random affix is negated, resultant points are distributed randomly. Item must be chosen first."
    },
    {
        "name": "Brittleness",
        "description": "Body armour gets -1 AC and random hard-tripled affix added to its base item"
    },
    {
        "name": "Scouring",
        "description": "A random affix is rerolled into a new crafted affix with the $affinity Affinity, ignoring the point value of the original affix. Item must be chosen first."
    },
    {
        "name": "Customisation",
        "description": "Adds a new crafted affix of the $affinity Affinity."
    },
    {
        "name": "Synergy",
        "description": "Choose two items. A random affix from a random one of them is copied onto the other item, at its lowest point value (ignoring polarity). Items must be chosen first."
    },
    {
        "name": "Adventure",
        "description": "A dormant, unknown affix of the $affinity Affinity is added to an item, with a minimum point value of 2. It is revealed and unlocked the next time you complete a random mission (chosen now)."
    },
    {
        "name": "Refinement",
        "description": "A random affix is rerolled into a new crafted affix of an Affinity based on the rough Affinities of the original affix. The item must be chosen first."
    },
    {
        "name": "Blunting",
        "description": "A non-conduit weapon has its dmg die size reduced by 1 and gains a random hard-doubled affix added to its base item."
    },
    {
        "name": "Optimisation",
        "description": "An item with at least two affixes has a random one of its highest point-value affixes tiered up, and a respective number of points removed randomly from the other affixes on the item. The item must be chosen first."
    },
    {
        "name": "Absorption",
        "description": "A body armour gains a random weapon affix that only applies to the powers of crystals socketed inside it."
    },
    {
        "name": "Modification",
        "description": "A non-conduit weapon has its dmg die size reduced by 1 and gains a random trait that it didn't already have added to its base item."
    },
    {
        "name": "Fine-Tuning",
        "description": "A random affix on the item is chosen and you can change one Aspect of it. The item must be chosen first."
    }
]