[
    {
        "name": "Equipped Summons",
        "target": "powers that summon minions",
        "description": "The minions gain the affixes of your $equipSlot.",
        "meta": "manifest armour"
    },
    {
        "name": "Shredding Summons",
        "target": "powers that summon minions",
        "description": "When the minions hit with melee atks, their target gets slightly increased phys dmg taken until the end of the minion's next turn."
    },
    {
        "name": "Berserking Summons",
        "target": "powers that summon minions that can take phys dmg",
        "description": "The minions deal substantially more damage, but have slightly less HP and barely increased phys dmg taken."
    },
    {
        "name": "Exsanguinating Summons",
        "target": "powers that summon minions",
        "description": "When the minions hit with melee atks dealing $physType dmg, their target is inflicted with a DoT dealing slightly less {physType} dmg, stacking until CON save (minion's DC)."
    },
    {
        "name": "Phlebotomising Summons",
        "target": "powers that summon minions",
        "description": "The minions deal more $physType damage over time."
    },
    {
        "name": "Sapping Summons",
        "target": "powers that summon minions",
        "description": "When the minions are hit, the offender has their speed halved until CON save (minion's DC)."
    },
    {
        "name": "Charging Summons",
        "target": "powers that summon minions",
        "description": "As an action, the minions can move up to their speed. During this movement, they can move through hostile creatures' spaces. For each creature they move through, they may attack them, dealing slight dmg as $physType on a hit and pushing them 5' in a direction of their choice."
    },
    {
        "name": "Rugged Summons",
        "target": "powers that summon minions",
        "description": "The minions gain +1 to saves vs debuffs."
    },
    {
        "name": "Taunting Summons",
        "target": "powers that summon minions",
        "description": "At the end of the minions' turns, all adj creatures of their choice are taunted by the minion until the end of the minion's next turn."
    },
    {
        "name": "Whirling Summons",
        "target": "powers that summon minions",
        "description": "1/combat, as an action, the minions can move up to half their speed. During this movement, they can move through hostile creatures' spaces. For each creature they either move through or through an adj space of, they may make a melee wep atk against them, dealing slightly less $physType dmg on a hit."
    },
    {
        "name": "Empowered Summons",
        "target": "powers that summon minions",
        "description": "The minions add $nonPhysType dmg to their hits."
    },
    {
        "name": "Decaying Summons",
        "target": "powers that summon minions",
        "description": "When the minions hit with melee atks, their target is inflicted with a DoT dealing slight $nonPhysType dmg, stacking until DEX save (minion's DC)."
    },
    {
        "name": "Dracotouched Summons",
        "target": "powers that summon minions",
        "description": "1/combat, as an action, the minions breathe a cone of magical energy in a 15' cone, making a spell atk against all foes inside, dealing less dmg as $nonPhysType on a hit."
    },
    {
        "name": "Destructive Summons",
        "target": "powers that summon minions",
        "description": "The limited powers of the minions deal slightly more dmg and have slightly larger AoE sizes."
    },
    {
        "name": "Overcharged Summons",
        "target": "powers that summon minions",
        "description": "The limited powers of the minions have their cooldowns increased by 1 step, but inflict a DoT dealing $nonPhysType dmg, stacking until DEX save (minion's DC), on hit"
    },
    {
        "name": "Reflective Summons",
        "target": "powers that summon minions",
        "description": "The minions gain a massive amount of dmg thorns."
    },
    {
        "name": "Regenerating Summons",
        "target": "powers that summon minions",
        "description": "The minions gain barely any passive regen."
    },
    {
        "name": "Bulky Summons",
        "target": "powers that summon minions",
        "description": "The minions gain more maximum hit points."
    },
    {
        "name": "Reparable Summons",
        "target": "powers that summon minions",
        "description": "The minions gain a slight amount of incoming healing."
    },
    {
        "name": "Solid Summons",
        "target": "powers that summon minions",
        "description": "The minions gain slightly more dmg for each phys dmg type they are either resistant or immune to."
    },
    {
        "name": "Efficiency",
        "target": "powers that can deal dmg and have a non-cooldown resource cost",
        "description": "The power's cost is 1 step lower, but it deals less dmg.",
        "meta": "glacier (start breaking point)"
    },
    {
        "name": "Massive Power",
        "target": "powers that have multiple areas",
        "description": "The power's largest area deals substantially more dmg."
    },
    {
        "name": "Assassination",
        "target": "powers that can deal dmg",
        "description": "The power deals more dmg against bosses."
    },
    {
        "name": "Focused Power",
        "target": "powers that have multiple areas",
        "description": "The power's smallest area deals substantially more dmg."
    },
    {
        "name": "Spread Power",
        "target": "powers that have multiple areas",
        "description": "The power deals more AoE dmg."
    },
    {
        "name": "Focused Area",
        "target": "powers that have multiple areas",
        "description": "The power's areas all conform to the same shape and area as one of the original areas of your choice, but it no longer deals any extra crit dmg."
    },
    {
        "name": "Keen Shielding",
        "target": "powers that can crit",
        "description": "Whenever the power crits, you gain temp HP."
    },
    {
        "name": "Dull Criticals",
        "target": "powers with an atk roll",
        "description": "The power has +3 crit range, but no longer deals any extra crit dmg."
    },
    {
        "name": "Keen Recovery",
        "target": "powers that have a non-cooldown resource cost and can deal damage",
        "description": "Whenever the power crits, its resource cost is refunded. The power deals less dmg."
    },
    {
        "name": "Murderous Recovery",
        "target": "powers that have a non-cooldown resource cost",
        "description": "Whenever the power scores a killing blow, 1 step of its resource cost is refunded."
    },
    {
        "name": "Dull Infliction",
        "target": "powers that can deal dmg and can apply debuffs",
        "description": "The power deals less dmg, but any debuffs it can apply have +2 to their DCs."
    },
    {
        "name": "Sapping",
        "target": "powers that can hit",
        "description": "Whenever the power hits, the target becomes sluggish until the end of your next turn."
    },
    {
        "name": "Focused Sapping",
        "target": "powers that have multiple areas that can hit",
        "description": "Whenever the power's smallest area hits, the target becomes sluggish until the end of your next turn."
    },
    {
        "name": "Cruelty",
        "target": "powers that can deal dmg and can apply debuffs",
        "description": "Any debuffs the power can apply have +1 to their DCs, and the power deals slightly more dmg to debuffed targets."
    },
    {
        "name": "Massive Infliction",
        "target": "powers that have multiple areas that can hit",
        "description": "Whenever the power's largest area hits, it deals more dmg and the target becomes sluggish until the end of your next turn."
    },
    {
        "name": "Spread Infliction",
        "target": "powers that have multiple areas that can hit",
        "description": "Whenever the power hits, it deals slightly more dmg and the target become sluggish until the end of your next turn."
    },
    {
        "name": "Whirling Energy",
        "target": "powers that have a non-persistent area",
        "description": "After the area resolves, it leaves a vortex of energy, a pers area that lasts until the end of your next turn, making spell atks that deal slight $nonPhysType dmg."
    },
    {
        "name": "Lingering Infliction",
        "target": "any power",
        "description": "If you have used the power since the start of your last turn, your DoTs deal barely more dmg and your debuff DCs have a +1 bonus."
    },
    {
        "name": "Focused Whirling",
        "target": "powers that have multiple non-persistent areas",
        "description": "Whenever the power's smallest area resolves it leaves a vortex of energy, a pers area that lasts until the end of your next turn, making spell atks that deal $nonPhysType dmg."
    },
    {
        "name": "Persistent Mass",
        "target": "powers that create persistent areas",
        "description": "The power's persistent areas have slightly more dmg and slightly more area."
    },
    {
        "name": "Massive Energy",
        "target": "powers that have multiple non-persistent areas",
        "description": "Whenever the power's largest area resolves it leaves a vortex of energy, a pers area that lasts until the end of your next turn, making spell atks that deal slight $nonPhysType dmg. Additionally, any buffs triggered from the power have +1 effectiveness."
    },
    {
        "name": "Spread Energy",
        "target": "powers that have multiple non-persistent areas",
        "description": "Whenever the power's areas resolve, they leave vortices of energy, pers areas that last until the end of your next turn, making spell atks that deal barely any $nonPhysType dmg. Additionally, any buffs triggered from the power have their durations increased by 1 step."
    },
    {
        "name": "Focused Efficiency",
        "target": "powers that have multiple areas and a non-cooldown resource cost",
        "description": "The power's cost is 1 step lower, but its largest area deals substantially less dmg."
    },
    {
        "name": "Major Spread",
        "target": "powers that have multiple areas and a non-cooldown resource cost",
        "description": "The power's areas deal massively more dmg, but its cost is 1 step higher."
    },
    {
        "name": "Keen Power",
        "target": "powers that make atk rolls",
        "description": "The power deals barely more dmg and has +1 crit range.",
        "meta": "ice barrage"
    },
    {
        "name": "Slow Power",
        "target": "powers that deal dmg",
        "description": "The power deals substantially more dmg, has +1 Accuracy, and has its usage time increased by 1 action step."
    },
    {
        "name": "Fragmentation",
        "target": "powers that fire non-piercing projectiles",
        "description": "Whenever the power's projs hit, they explode in a 15' cone originating from the opposite side of the target. The cone makes a spell atk against all foes, dealing slight $nonPhysType dmg on a hit."
    },
    {
        "name": "Focused Energy",
        "target": "powers with a cooldown and a non-instantaneous duration",
        "description": "The power deals more dmg and its cooldown is reduced by 1 step, but its duration is reduced by 1 step."
    },
    {
        "name": "Slow Splitting",
        "target": "powers with a non-cooldown resource cost that fire projectiles",
        "description": "The power fires 3 additional projs, each aiming 45 degrees in a different direction of your choice from the original projs, but its usage time is increased by 1 action step, its resoure cost is increased by 1 step, and it deals less dmg."
    },
    {
        "name": "Spread",
        "target": "powers with cone areas",
        "description": "The power's cones are 5' wider at all distances."
    },
    {
        "name": "Piercing",
        "target": "powers that fire projectiles",
        "description": "The power's projectiles are converted to line AoEs but it deals less dmg."
    },
    {
        "name": "Decaying Penetration",
        "target": "powers with line areas",
        "description": "Each creature hit by the power's lines gets a DoT dealing slight $nonPhysType dmg, stacking until CON save."
    },
    {
        "name": "Endurance",
        "target": "powers with non-instantaneous durations that can deal damage",
        "description": "The power's duration increases by 1 step, but it deals less dmg."
    },
    {
        "name": "Clumsy Power",
        "target": "powers that have Accuracy components",
        "description": "The power deals substantially more dmg but has -1 Accuracy."
    },
    {
        "name": "Building Assassination",
        "target": "powers that can hit",
        "description": "Whenever the power hits a boss, it gains dmg for the remainder of its duration."
    },
    {
        "name": "Building Power",
        "target": "powers with non-instantaneous durations",
        "description": "Each turn of the power's duration, it gains slightly more dmg."
    },
    {
        "name": "Unstable Speed",
        "target": "powers that do not require concentration and can deal damage",
        "description": "The power's usage time is reduced by 2 action steps, but it now requires concentration and deals less dmg."
    },
    {
        "name": "Swift Channelling",
        "target": "powers that require reactivation each round and can deal damage",
        "description": "The power's reactivation time is reduced by 1 action step, but it now deals less dmg."
    },
    {
        "name": "Shielding",
        "target": "powers that can hit",
        "description": "Whenever the power hits, you gain temp HP."
    },
    {
        "name": "Tiring Exertion",
        "target": "powers with non-instantaneous durations that can deal damage",
        "description": "For the power's duration, you project a 5' aura that inflicts sluggish on foes until the end of their turn, but the power deals less damage."
    },
    {
        "name": "Intensity",
        "target": "powers with non-instantaneous durations",
        "description": "The power deals massively more damage, but its duration is reduced by 1 step."
    },
    {
        "name": "Focused Channelling",
        "target": "powers with non-instantaneous durations that require reactivation each round",
        "description": "The power's reactivation time is reduced by 1 action step, but you have your speed halved for its duration."
    },
    {
        "name": "Charged Shielding",
        "target": "powers with a cooldown that can have targeted directions",
        "description": "If the power is directed at a non-self target, it projects a 10'-wide magical barrier for the combat that completely blocks projs, in the space in front of you in the targeted direction. The power's cooldown also increases by 1 step."
    },
    {
        "name": "Charged Obstacles",
        "target": "powers that form objs or structs and can deal dmg",
        "description": "Any objs or structs formed by the power have their durations extended by 2 steps, but the power's cooldown is increased by 1 step and it deals less damage."
    },
    {
        "name": "Empowering Obstacles",
        "target": "powers that form objs or structs",
        "description": "While an obj or struct formed by the power is active, you deal slightly more $nonPhysType dmg and have massively more {nonPhysType} barrier."
    },
    {
        "name": "Volatile Obstacles",
        "target": "powers that form objs or structs and can deal dmg",
        "description": "When an obj or struct formed by the power is destroyed, it erupts in a staggering explosion. All foes adj to the entity are staggered until the end of your next turn. The power deals massively less damage."
    },
    {
        "name": "Building Ailments",
        "target": "powers with non-instantaneous durations that deal damage",
        "description": "For each turn of the power's duration, any debuffs it can apply have +1 to their related DCs. The power deals less damage."
    },
    {
        "name": "Explosive Power",
        "target": "powers that can hit",
        "description": "Whenever the power hits, a nova erupts from the target, attacking all foes within 5' of the target (including them), dealing 1d4 $nonPhysType spell dmg on a hit. The power deals substantially less dmg."
    },
    {
        "name": "Ailments",
        "target": "any power",
        "description": "Any debuffs the power can apply have +1 to their related DCs."
    },
    {
        "name": "Empowering Ailments",
        "target": "any power",
        "description": "Whenever the power inflicts a debuff, you deal more spell dmg until the end of your next turn."
    },
    {
        "name": "Sudden Eruption",
        "target": "powers that require reactivation each round and do not have a cone area",
        "description": "The power's duration is now instantaneous and only activates on casting, but now affects a cone area with length equal to the original range or area length. It also deals substantially more dmg."
    },
    {
        "name": "Inflicting Eruption",
        "target": "powers with cone areas",
        "description": "Any debuffs the power can apply have +1 to their related DCs, and the power deals barely more dmg."
    },
    {
        "name": "Cruel Power",
        "target": "any power",
        "description": "The power deals more dmg to debuffed targets."
    },
    {
        "name": "Keen Cruelty",
        "target": "any power",
        "description": "The power has +1 crit range against debuffed targets."
    },
    {
        "name": "Speed",
        "target": "powers that can deal dmg",
        "description": "The power's usage time is reduced by 1 step, but it deals less dmg.",
        "meta": "fireball"
    },
    {
        "name": "Focused Speed",
        "target": "powers that have multiple individual targets",
        "description": "The power's usage time is reduced by 1 step and it deals slightly more dmg for each additional individual target it has above 1, but it now only has 1 individual target."
    },
    {
        "name": "Channelling",
        "target": "powers with an instantaneous duration and a non-self/melee range",
        "description": "The power's duration becomes 'Concentration, up to 1 minute', and you can reactivate its effect as its usage time throughout the duration. Its range is also halved."
    },
    {
        "name": "Overcharged Penetration",
        "target": "powers with a non-cooldown resource cost that require concentration and fire projectiles",
        "description": "The power's projectiles are converted to 5'-wide line AoEs and deal more dmg, but its cost is increased by 1 step."
    },
    {
        "name": "Efficient Channelling",
        "target": "powers with a non-cooldown resource cost that require concentration and deal dmg",
        "description": "The power's cost is 1 step lower, but it deals less dmg."
    },
    {
        "name": "Protective Channelling",
        "target": "powers that require concentration",
        "description": "While concentrating on the power, you have substantially more phys barrier and massively more $nonPhysType barrier."
    },
    {
        "name": "Distance",
        "target": "powers with a non-self/melee range",
        "description": "The power's range is doubled."
    },
    {
        "name": "Shredding",
        "target": "any power",
        "description": "Whenever the power hits, the target takes increased $nonPhysType dmg until the end of your next turn."
    },
    {
        "name": "Unstable Focus",
        "target": "powers that have multiple individual targets",
        "description": "If all of the power's individual targets are the same, a burst of energy erupts around the target, making a spell atk against all foes within 5' of the target (including them), dealing slight $nonPhysType dmg."
    },
    {
        "name": "Reliable Explosions",
        "target": "powers with sphere areas that trigger from hits",
        "description": "The power's sphere areas still trigger even if the required effects do not hit."
    },
    {
        "name": "Telekinesis",
        "target": "powers that fire projectiles",
        "description": "The power's projectiles have +1 Accuracy."
    },
    {
        "name": "Infliction",
        "target": "any power",
        "description": "Whenever the power hits, the target is inflicted with a DoT dealing slight $nonPhysType dmg, stacking until DEX save."
    },
    {
        "name": "Spreading Decay",
        "target": "any power",
        "description": "Whenever the power hits, the target is inflicted with a DoT dealing barely any $nonPhysType dmg, stacking until DEX save. Whenever a creature fails to save out of this DoT, it spreads to all creatures of your choice adj to the afflicted creature."
    },
    {
        "name": "Powerful Decay",
        "target": "powers that inflict DoTs",
        "description": "The power's DoTs deal more dmg."
    },
    {
        "name": "Penetration",
        "target": "any power",
        "description": "The power ignores dmg res."
    },
    {
        "name": "Precision",
        "target": "powers that make atk rolls",
        "description": "The power has +1 crit range."
    },
    {
        "name": "Volatile Destruction",
        "target": "any power",
        "description": "Whenever the power hits, it deals slight additional $nonPhysType dmg. Additionally, its crits deal slightly more dmg."
    },
    {
        "name": "Distant Power",
        "target": "powers with a non-self/melee range",
        "description": "The power's range is doubled and it deals barely more dmg."
    },
    {
        "name": "Overcharged Eruption",
        "target": "powers with a non-cooldown resource cost that fire a single projectile",
        "description": "The power's proj is converted into a cone with a length equal to the proj's range and deals more dmg, but its cost is increased by 1 step."
    },
    {
        "name": "Keen Lag",
        "target": "powers that make atk rolls",
        "description": "The power has +3 crit range, but its usage time is increased by 1 step."
    },
    {
        "name": "Dull Debilitation",
        "target": "any power",
        "description": "The power can no longer crit, but whenever it usually would, it debilitates the target until CON save."
    },
    {
        "name": "Stacked Focus",
        "target": "powers with cone areas",
        "description": "The power's cone areas are now lines of the same length that activate twice over the same area, but its usage time is increased by 1 step."
    },
    {
        "name": "Blunt Power",
        "target": "powers with line areas",
        "description": "The power deals massively more dmg, but its line areas are converted to non-piercing projs with range equal to the line's length.",
        "meta": "marrow shards"
    },
    {
        "name": "Leeching Empowerment",
        "target": "any power",
        "description": "Whenever you deal $physType dmg having used the power since the start of your last turn, heal a slight amount of HP."
    },
    {
        "name": "Blunt Eruption",
        "target": "powers with line areas that have a non-cooldown resource cost",
        "description": "The power's line areas are converted to non-piercing projs with range equal to the line's length and deal less dmg, and its cost is increased by 1 step. Additionally, whenever these projs hit, they splinter into a 15' cone AoE from the other side of the target, a spell atk dealing massive phys dmg."
    },
    {
        "name": "Erupting Power",
        "target": "powers with cone areas",
        "description": "The power's cone areas deal more dmg."
    },
    {
        "name": "Massive Blasting",
        "target": "any power",
        "description": "The power's cone areas are longer."
    },
    {
        "name": "Erupting Exsanguination",
        "target": "powers with cone areas",
        "description": "Whenever the power's cone areas hit, the target is inflicted with a DoT dealing slight $physType dmg, stacking until CON save."
    },
    {
        "name": "Erupting Cruelty",
        "target": "powers with cone areas",
        "description": "The power's cone areas deal more dmg against debuffed targets."
    },
    {
        "name": "Keen Eruption",
        "target": "powers with cone areas that make atk rolls",
        "description": "The power's cone areas have +1 crit range."
    },
    {
        "name": "Destructive Eruption",
        "target": "powers with cone areas",
        "description": "The power's cone areas deal more crit dmg."
    },
    {
        "name": "Overcharged Splintering",
        "target": "powers with line areas and a non-cooldown resource cost",
        "description": "Whenever the power's line areas end, they release a 15' long cone from that point in the same direction as the line, a spell atk against foes dealing substantial $physType dmg. The power's line areas have their lengths halved and its cost is increased by 1 step."
    },
    {
        "name": "Targeted Conclusion",
        "target": "powers with line areas and a non-cooldown resource cost",
        "description": "The power's line areas are always of a length of your choice, up to their original length, and deal substantially more dmg. The power's cost is increased by 1 step."
    },
    {
        "name": "Close Power",
        "target": "powers with a non-self/melee range",
        "description": "The power deals substantially more dmg but its range is halved."
    },
    {
        "name": "Keen Destruction",
        "target": "powers that make atk rolls",
        "description": "The power has +1 crit range and deals barely more crit dmg."
    },
    {
        "name": "Destruction",
        "target": "any power",
        "description": "The power deals more crit dmg."
    },
    {
        "name": "Sacrificial Destruction",
        "target": "any power",
        "description": "The power deals substantially more crit dmg, but whenever it crits you lose a slight amount of HP."
    },
    {
        "name": "Keen Support",
        "target": "any power",
        "description": "If you have an active minion when you use the power, you gain +1 crit range until the end of your next turn. This does not stack."
    },
    {
        "name": "Overcharged Exsanguination",
        "target": "powers with a non-cooldown resource cost that can deal damage",
        "description": "Whenever the power hits, the target is inflicted with a DoT that deals substantial $physType dmg, stacking until CON save. The power's cost is increased by 1 step and it deals less dmg."
    },
    {
        "name": "Delayed Leeching",
        "target": "any power",
        "description": "Whenever the power hits, you heal HP at the start of your next turn."
    },
    {
        "name": "Healing",
        "target": "powers that heal",
        "description": "The power heals more HP."
    },
    {
        "name": "Efficient Healing",
        "target": "powers with a non-cooldown resource cost that heal",
        "description": "The power's cost is reduced by 1 step, but it heals less HP."
    },
    {
        "name": "Sacrificial Power",
        "target": "any power",
        "description": "If you have an active minion when you use the power, the power deals massively more dmg but kills all of your minions."
    },
    {
        "name": "Duplication",
        "target": "powers that can deal dmg",
        "description": "Whenever you use the power, it is used again at no additional cost, but its dmg is reduced."
    },
    {
        "name": "Reckless Power",
        "target": "powers with areas that can damage allies",
        "description": "The power deals substantially more dmg to foes, but massively more dmg to allies."
    },
    {
        "name": "Feasting",
        "target": "any power",
        "description": "Whenever you reduce an ally to 0 HP with the power, you heal HP."
    },
    {
        "name": "Bloodthirsty Empowerment",
        "target": "any power",
        "description": "Whenever you deal $physType dmg have delivered a KB with the power since the start of your last turn, heal a slight amount of HP."
    },
    {
        "name": "Keen Empowerment",
        "target": "any power",
        "description": "If you have delivered a KB with the power since the start of your last turn, you have +1 crit range."
    },
    {
        "name": "Armour Shredding",
        "target": "any power",
        "description": "Whenever the power hits, the target takes slightly increased phys dmg until the end of your next turn."
    },
    {
        "name": "Conversion",
        "target": "any power",
        "description": "The power's base dmg is converted to $nonPhysType and it deals more dmg.",
        "meta": "hail of arrows"
    },
    {
        "name": "Compounding Decay",
        "target": "powers that deal damage over time",
        "description": "Whenever the power's DoTs tick, it inflicts the target with a DoT dealing slight $nonPhysType dmg, stacking until CON save."
    },
    {
        "name": "Focused Endurance",
        "target": "powers with non-instantaneous durations that do not require concentration",
        "description": "The power's duration is increased by 1 step, but you can only have 1 instance of it active at a time."
    },
    {
        "name": "Channeled Endurance",
        "target": "powers with non-instantaneous durations that do not require concentration",
        "description": "The power now lasts for as long as you concentrate on it, and its usage time is reduced by 1 step."
    },
    {
        "name": "Slowing Decay",
        "target": "powers that deal damage over time",
        "description": "While a creature is affected by the power's DoT, it has its speed halved."
    },
    {
        "name": "Sluggish Slowing",
        "target": "powers that can reduce target speed",
        "description": "The power's speed reduction is converted to sluggish."
    },
    {
        "name": "Staggering Decay",
        "target": "powers that deal damage over time",
        "description": "While a creature is affected by the power's DoT, it is staggered. The power deals less dmg."
    },
    {
        "name": "Decaying Affliction",
        "target": "powers that deal damage over time",
        "description": "While a creature is affected by the power's DoT, it is staggered. The power also has +1 to its ongoing debuff DCs and deals substantially less dmg."
    },
    {
        "name": "Efficient Intensity",
        "target": "powers with a non-cooldown resource cost and non-instantaneous durations",
        "description": "The power's cost is 1 step lower and it deals more dmg, but its duration is reduced by 1 step."
    },
    {
        "name": "Decaying Exsanguination",
        "target": "powers that deal damage over time",
        "description": "Whenever the power's DoTs tick, it inflicts the target with a DoT dealing slight $physType dmg, stacking until CON save."
    },
    {
        "name": "Drifting",
        "target": "powers that create persistent areas",
        "description": "The power's persistent areas move 5' away from where you were when they were created at the start of each of your turns."
    },
    {
        "name": "Charged Intensity",
        "target": "powers with a cooldown and a non-instantaneous duration",
        "description": "The power can be used an additional time within its cooldown and deals more dmg, but its duration is reduced by 1 step."
    },
    {
        "name": "Slow Efficiency",
        "target": "powers with a cooldown and a non-cooldown resource cost",
        "description": "The power's cooldown and cost are both reduced by 1 step, and it deals more dmg, but its usage time is increased by 2 steps."
    },
    {
        "name": "Intense Power",
        "target": "powers with sphere areas",
        "description": "The power's sphere areas deal substantially more dmg, but its sphere areas have less radius."
    },
    {
        "name": "Leeching Decay",
        "target": "powers that deal damage over time",
        "description": "Whenever the power's DoTs tick, heal a slight amount of HP."
    },
    {
        "name": "Exposing Decay",
        "target": "powers that deal damage over time",
        "description": "Whenever the power's DoTs tick, the target grants incoming atks +1 crit range until the end of your next turn."
    },
    {
        "name": "Shredding Decay",
        "target": "powers that deal damage over time",
        "description": "Whenever the power's DoTs tick, the target takes slightly more phys dmg until the end of your next turn."
    },
    {
        "name": "Sapping Decay",
        "target": "powers that deal damage over time",
        "description": "Whenever the power's DoTs tick, the target's global dmg is slightly reduced until the end of its next turn."
    },
    {
        "name": "Explosive Area",
        "target": "powers with sphere areas",
        "description": "The power's sphere areas have more radius."
    },
    {
        "name": "Explosive Striking",
        "target": "powers with a non-cooldown resource cost",
        "description": "Whenever the power creates a sphere area, that area is also assaulted with a barrage of energy from above, making a wep atk against all foes within the sphere that deals $physType dmg. Also, the power deals more dmg and its cost is increased by 1 step."
    },
    {
        "name": "Explosive Rooting",
        "target": "any power",
        "description": "Whenever the power creates a sphere area, all foes in that area are rooted until end of their next turn. If an affected foe is a boss, it has its speed halved instead."
    },
    {
        "name": "Keen Explosions",
        "target": "powers with sphere areas that make atk rolls",
        "description": "The power's sphere areas have +1 crit range."
    },
    {
        "name": "Persistent Warding",
        "target": "any power",
        "description": "Whenever you end your turn within the power's pers areas, you gain a slight amount of dmg barrier and +1 to DEX saves until your next turn."
    },
    {
        "name": "Persistent Empowerment",
        "target": "any power",
        "description": "Whenever an ally ends their turn within the power's pers areas, they gain a slight amount of dmg barrier and +1 to DEX saves until their next turn. Also, the power deals substantially less dmg."
    },
    {
        "name": "Striking",
        "target": "any power",
        "description": "Whenever the power hits, it deals additional $physType dmg.",
        "meta": "umbral blades"
    },
    {
        "name": "Staggering",
        "target": "any power",
        "description": "Whenever the power hits, the target is staggered until the end of your next turn."
    },
    {
        "name": "Affliction",
        "target": "any power",
        "description": "Whenever the power hits, the target is staggered and sluggish until the end of your next turn. The power also deals less dmg."
    },
    {
        "name": "Inconsistent Eruption",
        "target": "powers with cone areas that require reactivation each round",
        "description": "The power's duration is increased by 1 step, and every 3 reactivations its cone areas are larger and deal more dmg. Its other reactivations deal less dmg."
    },
    {
        "name": "Irregular Eruption",
        "target": "powers with cone areas that require reactivation each round",
        "description": "Every 3 reactivations, the power's cone areas are larger and deal substantially more dmg."
    },
    {
        "name": "Weaving Eruption",
        "target": "powers with cone areas that require reactivation each round",
        "description": "Every 2 reactivations, the power's cone areas are larger and deal more dmg."
    },
    {
        "name": "Stored Energy",
        "target": "powers with cone areas that require reactivation each round",
        "description": "For each turn of the power's duration in which you do not reactivate it, your next reactivation's cone areas are larger and deal barely more dmg."
    },
    {
        "name": "Empowering Exsanguiniation",
        "target": "powers that require reactivation each round",
        "description": "Whenever the power hits, the target is inflicted with a DoT dealing barely any $physType dmg, stacking until CON save. Additionally, every 3 reactivations, you gain +30' sp until the end of your next turn."
    },
    {
        "name": "Decaying Traps",
        "target": "powers that lay traps",
        "description": "Whenever the power hits, the target is inflicted with a DoT dealing $nonPhysType dmg, stacking until CON save. Additionally, the power deals massively less dmg."
    },
    {
        "name": "Inconsistent Power",
        "target": "powers that require reactivation each round",
        "description": "Every 3 reactivations, the power deals massively more dmg. All other reactivations deal barely less dmg."
    },
    {
        "name": "Inconsistent Sapping",
        "target": "powers that require reactivation each round",
        "description": "Every 3 reactivations, the power's hits halve the target's speed until the end of your next turn, and inflict a DoT dealing $physType dmg, stacking until CON save."
    },
    {
        "name": "Inconsistent Cruelty",
        "target": "powers that require reactivation each round",
        "description": "Every 3 reactivations, the power deals massively more dmg vs debuffed targets."
    },
    {
        "name": "Gated Activation",
        "target": "powers that require reactivation each round",
        "description": "Every 3 reactivations, you cannot directly reactivate the power. Instead, it reactivates the next time you teleport. The power deals substantially more dmg."
    },
    {
        "name": "Rapid Shielding",
        "target": "powers that require reactivation each round",
        "description": "The power's reactivation time is reduced by 1 step, but it deals substantially less dmg. Additionally, every 3 reactivations, the power's hits grant you a massive amount of temp HP."
    },
    {
        "name": "Blunt Seeking",
        "target": "powers with line areas that require reactivation each round",
        "description": "Every 3 reactivations, the power's line areas are converted into non-piercing projs that have +5 Accuracy."
    },
    {
        "name": "Inconsistent Penetration",
        "target": "powers that fire non-piercing projectiles and require reactivation each round",
        "description": "Every 3 reactivations, the power's projs are converted into line areas with length of the proj's range and deal more dmg."
    },
    {
        "name": "Empowered Power",
        "target": "any power",
        "description": "The power's dmg deals slightly more dmg while you are buffed. This bonus is doubled while you are in a pers area."
    },
    {
        "name": "Splintering Summons",
        "target": "powers that summon minions",
        "description": "Whenever the minions die, they leave behind a chunk of metal. The next time you reactivate a power that requires reactivation each round, the chunk flies at you, creating a line area between its location and you, making wep atks against all foes and dealing slight $physType dmg."
    },
    {
        "name": "Bursting Empowerment",
        "target": "powers with an instantaneous duration",
        "description": "Whenever a single use of the power hits 1+ target, you gain a slight amount of dmg barrier and +1 to DEX saves until the end of your next turn."
    },
    {
        "name": "Narrowed Power",
        "target": "powers with cone areas",
        "description": "The power's cone areas are converted into 10'-wide line areas that deal barely more dmg."
    },
    {
        "name": "Specialised Inevitability",
        "target": "any power",
        "description": "While you are wielding a $weaponClass weapon, the power's hits give a stack of Invevitability. Whenever a creature reaches 4 stacks of Inevitability, make a wep atk against them, dealing massive $physType dmg."
    },
    {
        "name": "Planted Whirling",
        "target": "powers with line areas",
        "description": "Whenever the power's line areas end, they conjure a 5'x5' whirling chunk of metal that remains as a pers area until the end of your next turn. The area makes wep atks that deal barely any $physType dmg."
    },
    {
        "name": "Overwhelming Persistence",
        "target": "powers that create persistent areas that deal damage",
        "description": "The power's persistent areas' durations are increased by 1 step and have more area, but deal substantially less dmg."
    },
    {
        "name": "Creeping Persistence",
        "target": "powers that create persistent areas",
        "description": "The power's persistent areas move 5' towards their nearest foes at the start of each of your turns."
    },
    {
        "name": "Controlled Power",
        "target": "powers with line areas",
        "description": "You can change the power's line areas to be any length up to their maximum whenever you create them and they deal barely more dmg."
    },
    {
        "name": "Careful Traps",
        "target": "powers with line areas",
        "description": "Whenever the power's line areas end, they leave behind a trap that triggers whenever a creature starts their turn or moves within 5' of it. The traps also trigger at the end of your next turn if they haven't done so already. The traps make a wep atk against all foes within 5' of them, dealing slight $physType dmg and slight $nonPhysType dmg. Also, the power's usage time is increased by 1 step."
    },
    {
        "name": "Patient Traps",
        "target": "powers that lay traps",
        "description": "For every round that the trap is armed and not triggered, it gains barely more detonation area and barely more dmg."
    },
    {
        "name": "Eruption",
        "target": "powers with a non-cooldown resource cost that target a single point",
        "description": "A nova of metal erupts from the power's target, making a spell atk against all foes adj to the target dealing $physType dmg. Additionally, the power's cost is increased by 1 step.",
        "meta": "sacrifice"
    },
    {
        "name": "Explosive Exsanguination",
        "target": "powers with sphere areas",
        "description": "Whenever the power's sphere areas hit, the target is inflicted with a DoT dealing slight $physType dmg, stacking until CON save."
    },
    {
        "name": "Decaying Empowerment",
        "target": "any power",
        "description": "If you have used the power since the start of your last turn, your DoTs deal more dmg."
    },
    {
        "name": "Bombarding Penetration",
        "target": "powers that fire multiple non-piercing projectiles and deal damage",
        "description": "The power's projs are converted to line areas with length equal to the proj's range, but they deal less dmg."
    },
    {
        "name": "Blasting Power",
        "target": "powers with sphere areas",
        "description": "The power's sphere areas deal more dmg."
    },
    {
        "name": "Massive Debilitation",
        "target": "powers that deal damage and have areas",
        "description": "The power has more area and whenever it hits it debilitates the target until the end of your next turn. Additionally, it deals less damage."
    },
    {
        "name": "Massive Support",
        "target": "any power",
        "description": "If you have an active minion when you use the power, it gets more area."
    },
    {
        "name": "Chaining Boons",
        "target": "powers with a non-cooldown resource cost that target a single ally",
        "description": "The power can target 1 additional ally within range and deals more dmg, but its cost is increased by 1 step."
    },
    {
        "name": "Supported Power",
        "target": "any power",
        "description": "If you have an active minion when you use the power, it gets more dmg."
    },
    {
        "name": "Bloody Death",
        "target": "powers with a non-cooldown resource cost",
        "description": "Whenever the power scores a killing blow, it consumes 1 additional step of its resource cost to conjure a CR 1 Blood Spectre from the corpse, which is an undead minion that deals $physType dmg."
    },
    {
        "name": "Leeching Summons",
        "target": "powers that summon minions",
        "description": "Whenever the minions hit, they heal a slight amount of HP."
    },
    {
        "name": "Efficient Summons",
        "target": "powers with a non-cooldown resource cost that summon minions",
        "description": "The power's cost is reduced by 1 step, and whenever the minions hit, they inflict the target with a DoT dealing slight $physType dmg, stacking until CON save (minion's DC). Additionally, the minions deal substantially less dmg."
    },
    {
        "name": "Powerful Summons",
        "target": "powers that summon minions",
        "description": "The minions have slightly more HP and deal slightly more dmg."
    },
    {
        "name": "Gargantuan Summons",
        "target": "powers with a non-cooldown resource cost that summon minions",
        "description": "The minions have substantially more dmg, more HP, and are 1 step larger, but the power's cost is increased by 1 step."
    },
    {
        "name": "Energy",
        "target": "any power",
        "description": "Whenever the power hits, it deals additional $nonPhysType dmg."
    },
    {
        "name": "Efficient Empowerment",
        "target": "powers with a non-cooldown resource cost that deal damage",
        "description": "The power's cost is reduced by 1 step, and if you have used the power since the start of your last turn, you deal more DoT dmg. Additionally, the power deals substantially less dmg."
    },
    {
        "name": "Investment",
        "target": "powers with a non-cooldown resource cost",
        "description": "The power deals massively more dmg, but its cost is increased by 1 step."
    },
    {
        "name": "Eradication",
        "target": "any power",
        "description": "The power deals more dmg if the target cannot sense any of its own allies within 60' of it."
    },
    {
        "name": "Desperation",
        "target": "any power",
        "description": "The power deals more dmg against healthy targets while you are bloodied."
    },
    {
        "name": "Mass Sapping",
        "target": "powers with a non-instantaneous duration",
        "description": "You project an aura while the power is active that halves the speed of adj foes.",
        "meta": "Aura of Decay"
    },
    {
        "name": "Persistent Shredding",
        "target": "powers that create persistent areas",
        "description": "Foes in the power's pers areas take slightly more phys dmg."
    },
    {
        "name": "Shredding Ailments",
        "target": "powers that inflict DoTs",
        "description": "Instead of inflicting DoTs, the power marks targets such that whenever they take phys dmg, they take additional base dmg equal to the DoT's original dmg."
    },
    {
        "name": "Persistent Exsanguination",
        "target": "powers that create persistent areas",
        "description": "Whenever the power hits, the target is inflicted with a DoT dealing slight $physType dmg, stacking until CON save."
    },
    {
        "name": "Ultimate Persistence",
        "target": "powers with a non-cooldown resource cost that create persistent areas and deal damage",
        "description": "The power's persistent areas tick thrice at the start of each of your turns, in addition to their usual tick, but whenever they do so, they consume the power's cost again. Additionally, the power deals less dmg."
    },
    {
        "name": "Sacrificial Persistence",
        "target": "powers that create persistent areas which can damage you",
        "description": "The power's persistent areas tick twice at the start of each of your turns, in addition to their usual tick, but whenever they do so, they tick once against you, regardless of your location. Additionally, the power deals less dmg."
    },
    {
        "name": "Intense Persistence",
        "target": "powers that create persistent areas and deal damage",
        "description": "The power's persistent areas tick at the start of each of your turns, in additional to their usual tick, but they deal less dmg."
    },
    {
        "name": "Persistent Doom",
        "target": "powers that create persistent areas which can damage you",
        "description": "The power's persistent areas tick thrice at the start of each of your turns, in additional to their usual tick, but whenever they do so, they tick a number of times against you equal to the number of complete rounds the area has been active, regardless of your location. Additionally, the power deals less dmg."
    },
    {
        "name": "Enduring Ailments",
        "target": "any power",
        "description": "Any debuffs the power can apply have +1 to their ongoing DCs."
    },
    {
        "name": "Terror",
        "target": "any power",
        "description": "Whenever you use the power, all foes adj to you are frightened until the end of their next turn."
    },
    {
        "name": "Incubating Resilience",
        "target": "powers with a non-instantaneous duration",
        "description": "For the power's duration, you gain a massive amount of $nonPhysType barrier. Additionally, whenever the power ends, you heal barely any HP."
    },
    {
        "name": "Explosive Decay",
        "target": "any power",
        "description": "Whenever you use the power, energy erupts from you, inflicting a DoT dealing barely any $nonPhysType dmg, stacking until CON save, on all adj foes."
    },
    {
        "name": "Growth",
        "target": "powers with areas",
        "description": "The power has more area."
    },
    {
        "name": "Contagious Decay",
        "target": "powers with a non-instantaneous duration that deal damage",
        "description": "For the power's duration, you project a 5' aura that inflicts foes with a DoT dealing barely any $nonPhysType dmg, stacking until CON save. Whenever a creature fails to save out of this DoT, it spreads to all creatures of your choice adj to them. Additionally, the power deals less dmg."
    },
    {
        "name": "Volatile Persistence",
        "target": "powers that create persistent areas",
        "description": "1/turn, when a creature dies within the power's pers areas, their corpse emits a nova of energy, which inflicts a DoT dealing slight $nonPhysType dmg, stacking until CON save, on all creatures of your choice adj to it."
    },
    {
        "name": "Charged Explosions",
        "target": "powers with sphere areas and a cooldown that deal damage",
        "description": "The power's cooldown is reduced by 1 step, but it deals less damage."
    },
    {
        "name": "Resistance",
        "target": "powers with non-instantaneous durations",
        "description": "For the power's duration, you have massively more $nonPhysType barrier."
    },
    {
        "name": "Persistent Erosion",
        "target": "powers that create persistent areas",
        "description": "Foes within the power's pers areas take substantially more $nonPhysType dmg."
    },
    {
        "name": "Decaying Bolts",
        "target": "powers with non-instantaneous durations",
        "description": "At the start of each of your turns during the power's duration, you fire a bolt of energy at the nearest foe in LoS, inflicting a DoT dealing slight $nonPhysType dmg, stacking until CON save."
    },
    {
        "name": "Rapid Missiles",
        "target": "powers that fire projectiles and deal damage",
        "description": "The power's usage time is reduced by 1 step, but it deals less dmg."
    },
    {
        "name": "Persistent Sacrifice",
        "target": "powers that create persistent areas",
        "description": "You and foes within the power's pers areas take substantially more $nonPhysType dmg."
    },
    {
        "name": "Malevolent Shredding",
        "target": "powers with non-instantaneous durations",
        "description": "For the power's duration, whenever you are hit, the offender is cursed with barely increased dmg taken for the rest of the combat."
    },
    {
        "name": "Sacrificial Decay",
        "target": "powers with a non-instantaneous duration",
        "description": "For the power's duration, whenever you are hit, the offender is inflicted with a DoT dealing substantial $nonPhysType dmg and you are inflicted with a DoT dealing $nonPhysType dmg, both stacking until CON save."
    },
    {
        "name": "Malevolent Absorption",
        "target": "powers with a non-instantaneous duration",
        "description": "For the power's duration, whenever you are hit, you pull energy from all adj cursed foes, a spell atk dealing barely any $nonPhysType dmg and granting you temp HP for each target hit."
    },
    {
        "name": "Persistent Restoration",
        "target": "powers that create persistent areas",
        "description": "You and allies within the power's pers areas gain barely any passive regen. This regen is doubled while you are bloodied."
    },
    {
        "name": "Persistent Exploitation",
        "target": "powers that create persistent areas",
        "description": "Your minions within the power's pers areas inflict a DoT on hit dealing $nonPhysType dmg, stacking until CON save (minion's DC), but are inflicted with a DoT dealing slight {type} dmg, stacking until CON save, whenever the area ticks (your DC)."
    },
    {
        "name": "Persistent Control",
        "target": "powers that create persistent areas",
        "description": "Your minions within the power's pers areas deal more $nonPhysType dmg."
    },
    {
        "name": "Constant Traps",
        "target": "powers with a non-instantaneous duration",
        "description": "At the start of each of your turns during the power's duration, you drop an energy trap. At the start of your next turn, the trap is triggered and all foes adj to it are inflicted with a DoT dealing barely any $nonPhysType dmg, stacking until CON save."
    },
    {
        "name": "Stacked Intensity",
        "target": "powers with cone areas that deal damage",
        "description": "The power's cone areas are converted into 5'-wide lines of the same length that apply twice, but the power deals substantially less dmg.",
        "meta": "Shurikens"
    },
    {
        "name": "Focused Return",
        "target": "powers with cone areas",
        "description": "The power's cone areas are converted into 10'-wide line areas of the same length that apply again from their endpoint to your location at the start of your next turn, regardless of length. Additionally, the power deals substantially more dmg, but its usage time is increased by 2 steps."
    },
    {
        "name": "Building Penetration",
        "target": "powers with line areas that originate from you",
        "description": "The power's line areas deal more dmg against targets 30+' away from you."
    },
    {
        "name": "Massive Overcharging",
        "target": "powers with cone areas and a non-cooldown resource cost",
        "description": "The power's cone areas are massively longer, but its cost is increased by 1 step."
    },
    {
        "name": "Shielding Missiles",
        "target": "powers that fire projectiles",
        "description": "The power's projs instead fly around you, atking as if they were a 5' aura. The projs can still only atk their usual number of times before being destroyed."
    },
    {
        "name": "Persistent Endurance",
        "target": "powers that create persistent areas that deal damage",
        "description": "The power's persistent areas' durations are increased by 1 step, but they deal less dmg."
    },
    {
        "name": "Armoured Persistence",
        "target": "powers that create persistent areas",
        "description": "While the power's persistent areas are active, you have massively more phys barrier."
    },
    {
        "name": "Exposure",
        "target": "any power",
        "description": "Whenever the power hits, the target gets slighly increased $physType and $nonPhysType dmg taken until the end of your next turn."
    },
    {
        "name": "Chaining",
        "target": "powers with cone areas and a non-cooldown resource cost",
        "description": "The power's cone areas are converted to chaining projs with range equal to the cone's length, but its cost is increased by 1 step. Additionally, the power deals barely more crit dmg."
    },
    {
        "name": "Energy Exposure",
        "target": "any power",
        "description": "Whenever the power hits, the target gets barely more $nonPhysType dmg taken and it has -1 to debuff saves until the end of your next turn."
    },
    {
        "name": "Efficient Power",
        "target": "powers with a non-cooldown resource cost",
        "description": "The power deals more dmg and its cost is reduced by 1 step, but its usage time is increased by 1 step."
    },
    {
        "name": "Planned Retreat",
        "target": "powers with a targeted direction and a cooldown",
        "description": "Whenever you use the power, you shift up 20' away from the targeted direction in a straight line, but its cooldown is increased by 1 step."
    },
    {
        "name": "Alacrity",
        "target": "any power",
        "description": "If the power is used and hits 1+ target, you gain +10' speed until the end of the turn."
    },
    {
        "name": "Blinding",
        "target": "any power",
        "description": "Whenever the power hits, the target is blinded until the end of your next turn."
    },
    {
        "name": "Rooting",
        "target": "any power",
        "description": "Whenever the power hits, the target is rooted until the end of their next turn."
    },
    {
        "name": "Erosion",
        "target": "any power",
        "description": "Whenever the power hits, the target is inflicted with a DoT dealing slight $nonPhysType dmg, stacking until CON save."
    },
    {
        "name": "Explosions",
        "target": "powers with cone areas",
        "description": "The power's cone areas are converted into self-burst spheres with radius equal to the cone's length."
    },
    {
        "name": "Exsanguination",
        "target": "any power",
        "description": "Whenever the power hits, the target is inflicted with a DoT dealing slight $physType dmg, stacking until CON save."
    },
    {
        "name": "Potential",
        "target": "any power",
        "description": "The power can have 2 additional tome upgrades applied to it.",
        "meta": "Swarmblade Form"
    },
    {
        "name": "Shifting Summoning",
        "target": "powers that shapeshift",
        "description": "Whenever the shapeshift's melee wep atks hit, your active minions gain global dmg until you take a LR, but these melee wep atks gain a 4+ recharge. If the atks are unusable on a turn due to this cooldown, a new power can be used in its place that conjures a Locust, a CR 1/4 minion that deals $physType dmg and gains a permanent -1 passive regen at the start of each of its turns."
    },
    {
        "name": "Shifting Feasting",
        "target": "powers that shapeshift",
        "description": "Whenever the shapeshift's powers or minions score a KB, or hit a boss, you heal barely any HP and double the shapeshift's max duration."
    },
    {
        "name": "Shifting Tornadoes",
        "target": "powers that shapeshift",
        "description": "Every 5 hits the shapeshift's melee wep atks score, the max duration of the shapeshift is halved to conjure a tornado of energy in the target's space, a 5x5' pers area that moves 5' in a random dir at the start of each of your turns and makes spell atks that deal substantial $physType dmg."
    },
    {
        "name": "Persistent Power",
        "target": "powers that create persistent areas",
        "description": "The power's pers areas deal more dmg."
    },
    {
        "name": "Shifting Unity",
        "target": "powers that shapeshift",
        "description": "The shapeshift and its minions deal barely any additional $physType dmg with hits. Additionally, while it has an active minion, the shapeshift's DoTs deal barely more dmg."
    },
    {
        "name": "Keen Shifting",
        "target": "powers that shapeshift into forms that can deal dmg",
        "description": "The shapeshift and its minions have +1 crit range. Additionally, the shapeshift deals less dmg."
    },
    {
        "name": "Shifting Endurance",
        "target": "powers that shapeshift",
        "description": "Whenever the shapeshift or its minions crit, the shapeshift's maximum duration is doubled."
    },
    {
        "name": "Summoning Shifting",
        "target": "powers that shapeshift",
        "description": "The shapeshift's minions have less dmg and massively less max HP, but they have +10' reach and are 1 size larger."
    },
    {
        "name": "Swarming Persistence",
        "target": "powers that shapeshift",
        "description": "The shapeshift's pers areas count as a swarm of untargetable minions dealing using the pers area's ticks instead of you."
    },
    {
        "name": "Shifting Leeching",
        "target": "powers that shapeshift",
        "description": "Whenever the shapeshift's pers areas tick, it heals a slight amount of HP."
    },
    {
        "name": "Supported Decay",
        "target": "powers that shapeshift",
        "description": "If the shapeshift has an active minion when it creates a pers area, the area deals slightly more dmg and for its duration, the shapeshift's hits inflict a DoT dealing barely any $nonPhysType dmg, stacking until CON save."
    },
    {
        "name": "Pooling Shifting",
        "target": "powers that shapeshift",
        "description": "The durations of the shapeshift's pers areas are increased by 1 step. Additionally, its melee wep atks deal massively more dmg but their usage time is increased by 2 steps."
    },
    {
        "name": "Persistent Shifting",
        "target": "powers that shapeshift",
        "description": "Whenever the shapeshift scores a melee wep hit, the max durations of its active pers areas are quadrupled and you revert out of the shapeshift."
    },
    {
        "name": "Savage Shifting",
        "target": "powers that shapeshift",
        "description": "The shapeshift's melee wep hits deal barely more dmg and double the max duration of the shapeshift."
    },
    {
        "name": "Supportive Shifting",
        "target": "powers that shapeshift",
        "description": "Whenever the shapeshift makes a melee wep atk, a random one of its active minions can react to make a single atk. The shapeshift deals substantially less dmg."
    },
    {
        "name": "Defensive Shifting",
        "target": "powers that shapeshift",
        "description": "The shapeshift and its minions have +1 to DEX saves and massively more phys barrier, but it deals less dmg."
    },
    {
        "name": "Heavy Shifting",
        "target": "powers that shapeshift",
        "description": "The shapeshift has -1 to DEX saves and massively more phys barrier."
    },
    {
        "name": "Enduring Shifting",
        "target": "powers that shapeshift",
        "description": "Whenever the shapeshift passes a DEX save, its max duration is doubled."
    },
    {
        "name": "Swirling Shifting",
        "target": "powers that shapeshift",
        "description": "Whenever the shapeshift makes a charged melee wep atk, its max duration is halved to surround itself with swirling energy, projecting a 5' aura that makes spell atks against foes dealing slight $nonPhysType dmg for combat (dmg stacks)."
    },
    {
        "name": "Shifting Summons",
        "target": "powers that shapeshift",
        "description": "The shapeshift's minions have slightly more dmg and more max HP."
    },
    {
        "name": "Rejuvenating Shifting",
        "target": "powers that shapeshift",
        "description": "Whenever the shapeshift summons a minion, it heals a slight amount of HP and its max duration is doubled, but it deals less dmg."
    },
    {
        "name": "Staggering Shifting",
        "target": "powers that shapeshift",
        "description": "The shapeshift and its minions stagger targets for 1 round on hit."
    },
    {
        "name": "Flagellating Shifting",
        "target": "powers that shapeshift",
        "description": "Whenever the shapeshift hits its minions with a melee wep atk, the target gains substantially more dmg for the combat. Additionally, the shapeshift deals less dmg."
    },
    {
        "name": "Summoned Bombs",
        "target": "powers that shapeshift",
        "description": "The shapeshift's minions can no longer take actions. Instead, at the start of each of their turns, they release a nova of metal, making spell atks against all foes adj to them dealing $physType dmg."
    },
    {
        "name": "Rapid Summoning",
        "target": "powers that shapeshift",
        "description": "The shapeshift's powers that summon minions have their usage times reduced by 1 step. Additionally, the shapeshift's pers areas contain an untargetable, immobile CR 1/8 beast minion, a locust, at their centre that deals $physType dmg. The shapeshift deals substantially less dmg."
    },
    {
        "name": "Summoning Reversion",
        "target": "powers that shapeshift",
        "description": "Whenever the shapeshift summons a minion, you revert out of the shapeshift and the minion is replaced with an immobile Healing Totem, a CR 1/4 construct minion that deals a quarter of its dmg as healing."
    },
    {
        "name": "Decaying Shifting",
        "target": "powers that shapeshift",
        "description": "The shapeshift and its minions inflict their targets with a DoT dealing slight $nonPhysType dmg, stacking until CON save, on hit."
    },
    {
        "name": "Shifting Alacrity",
        "target": "powers that shapeshift",
        "description": "The shapeshift's powers have their usage times reduced by 1 step, but they deal less dmg."
    },
    {
        "name": "Exsanguinating Shifting",
        "target": "powers that shapeshift",
        "description": "The shapeshift's melee wep hits and minions inflict their targets with a DoT dealing slight $physType dmg, stacking until CON save, on hit."
    },
    {
        "name": "Raw Shifting",
        "target": "powers that shapeshift",
        "description": "Whenever the shapeshift creates a pers area, all debuffs the shapeshift has applied in this combat are removed and the pers area deals slightly more dmg and has slightly more area."
    },
    {
        "name": "Reaching Summons",
        "target": "powers that summon minions",
        "description": "The minions have +5' reach and deal barely more dmg.",
        "meta": "Summon Skeleton"
    },
    {
        "name": "Roguish Summons",
        "target": "powers that summon minions",
        "description": "As a movement action 1/combat, the minions can teleport to a space they can see that is adj to a foe. Additionally, as an action, they can throw metal at a target within 120', making a thrown wep atk that deals $physType dmg."
    },
    {
        "name": "Summoned Decay",
        "target": "powers that summon minions",
        "description": "As an action, the minions can throw metal at a target within 120', making a thrown wep atk dealing substantially less $physType dmg, inflicting the target with a DoT dealing slight $nonPhysType dmg, stacking until CON save (minion's DC), and giving them slightly increased phys dmg taken until the end of the minion's next turn."
    },
    {
        "name": "Solo Summons",
        "target": "powers that summon minions which have cooldowns",
        "description": "The minions' cooldowns are reduced by 1 step and they deal more dmg, but their powers' usage times are increased by 1 step. Additionally, while the minion is active, you cannot have any other active minions."
    },
    {
        "name": "Rebirth",
        "target": "powers that summon minions which deal damage",
        "description": "Whenever the minions die, they are resummoned at the end of your next turn (after their turn would be). The minions deal less dmg."
    },
    {
        "name": "Efficient Summoning",
        "target": "powers with a non-cooldown resource cost that summon minions",
        "description": "The power's cost is reduced by 1 step and the minions have +1 crit range, but the minions deal substantially less dmg."
    },
    {
        "name": "Effective Summons",
        "target": "powers that summon minions",
        "description": "The minions deal slightly more dmg and have slightly more HP."
    },
    {
        "name": "Sacrificial Shielding",
        "target": "powers that summon minions",
        "description": "Whenever the minions die, you gain a substantial amount of temp HP."
    },
    {
        "name": "Sacrificial Casting",
        "target": "powers that summon minions",
        "description": "If one of the minions have died since your last turn, you deal substantially more spell dmg."
    },
    {
        "name": "Sacrificial Energy",
        "target": "powers with a non-cooldown resource cost that summon minions",
        "description": "Whenever the minions die, you recover 1 unit of the power's cost."
    },
    {
        "name": "Energised Summons",
        "target": "powers with a non-cooldown resource cost that summon minions",
        "description": "The minions deal substantially more dmg and have more HP, but the power's cost is increased by 1 step."
    },
    {
        "name": "Favoured Summons",
        "target": "powers that have multiple static minion summoning options",
        "description": "The first minion option has more HP, and the second 2 deal more dmg."
    },
    {
        "name": "Armoured Summons",
        "target": "powers that have multiple static minion summoning options",
        "description": "1/combat, as a bonus action, the first minion option can surround themselves with Bone Armour, gaining a substantial amount of dmg barrier until the end of their next turn."
    },
    {
        "name": "Charged Summons",
        "target": "powers that summon minions that deal damage",
        "description": "The limited powers of the minions have their cooldowns reduced by 1 step, and their buffs on themselves have double duration. The minions deal less dmg."
    },
    {
        "name": "Generous Summons",
        "target": "powers that summon minions",
        "description": "The buff powers that the minion can usually only target themselves with can now target any ally within 120' of them that they can see. The buffs have -1 effectiveness on non-minion creatures. Additionally, the minions deal more dmg."
    },
    {
        "name": "Learning Summons",
        "target": "powers that summon minions",
        "description": "If one of the minions have died since your last turn, using the power grants the newly-summoned minion substantially more max HP."
    },
    {
        "name": "Favoured Power",
        "target": "powers that have multiple static minion summoning options",
        "description": "The second minion option is disabled, but the minions deal more dmg."
    },
    {
        "name": "Massive Summons",
        "target": "powers that summon minions",
        "description": "The minions deal more dmg and are 1 size step larger, but have less max HP."
    },
    {
        "name": "Alacritous Summons",
        "target": "powers that summon minions that deal damage",
        "description": "The minions' powers have their usage times reduced by 1 step and they have +10' speed, but they deal substantially less dmg."
    },
    {
        "name": "Cruel Summons",
        "target": "powers that have multiple static minion summoning options",
        "description": "As an action, the second minion option can shoot an energy bolt at a creature within 120', making a wep atk that deals barely any $physType dmg and barely any $nonPhysType dmg, and inflicts a DoT dealing barely any $nonPhysType dmg, stacking until DEX save."
    },
    {
        "name": "Splitting Summons",
        "target": "powers that summon minions with single-proj powers which have cooldowns",
        "description": "The minions' single-proj powers fire an additional proj a 45 degree angle of your choice away from the original and deal more dmg, but their cooldowns are increased by 1 step."
    },
    {
        "name": "Keen Favour",
        "target": "powers that have multiple static minion summoning options",
        "description": "The minions have +1 crit range, but the first minion option deals less dmg and has less max HP."
    },
    {
        "name": "Powerful Favour",
        "target": "powers that have multiple static minion summoning options",
        "description": "The first minion option is disabled, but the minions deal more dmg."
    },
    {
        "name": "Shifting Rejuvenation",
        "target": "powers that shapeshift into forms that can deal damage",
        "description": "The shapeshift gains barely any passive regen and deals more DoT dmg, but deals less hit dmg.",
        "meta": "Reaper Form"
    },
    {
        "name": "Tethered Shifting",
        "target": "powers that shapeshift",
        "description": "1/rnd, when the shapeshift is hit, it attempts to attach a blood tether to the offender by making a spell atk. On a hit, the tether deals less $physType dmg and the shapeshift heals barely any HP."
    },
    {
        "name": "Armoured Shifting",
        "target": "powers that shapeshift",
        "description": "The shapeshift gains a massive amount of phys barrier."
    },
    {
        "name": "Resistant Shifting",
        "target": "powers that shapeshift",
        "description": "The shapeshift gains a massive amount of $nonPhysType barrier and a substantial amount of $nonPhysType barrier."
    },
    {
        "name": "Lifebound Shifting",
        "target": "powers that shapeshift",
        "description": "The shapeshift gains a slight amount of incoming healing."
    },
    {
        "name": "Shifting Restoration",
        "target": "powers that shapeshift",
        "description": "The shapeshift gains a slight amount of outgoing healing and heals barely any HP on hit."
    },
    {
        "name": "Shielded Shifting",
        "target": "powers that shapeshift",
        "description": "The shapeshift gains a slight amount of incoming temp HP and gains a slight amount of temp HP on hit."
    },
    {
        "name": "Shifting Flagellation",
        "target": "powers that shapeshift",
        "description": "Whenever the shapeshift hits its minions with a charged wep atk, it heals HP."
    },
    {
        "name": "Shifting Empowerment",
        "target": "powers that shapeshift",
        "description": "Whenever the shapeshift starts its turn, it gains a slight amount of spell dmg until it reverts."
    },
    {
        "name": "Hyperpresence",
        "target": "any power",
        "description": "Effects of the power that trigger at the start of a turn also trigger at the end of that same turn."
    },
    {
        "name": "Shifting Decay",
        "target": "powers that shapeshift",
        "description": "Whenever the shapeshift scores a KB with a charged wep atk, it releases bolts of decay that seek out all foes within 120' of it. Each bolt inflicts a DoT on its target dealing slight $nonPhysType dmg, stacking until CHA save."
    },
    {
        "name": "Cruel Shifting",
        "target": "powers that shapeshift",
        "description": "The shapeshift's charged wep atks deal more dmg vs bloodied targets."
    },
    {
        "name": "Blinking",
        "target": "powers with a cooldown that teleport an entity",
        "description": "The power's usage time is reduced by 1 step and its teleports travel farther, but its cooldown is increased by 1 step."
    },
    {
        "name": "Shifting Energy",
        "target": "powers that shapeshift",
        "description": "The shapeshift deals a slight amount of additional $nonPhysType dmg with its hits. This bonus is doubled for charged wep atks."
    },
    {
        "name": "Destructive Shifting",
        "target": "powers that shapeshift",
        "description": "The shapeshift deals slightly more crit dmg. This bonus is doubled for charged wep atks."
    },
    {
        "name": "Malevolent Shifting",
        "target": "powers that shapeshift into forms which can deal damage",
        "description": "Whenever the shapeshift hits, the target is cursed with barely increased dmg taken for the combat. The curse's effect is doubled when it is triggered from a charged wep hit. Additionally, the shapeshift deals less dmg."
    },
    {
        "name": "Blunt Decay",
        "target": "powers that shapeshift",
        "description": "The shapeshift's charged wep hits inflict a DoT dealing $nonPhysType dmg, stacking until CON save, but have -1 crit range."
    },
    {
        "name": "Enduring Decay",
        "target": "powers that shapeshift into forms which can deal damage",
        "description": "The shapeshift's charged wep hits inflict a DoT dealing slight $nonPhysType dmg, stacking until CON save. This DoT's ongoing debuff DC has a +1 bonus. Additionally, the shapeshift deals less dmg."
    },
    {
        "name": "Bursting Decay",
        "target": "powers that shapeshift into forms which can deal damage",
        "description": "Whenever you use the power, all adj foes are inflicted with a DoT dealing barley any $nonPhysType dmg, stacking until CON save. Additionally, the shapeshift's hits inflict a DoT dealing slight $nonPhysType dmg, stacking until CON save. The shapeshift deals less dmg."
    },
    {
        "name": "Reaching Shifting",
        "target": "powers that shapeshift into forms which can deal damage",
        "description": "The shapeshift's charged wep atks have +5' reach and it heals a slight amount of HP on charged wep hit, but it deals less dmg."
    },
    {
        "name": "Feasting Shifting",
        "target": "powers that shapeshift into forms which have teleports with cooldowns",
        "description": "Whenever the shapeshift scores a KB, it heals a slight amount of HP. This bonus is doubled for charged wep KBs."
    },
    {
        "name": "Desperate Shifting",
        "target": "powers that shapeshift",
        "description": "The shapeshift deals more dmg while bloodied."
    },
    {
        "name": "Shifting Reach",
        "target": "powers that shapeshift",
        "description": "The shapeshift's charged wep atks have +5' reach."
    },
    {
        "name": "Alacritous Shifting",
        "target": "powers that shapeshift",
        "description": "Whenever the shapeshift makes a charged wep atk while bloodied, it gains +10' sp until the end of its next turn."
    },
    {
        "name": "Reckless Shifting",
        "target": "powers that shapeshift",
        "description": "The shapeshift deals more dmg and has +1 crit range, but on a KB it loses HP."
    },
    {
        "name": "Shifting Shielding",
        "target": "powers that shapeshift",
        "description": "Whenever you use the power, the resulting shapeshift gains temp HP."
    },
    {
        "name": "Undead Shifting",
        "target": "powers that shapeshift",
        "description": "Whenever you use the power, you summon a Skeleton, a CR 1/8 undead minion with a 50% chance each (on summoning) to either have a melee or ranged (120') atk dealing $physType dmg. You can only have 1 of this minion at a time."
    },
    {
        "name": "Shielded Reversion",
        "target": "powers that shapeshift",
        "description": "Whenever the shapeshift reverts, you gain temp HP."
    },
    {
        "name": "Alacritous Feasting",
        "target": "powers that shapeshift",
        "description": "Whenever the shapeshift scores a KB, it gains +10' sp for the combat."
    },
    {
        "name": "Channeled Decay",
        "target": "powers that require concentration",
        "description": "At the start of each of your turns while concentrating on the power, each adj foe is inflicted with a DoT dealing slight $nonPhysType dmg, stacking until DEX save.",
        "meta": "Rebuke"
    },
    {
        "name": "Enduring Cruelty",
        "target": "powers that require concentration",
        "description": "Debuffs you apply while concentrating on the power have +1 to their ongoing DCs."
    },
    {
        "name": "Channeled Shredding",
        "target": "powers that require concentration",
        "description": "At the start of each of your turns while concentrating on the power, each adj foe gets slightly increased phys dmg taken until end of your next turn."
    },
    {
        "name": "Channeled Contagion",
        "target": "powers that require concentration",
        "description": "At the start of each of your turns while concentrating on the power, each adj foe is inflicted with a DoT dealing barely any $nonPhysType dmg, stacking until DEX save. Whenever a creature fails their save to escape this DoT, all creatures of your choice adj to them are inflicted with this DoT."
    },
    {
        "name": "Powerful Mass",
        "target": "powers with areas",
        "description": "The power deals substantially more dmg and has more area, but its usage time is increased by 1 step."
    },
    {
        "name": "Powerful Energy",
        "target": "any power",
        "description": "The power's hits deal additional $nonPhysType dmg."
    },
    {
        "name": "Empowering Energy",
        "target": "powers that deal damage",
        "description": "Whenever the power hits, you gain slightly increased $nonPhysType dmg, slightly increased melee dmg, and +1 to ongoing debuff saves for the remainder of combat. Additionally, the power deals massively less dmg."
    },
    {
        "name": "Channeled Recovery",
        "target": "powers with a non-cooldown resource cost that require concentration and deal damage",
        "description": "At the start of each of your turns while concentrating on the power, recover 1 unit of the power's cost. Additionally, the power deals less dmg."
    },
    {
        "name": "Channeled Rejuvenation",
        "target": "powers that require concentration and deal damage",
        "description": "While concentrating on the power, you and all adj allies gain barely any passive regen. Additionally, the power deals less dmg."
    },
    {
        "name": "Building Rejuvenation",
        "target": "powers that heal and require concentration",
        "description": "At the start of each of your turns while concentrating on the power, it heals slightly more HP for the remainder of its duration."
    },
    {
        "name": "Rejuvenating Channelling",
        "target": "powers that require concentration",
        "description": "While concentrating on the power, you gain barely any passive regen."
    },
    {
        "name": "Armoured Channelling",
        "target": "powers that require concentration",
        "description": "While concentrating on the power, you gain a massive amount of phys barrier."
    },
    {
        "name": "Enduring Channelling",
        "target": "powers that require concentration and deal damage",
        "description": "When you end or lose concentration on the power, its effects persist for a number of additional rnds equal to the number of rnds you channeled for. Additionally, the power deals massively less dmg."
    },
    {
        "name": "Channeled Alacrity",
        "target": "powers that require concentration, deal damage, and have Accuracy components",
        "description": "When you end or lose concentration on the power, you gain +5' sp and all your power usage times are reduced by 1 step for a number of rounds equal to the number of rounds you channeled for. Additionally, the power deals massively less dmg and has -1 Accuracy."
    },
    {
        "name": "Channeled Boons",
        "target": "powers that require concentration, apply buffs, and deal damage",
        "description": "When you end or lose concentration on the power, its effects persist for 1 additional round. Additionally, the power deals less dmg."
    },
    {
        "name": "Resistant Channelling",
        "target": "powers that require concentration",
        "description": "While concentrating on the power, you gain a massive amount of non-phys barrier."
    },
    {
        "name": "Major Charging",
        "target": "powers with a cooldown and a non-cooldown resource cost",
        "description": "The power's cooldown is reduced by 1 step, but its resource cost is increased by 1 step. Additionally, it deals more dmg."
    },
    {
        "name": "Overcharged Endurance",
        "target": "powers with a non-instantaneous duration and a cooldown",
        "description": "The power's duration increases by 1 step, but its cooldown is increased by 1 step. Additionally, it deals more dmg."
    },
    {
        "name": "Recovering Absorption",
        "target": "powers with a non-cooldown resource cost that require concentration and deal damage",
        "description": "Whenever you are hit while concentrating on the power, recover 1 unit of the power's cost. Additionally, the power deals less dmg."
    },
    {
        "name": "Debilitation",
        "target": "any power",
        "description": "Whenever the power hits, the target is debilitated until the end of their next turn.",
        "meta": "Meteor"
    },
    {
        "name": "Keen Mass",
        "target": "powers that make attacks and deal damage",
        "description": "The power has +1 crit range and more area, but deals less dmg."
    },
    {
        "name": "Keen Aggression",
        "target": "powers with a non-cooldown resource cost",
        "description": "If the power's resource is full when it is used, the power has +1 crit range."
    },
    {
        "name": "Chaotic Bursting",
        "target": "powers with sphere areas and a non-cooldown resource cost",
        "description": "The power's sphere areas are duplicated and deal more dmg, centred at a random location within 20' of the original centre, but its cost is increased by 1 step."
    },
    {
        "name": "Powerful Spread",
        "target": "powers with multiple individual targets",
        "description": "The power deals substantially more dmg, but can only target each creature once."
    },
    {
        "name": "Chaotic Focus",
        "target": "powers with sphere areas",
        "description": "The power's sphere areas are duplicated, centred at a random location within 20' of the original centre, but it has less area."
    },
    {
        "name": "Orderly Spread",
        "target": "powers with multiple areas and a non-cooldown resource cost",
        "description": "The power's areas are spread in a contiguous line in a direction of your choice and deal substantially more dmg, but its cost is increased by 1 step."
    },
    {
        "name": "Chaos",
        "target": "powers with sphere areas that deal damage",
        "description": "The power's sphere areas are duplicated, centred at a random location within 20' of the original centre, but it deals less dmg."
    },
    {
        "name": "Delayed Recovery",
        "target": "powers with a non-cooldown resource cost that deal damage",
        "description": "Whenever you use the power, you recover 1 unit of its cost at the end of your next turn."
    },
    {
        "name": "Empowering Slinging",
        "target": "powers that deal damage",
        "description": "If you've used the power since the start of your last turn, you deal more $nonPhysType dmg and your spells have their usage times reduced by 1 step. Additionally, the power deals substantially less dmg."
    },
    {
        "name": "Empowering Shielding",
        "target": "powers that grant buffs and deal damage",
        "description": "While you are buffed by the power, your spell hits grant you temp HP and recover 1 spell slot lvl. Additionally, the power deals substantially less dmg."
    },
    {
        "name": "Shrapnel",
        "target": "powers that deal damage",
        "description": "Whenever the power hits, it shatters into bolts of energy, making spell atks against all foes adj to its target which deal $nonPhysType dmg. Additionally, the power deals substantially less dmg."
    },
    {
        "name": "Powerful Missiles",
        "target": "powers that fire projectiles",
        "description": "The power's projs deal more dmg."
    },
    {
        "name": "Close Penetration",
        "target": "powers that fire projectiles",
        "description": "The power's projs are converted to line areas with length equal to half the proj's range, and deal more dmg."
    },
    {
        "name": "Distant Missiles",
        "target": "powers that fire projectiles",
        "description": "The power's projs have double range."
    },
    {
        "name": "Rapid Energy",
        "target": "powers with a non-cooldown resource cost",
        "description": "The power's usage time is reduced by 1 step and it deals more dmg, but its cost 1 increased by 1 step."
    },
    {
        "name": "Aggressive Force",
        "target": "any power",
        "description": "The power deals more dmg. This bonus is doubled against targets on full HP."
    },
    {
        "name": "Powerful Intensity",
        "target": "any power",
        "description": "The power deals massively more dmg, but its usage time is increased by 1 step."
    },
    {
        "name": "Prismatic Power",
        "target": "powers that deal damage",
        "description": "The power deals more dmg of all types other than its base types."
    },
    {
        "name": "Sacrificial Shredding",
        "target": "powers that cost HP",
        "description": "Whenever the power hits, the target gets increased $nonPhysType dmg taken until the end of your next turn.",
        "meta": "Death Seal"
    },
    {
        "name": "Enduring Persistence",
        "target": "powers with a non-instantaneous duration that deal damage",
        "description": "If you have an active pers area when you use the power, the power's duration is increased by 1 step, but it deals less dmg."
    },
    {
        "name": "Sacrificial Defence",
        "target": "powers with a non-instantaneous duration that cost HP",
        "description": "For the power's duration, you have substantially increased $nonPhysType barrier and phys barrier."
    },
    {
        "name": "Enduring Possession",
        "target": "powers with a non-instantaneous duration",
        "description": "At the start of each of your turns during the power's duration, you release a wisp of energy at the nearest foe, regardless of line of sight, that inflicts them with a DoT dealing slight $nonPhysType dmg, stacking until CHA save."
    },
    {
        "name": "Regular Duplication",
        "target": "powers that deal damage and have an effect that triggers once on each of your turns",
        "description": "The power's effect triggers again on the opposite side of your turn, but it deals less dmg."
    },
    {
        "name": "Generosity",
        "target": "powers that buff you",
        "description": "The power can no longer be used on yourself, but can instead be used on any minion of yours within 60' of you."
    },
    {
        "name": "Generous Power",
        "target": "powers that apply buffs and deal damage",
        "description": "When you use the power to buff one of your minions, the minion also gains barely increased dmg and +1 crit range for the buff's duration. Additionally, the power deals less dmg."
    },
    {
        "name": "Sacrificial Eruption",
        "target": "powers that apply buffs and deal damage",
        "description": "When you use the power to buff one of your minions, the minion is rooted for the buff's duration. When the buff ends, the minion dies and explodes, causing you to make a spell atk against all foes adj to the minion's corpse, dealing substantial $nonPhysType dmg. Additionally, the power deals substantially less dmg."
    },
    {
        "name": "Enduring Sealing",
        "target": "powers with a non-instantaneous duration",
        "description": "For the power's duration, you have massively increased DoT dmg barrier."
    },
    {
        "name": "Empowered Alacrity",
        "target": "powers that apply buffs",
        "description": "Whenever the power's buffs on you end, your sp increases by 5' for the same duration as the buff was on you."
    },
    {
        "name": "Suppressed Power",
        "target": "any power",
        "description": "For each round of combat you don't use the power, you are inflicted with a DoT dealing $nonPhysType dmg, stacking until CHA save. Whenever you use the power while affected by this DoT, the DoT is removed and the power deals substantially more dmg."
    },
    {
        "name": "Incubating Rejuvenation",
        "target": "powers that deal damage",
        "description": "Whenever you use the power, you heal HP for each round this combat since you last used the power. Additionally, the power deals massively less dmg."
    },
    {
        "name": "Flagellation",
        "target": "any power",
        "description": "Whenever the power hits one of your minions, that minion deals substantially more dmg until the end of their next turn."
    },
    {
        "name": "Powerful Cruelty",
        "target": "any power",
        "description": "The power deals more dmg against bloodied targets."
    },
    {
        "name": "Empowered Resilience",
        "target": "powers that apply buffs",
        "description": "Whenever the power's buffs on you end, you gain dmg barrier for the same duration as the buff was on you."
    },
    {
        "name": "Empowered Leeching",
        "target": "powers that apply buffs",
        "description": "While you are buffed by the power, the power's hits heal you for a slight amount of HP."
    },
    {
        "name": "Empowered Decay",
        "target": "powers that apply buffs",
        "description": "While buffed by the power and bloodied, your hits inflict a DoT dealing slight $nonPhysType dmg, stacking until CON save."
    },
    {
        "name": "Empowered Control",
        "target": "powers that apply buffs and deal damage",
        "description": "While buffed by the power and bloodied, you gain a massive amount of phys barrier and +1 to saves vs debuffs. Additionally, the power deals less dmg."
    },
    {
        "name": "Controlled Sacrifice",
        "target": "any power",
        "description": "If you use the power while healthy, your HP drops to your bloodied threshold. Additionally, the power deals more dmg."
    },
    {
        "name": "Empowered Vengeance",
        "target": "powers that apply buffs and deal damage",
        "description": "If you go down while buffed by the power, you release a wave of energy, a spell atk against all adj foes dealing substantial $nonPhysType dmg. Additionally, the power deals less dmg."
    },
    {
        "name": "Sacrificial Recovery",
        "target": "powers with a non-cooldown resource cost that apply buffs",
        "description": "At the start of each of your turns while buffed by the power, you recover 1 unit of the power's cost and lose a slight amount of HP."
    },
    {
        "name": "Powerful Empowerment",
        "target": "powers that apply buffs",
        "description": "While buffed by the power and bloodied, you deal more dmg."
    },
    {
        "name": "Empowered Bursting",
        "target": "powers that apply buffs",
        "description": "At the start of each of your turns while buffed by the power, you release a wave of energy, making a spell atk against all adj foes that deals $nonPhysType dmg."
    },
    {
        "name": "Keen Duplication",
        "target": "powers that deal damage, make attacks, and have an effect that triggers once on each of your turns",
        "description": "The power's effect triggers again on the opposite side of your turn and has +1 crit range, but deals substantially less dmg."
    },
    {
        "name": "Shredding Cruelty",
        "target": "powers that deal damage",
        "description": "Whenever the power hits, the target gets increased $nonPhysType dmg taken and -1 to debuff saves until the end of your next turn. Additionally, the power's hits debilitate until the end of the target's next turn and deal substantially less dmg.",
        "meta": "Surge"
    },
    {
        "name": "Delayed Eruption",
        "target": "powers that deal damage",
        "description": "Whenever the power hits, the target is charged with unstable energy, which erupts into an explosion of energy at the start of your next turn, making spell atks against all foes adj to the target, including the target, that deal $nonPhysType dmg. Additionally, the power deals less dmg."
    },
    {
        "name": "Cruel Technique",
        "target": "powers that apply debuffs",
        "description": "The power has +1 debuff effectiveness and any procs it triggers deal barely more dmg while you are dual-wielding."
    },
    {
        "name": "Incubating Power",
        "target": "powers with a cooldown",
        "description": "While the power is on cooldown, scoring a melee hit grants slightly more dmg to your next usage of the power."
    },
    {
        "name": "Mobile Technique",
        "target": "powers that move you and deal damage",
        "description": "At the end of the power's movement, you can immediately use a maneuver with a usage time of 1 action, spending its exertion cost as usual. Additionally, the power deals less dmg."
    },
    {
        "name": "Incubating Warding",
        "target": "powers with a cooldown",
        "description": "While the power is on cooldown, scoring a melee hit grants you a slight amount of temp HP the next time you use the power (stacking to 1 instance)."
    },
    {
        "name": "Incubating Atmosphere",
        "target": "powers with a cooldown",
        "description": "While the power is on cooldown, scoring a melee hit causes your next usage of the power to project a 5' aura of energy that makes spell atks against foes dealing slight $nonPhysType dmg (dmg stacks into 1 aura)."
    },
    {
        "name": "Mobile Magic",
        "target": "powers that move you and deal damage",
        "description": "At the end of the power's movement, you can immediately cast a spell with a casting time of 1 action, spending spell slots as usual. Additionally, the power deals less dmg."
    },
    {
        "name": "Magic Mobility",
        "target": "powers that move you and deal damage",
        "description": "At the halfway point of the power's movement, you can immediately cast a spell with a casting time of 1 action, spending spell slots as usual. Additionally, the power deals less dmg."
    },
    {
        "name": "Erratic Power",
        "target": "powers that move you without teleportation",
        "description": "The power's movement must now zig-zag, but it deals more dmg."
    },
    {
        "name": "Sluggish Surging",
        "target": "powers that move you",
        "description": "At the end of the power's movement, a wave of energy continues in the same direction, making spell atks against foes in a 30' line that deal barely any $nonPhysType dmg and make targets sluggish until the end of your next turn."
    },
    {
        "name": "Staggering Power",
        "target": "any power",
        "description": "Whenever the power hits, the target becomes staggered until the end of your next turn. Additionally, the power deals barely more dmg."
    },
    {
        "name": "Mobility",
        "target": "powers that move you",
        "description": "The power's max movement distance is doubled."
    },
    {
        "name": "Keen Warding",
        "target": "powers that make attacks",
        "description": "The power has +1 crit range and, whenever it scores a crit, you gain barely any temp HP."
    },
    {
        "name": "Empowerment",
        "target": "any power",
        "description": "While you are buffed, the power deals more dmg."
    },
    {
        "name": "Building Empowerment",
        "target": "powers that deal damage",
        "description": "Whenever you use the power, buffs on you have +1 effectiveness until you next lose a buff. Additionally, the power deals less dmg."
    },
    {
        "name": "Mobile Substitution",
        "target": "powers that move you and deal damage",
        "description": "At the end of the power's movement, you can immediately cast a spell with a casting time of 1 action for free. Additionally, the power deals no dmg."
    },
    {
        "name": "Incubating Empowerment",
        "target": "powers that deal damage",
        "description": "Whenever the power hits, buffs on you have +1 effectiveness until you next lose a buff. Additionally, the power deals less dmg."
    },
    {
        "name": "Mobile Power",
        "target": "powers that move you",
        "description": "If the power displaces you 15+', it deals more dmg."
    },
    {
        "name": "Crippled Power",
        "target": "powers that move you",
        "description": "The power deals substantially more dmg, but its max movement distance is halved."
    },
    {
        "name": "Invulnerable Mobility",
        "target": "powers that move you",
        "description": "You are immune to dmg during the power's movement."
    },
    {
        "name": "Flexible Mobility",
        "target": "powers that move you",
        "description": "You can take other actions midway through the power's movement."
    },
    {
        "name": "Massive Chaining",
        "target": "powers that chain",
        "description": "The power can chain 1 additional time.",
        "meta": "Abyssal Echoes"
    },
    {
        "name": "Insulated Power",
        "target": "powers that chain",
        "description": "The power deals massively more dmg, but no longer chains."
    },
    {
        "name": "Duplicating Rifts",
        "target": "powers with sphere areas",
        "description": "Whenever you use the power, an energy rift is opened at the its centre-point. At the start of your next turn, this rift will use the power centred on itself again before disappearing."
    },
    {
        "name": "Persistence",
        "target": "powers that create persistent areas",
        "description": "When the power's pers area ends, it ticks 1 more time."
    },
    {
        "name": "Contagion",
        "target": "powers that inflict DoTs",
        "description": "At the start of your next turn after using the power, its DoT spreads to all foes adj to its victims. Additionally, the power deals less dmg."
    },
    {
        "name": "Spreading",
        "target": "powers with areas that grow each round",
        "description": "The power's area grows further each round."
    },
    {
        "name": "Immediate Power",
        "target": "powers that inflict DoTs",
        "description": "The power deals massive additional $nonPhysType dmg when it succeeds at affecting its target, but deals substantially less DoT dmg."
    },
    {
        "name": "Slowing",
        "target": "any power",
        "description": "Whenever the power hits, the target has its speed halved until the end of your next turn."
    },
    {
        "name": "Empowering Strikes",
        "target": "any power",
        "description": "Whenever you use the power, your next melee power deals more dmg against debuffed targets."
    },
    {
        "name": "Merciful Alacrity",
        "target": "powers that apply debuffs",
        "description": "The power no longer applies debuffs, but instead for the duration the debuffs would have, you have +50' sp."
    },
    {
        "name": "Immediate Decay",
        "target": "powers that deal damage",
        "description": "Whenever the power hits a DoT'd target, the DoT ticks (including its exit conditions) infinitely until it is removed. Additionally, the power deals less dmg."
    },
    {
        "name": "Empowering Decay",
        "target": "powers that deal damage",
        "description": "Whenever you use the power, you gain increased DoT dmg and your wep powers have their usage times reduced by 1 step until the end of your next turn. Additionally, the power deals substantially less dmg."
    },
    {
        "name": "Empowered Erosion",
        "target": "powers that apply buffs",
        "description": "Whenever you hit while buffed by the power, the target is inflicted with a DoT dealing slight $nonPhysType dmg, stacking until CHA save."
    },
    {
        "name": "Enduring Shredding",
        "target": "powers that deal damage and apply debuffs which can be consumed early",
        "description": "The power's debuff also gives the target slightly increased $physType dmg taken, and the debuff can no longer be consumed early. Additionally, the power deals less dmg."
    },
    {
        "name": "Frail Decay",
        "target": "powers that inflict DoTs",
        "description": "The power's DoT is converted into a mark that causes the target to take the DoT's tick whenever they are hit. This still scales as if it were a DoT."
    },
    {
        "name": "Eroding Decay",
        "target": "powers that inflict DoTs",
        "description": "Creatures inflicted by the power's DoT have increased DoT dmg taken."
    },
    {
        "name": "Shredding Affliction",
        "target": "powers that inflict DoTs",
        "description": "Whenever you inflict a creature with the power's DoT, they have slightly increased phys dmg taken until the end of your next turn."
    },
    {
        "name": "Intense Affliction",
        "target": "powers that apply debuffs",
        "description": "The power's debuffs have +1 effectiveness."
    },
    {
        "name": "Forced Recovery",
        "target": "powers with a cooldown and a non-cooldown resource cost",
        "description": "The power no longer has a cooldown and deals more dmg, but its cost is increased by 2 steps."
    },
    {
        "name": "Persistent Awakening",
        "target": "powers that deal damage",
        "description": "Whenever you use the power, each allied pers area adj to you ticks. Additionally, the power deals less dmg."
    },
    {
        "name": "Projection",
        "target": "powers with self-burst areas",
        "description": "The power's self-burst area is converted into a sphere area that you can cast centred on any point you can see within 60' of you."
    },
    {
        "name": "Disruptive Traps",
        "target": "powers that lay traps",
        "description": "Whenever the power's trap is laid, it emits a disruptive wave that causes all foes adj to it to get barely reduced global dmg and barely increased phys dmg taken until the end of your next turn.",
        "meta": "Decoy"
    },
    {
        "name": "Tactical Haste",
        "target": "powers that apply debuffs",
        "description": "The power's debuffs also grant +20' sp to allies."
    },
    {
        "name": "Afflicted Shredding",
        "target": "powers that apply debuffs",
        "description": "The power's debuffs also give slightly increased phys dmg taken and their durations are 1 step longer. Additionally, the power's usage time is increased by 1 step."
    },
    {
        "name": "Terrifying Affliction",
        "target": "powers that apply debuffs",
        "description": "The power's debuffs also frighten the target until the end of their next turn."
    },
    {
        "name": "Reflective Obstacles",
        "target": "powers that form objs or structs",
        "description": "The power's objs and structs gain a massive amount of dmg thorns."
    },
    {
        "name": "Enduring Power",
        "target": "powers with a cooldown and a non-instantaneous duration",
        "description": "The power's duration is increased by 1 step and it deals more dmg, but its cooldown is increased by 1 step."
    },
    {
        "name": "Evasive Traps",
        "target": "powers that lay traps",
        "description": "While the power's trap is armed and not triggered, you have +1 to DEX saves."
    },
    {
        "name": "Trapped Decay",
        "target": "powers that lay traps and have a non-cooldown resource cost",
        "description": "At the start of each of your turns while the power's trap is armed and not triggered, it gives all adj foes a DoT dealing $nonPhysType dmg, stacking until DEX save. Additionally, the power's cost is increased by 1 step and it deals more dmg."
    },
    {
        "name": "Persistent Decay",
        "target": "powers that create persistent areas which can inflict DoTs",
        "description": "The power's persistent areas also apply DoTs on turn ends, but the DoTs deal less dmg."
    },
    {
        "name": "Destructive Traps",
        "target": "powers that lay traps",
        "description": "When the power's trap triggers, you gain increased crit dmg until the end of your next turn."
    },
    {
        "name": "Explosive Obstacles",
        "target": "powers that form objs or structs",
        "description": "Whenever the power's objs and structs are hit, they erupt in an explosion of energy, making wep atks against all adj foes that deal $nonPhysType dmg."
    },
    {
        "name": "Triggered Traps",
        "target": "powers that lay traps",
        "description": "Using the power again while it already has a trap armed but not triggered causes all of its armed traps to trigger, considering the nearest creature within 60' as the triggerer, where relevant."
    },
    {
        "name": "Compounding Efficiency",
        "target": "powers with a non-cooldown resource cost",
        "description": "The power's cost is reduced by 1 step if you have used it since the start of your last turn, unless that usage had its cost reduced by this effect."
    },
    {
        "name": "Massive Traps",
        "target": "powers that lay traps and have an area",
        "description": "The power's traps deal slightly more dmg and have slightly more area."
    },
    {
        "name": "Intense Traps",
        "target": "powers with a non-instantaneous duration that lay Traps",
        "description": "The power's traps deal massively more dmg, but their duration is reduced by 1 step."
    },
    {
        "name": "Summoning Traps",
        "target": "powers that lay traps",
        "description": "Whenever the power's traps trigger, they also summon a CR 1/8 construct minion."
    },
    {
        "name": "Trapped Ailments",
        "target": "powers that lay traps",
        "description": "Whenever the power's traps hit, they inflict a DoT dealing slight $nonPhysType dmg, stacking until DEX save."
    },
    {
        "name": "Overcharged Traps",
        "target": "powers with a non-cooldown resource cost that lay traps",
        "description": "The power's traps deal massively more dmg, but the power's cost is increased by 1 step."
    },
    {
        "name": "Clustered Traps",
        "target": "powers that lay traps",
        "description": "Whenever you lay the power's traps, you instead lay 1 additional trap and each one is shifted 5' in a random direction along its surface."
    },
    {
        "name": "Enduring Slowing",
        "target": "any power",
        "description": "Whenever the power hits, the target has its speed halved until CON save.",
        "meta": "Acid Flask"
    },
    {
        "name": "Slinging Accuracy",
        "target": "powers that throw",
        "description": "The power has +1 Accuracy."
    },
    {
        "name": "Frailty",
        "target": "any power",
        "description": "Whenever the power hits, the target gets slightly reduced global dmg until the end of your next turn."
    },
    {
        "name": "Overcharged Mass",
        "target": "powers with sphere areas and a non-cooldown resource cost",
        "description": "The power has massively more area, but its cost is increased by 1 step."
    },
    {
        "name": "Slinging Energy",
        "target": "powers that throw",
        "description": "The power deals additional $nonPhysType dmg."
    },
    {
        "name": "Rapid Slinging",
        "target": "powers that throw and deal damage",
        "description": "The power's usage time is reduced by 1 step, but it deals less dmg."
    },
    {
        "name": "Retaliation",
        "target": "powers with sphere areas that deal damage",
        "description": "The first time you are hit each round, you use the power centred on you. Additionally, the power deals less dmg."
    },
    {
        "name": "Enduring Affliction",
        "target": "powers that apply debuffs and deal damage",
        "description": "Debuffs inflicted by the power have their durations increased by 1 step, but the power deals less dmg."
    },
    {
        "name": "Overcharged Pooling",
        "target": "powers with a sphere area and a cooldown",
        "description": "The power's area leaves behind a pool of energy for the remainder of combat, a pers area that inflicts a DoT dealing slight $nonPhysType dmg, stacking until CON save. Additionally, the power's cooldown is increased by 1 step."
    },
    {
        "name": "Decaying Persistence",
        "target": "powers that create persistent areas",
        "description": "Whenever the power's pers areas tick, they give their targets increased DoT dmg taken until when their next tick would be."
    },
    {
        "name": "Persistent Affliction",
        "target": "powers that create persistent areas",
        "description": "Whenever you hit while standing in the power's pers areas, you inflict a DoT dealing slight $nonPhysType dmg, stacking until CON save."
    },
    {
        "name": "Building Haste",
        "target": "any power",
        "description": "Whenever you use the power, you gain +5' sp for the combat."
    },
    {
        "name": "Overcharged Bombardment",
        "target": "powers with sphere areas and a non-cooldown resource cost",
        "description": "The power's sphere areas are replicated, once immediately beyond its usual area from you, and once immediately before its usual area, closer to you. A creature can only be affected by a single area. Additionally, the power deals more dmg and its cost is increased by 1 step."
    },
    {
        "name": "Fanning Penetration",
        "target": "powers with line areas that originate from you",
        "description": "The power's line areas now run perpendicular to you, up to a distance away from you equal to the line's length."
    },
    {
        "name": "Great Power",
        "target": "any power",
        "description": "The power's hits deals additional $nonPhysType dmg while you are holding a 2h wep.",
        "meta": "Warpath"
    },
    {
        "name": "Echoing Mobility",
        "target": "powers that move you and deal damage",
        "description": "At the end of the power's movement, an illusory clone of you appears at the movement's halfway point that uses the power again without moving. This usage scales with your minion stats instead of your own. Additionally, the power deals less dmg."
    },
    {
        "name": "Close Cruelty",
        "target": "powers with a melee range",
        "description": "The power deals more dmg against bloodied targets."
    },
    {
        "name": "Summoning Mobility",
        "target": "powers that move you",
        "description": "At the end of the power's movement, you summon a Flying Sword, a CR 1/8 construct minion with a fly (hover) speed."
    },
    {
        "name": "Mobile Summoning",
        "target": "powers with line areas that originate from you",
        "description": "At the halfway point of the power's movement, you summon a Flying Sword, a CR 1/8 construct minion with a fly (hover) speed."
    },
    {
        "name": "Incubating Mobility",
        "target": "powers that move you",
        "description": "At the end of the power's movement, you unleash a circular attack, making a wep atk against all foes in a radius equal to half the distance the power moved you. The atk deals slight $physType dmg."
    },
    {
        "name": "Exposed Efficiency",
        "target": "powers with a non-cooldown resource cost that require concentration",
        "description": "The power's cost is reduced by 1 step, but you have slgihtly increased non-phys dmg taken while concentrating on it."
    },
    {
        "name": "Massive Channeling",
        "target": "powers with an area that require concentration and have a non-cooldown resource cost",
        "description": "At the start of each of your turns while concentrating on the power, the power gains slightly more dmg and more area, stacking until you lose concentration on it. Additionally, the power's cost is increased by 1 step."
    },
    {
        "name": "Enduring Exsanguination",
        "target": "any power",
        "description": "Whenever the power hits, the target is inflicted with a DoT dealing 0 $physType dmg, stacking until CON save. Additionally, any debuffs the power applies have +1 to their ongoing DCs."
    },
    {
        "name": "Cruel Combat",
        "target": "powers with a melee range",
        "description": "The power deals barely increased dmg against debuffed targets. Additionally, any debuffs the power apply have +1 effectiveness."
    },
    {
        "name": "Channeled Magic",
        "target": "powers that require concentration",
        "description": "While concentrating on the power, your spell hits deal more dmg."
    },
    {
        "name": "Magical Channeling",
        "target": "powers that require concentration and deal damage",
        "description": "At the start of each of your turns while concentrating on the power, you can immediately cast a spell with a casting time of 1 action, spending spell slots as usual. Additionally, the power deals massively less dmg."
    },
    {
        "name": "Channeled Healing",
        "target": "powers that require concentration",
        "description": "At the start of each of your turns while concentrating on the power, you and allies within the power's area are healed barely any HP."
    },
    {
        "name": "Mobile Decay",
        "target": "powers that move you",
        "description": "As the power moves you, you leave behind a trail of energy whenever you exit a space that lasts for the remainder of combat. The trail is a persistent area that only affects foes and inflicts a DoT dealing barely any $nonPhysType dmg, stacking until DEX save."
    },
    {
        "name": "Offence",
        "target": "any power",
        "description": "The power deals more dmg while you are either holding a 2h wep or dual-wielding."
    },
    {
        "name": "Great Mass",
        "target": "any power",
        "description": "The power has increased area while you are holding a 2h wep."
    },
    {
        "name": "Great Recovery",
        "target": "powers with a non-cooldown resource cost that require concentration and deal damage",
        "description": "At the start of each of your turns while concentrating on the power, recover 1 unit of the power's cost if you are holding a 2h wep. Additionally, the power deals less dmg."
    },
    {
        "name": "Channeled Defence",
        "target": "powers that require concentration",
        "description": "While concentrating on the power, you gain +1 AC and a slight amount of dmg barrier."
    },
    {
        "name": "Keen Healing",
        "target": "powers that require concentration",
        "description": "Whenever the power crits, you heal a slight amount of HP.",
        "meta": "Flurry"
    },
    {
        "name": "Powerful Incubation",
        "target": "single-target powers with multiple hits in the same action",
        "description": "The power's first two hits deal less dmg, but the third deals massively more dmg."
    },
    {
        "name": "Flurried Slowing",
        "target": "single-target powers with multiple hits in the same action",
        "description": "The power's third hit halves the target's speed until the end of your next turn."
    },
    {
        "name": "Close Waves",
        "target": "powers with a melee range",
        "description": "Whenever the power hits, a wave of power follows through, making a wep atk against any foes in the space on the other side of the target, dealing $physType dmg on a hit."
    },
    {
        "name": "Length",
        "target": "powers with line areas",
        "description": "The power has more area."
    },
    {
        "name": "Varied Affliction",
        "target": "single-target powers with multiple hits in the same action that deal damage",
        "description": "The power's first hit inflicts a DoT dealing slight $nonPhysType dmg, stacking until CON save. The power's second hit inflicts a DoT dealing barely any $physType dmg, stacking until CON save. The power's third hit gives the target barely increased {nonPhysType} and {physType} dmg taken until the end of your next turn. Additionally, the power deals less dmg."
    },
    {
        "name": "Relentless Alacrity",
        "target": "powers that deal damage",
        "description": "If you hit with the power during your last turn, the power's usage time is reduced by 1 step. Additionally, the power deals less dmg."
    },
    {
        "name": "Relentless Power",
        "target": "powers with an accuracy component",
        "description": "If you hit with the power during your last turn, the power deals more dmg and its usage time is reduced by 1 step. Additionally, the power has -2 Accuracy."
    },
    {
        "name": "Relentless Exsanguination",
        "target": "any power",
        "description": "If you hit with the power during your last turn, the power's hits inflict a DoT dealing slight $nonPhysType dmg, stacking until CON save."
    },
    {
        "name": "Enduring Boons",
        "target": "any power",
        "description": "Any 1rnd duration buffs the power grants you last 1 additional round."
    },
    {
        "name": "Brief Boons",
        "target": "any power",
        "description": "Any 1rnd duration buffs the power grants you have +1 effectiveness."
    },
    {
        "name": "Relentless Assassination",
        "target": "any power",
        "description": "If you hit with the power during your last turn, the power deals more dmg against bosses."
    },
    {
        "name": "Overcharged Channelling",
        "target": "powers with an instantaneous duration and a non-cooldown resource cost",
        "description": "The power's duration becomes 'Concentration, up to 1 minute', and you can reactivate its effect as its usage time throughout the duration. Additionally, its cost is increased by 1 step and it deals more dmg."
    },
    {
        "name": "Defensive Channelling",
        "target": "any power",
        "description": "While concentrating on the power, you have substantially more $physType barrier and more non-phys barrier."
    },
    {
        "name": "Channeled Strikes",
        "target": "powers with a non-cooldown resource cost that require reactivation each round",
        "description": "While you are holding a $weaponClass wep, every 2nd reactivation of the power is replaced with another weapon power of your choice that has a usage time of 1 action, for no change in resource cost. Additionally, the power deals substantially more dmg and its cost is increased by 1 step."
    },
    {
        "name": "Haste",
        "target": "powers with an accuracy component",
        "description": "While you are holding a $weaponClass wep, the power's usage time is reduced by 1 step, but it has -1 Accuracy."
    },
    {
        "name": "Powerful Development",
        "target": "powers that require concentration",
        "description": "At the start of each of your turns while concentrating on the power, the power gains slightly more dmg, stacking until you lose concentration on it."
    },
    {
        "name": "Flurried Leeching",
        "target": "single-target powers with multiple hits in the same action",
        "description": "Whenever the power hits, you heal a slight amount of HP."
    },
    {
        "name": "Leeching",
        "target": "any power",
        "description": "Whenever the power hits, you heal a slight amount of HP."
    },
    {
        "name": "Recovery",
        "target": "powers with a non-cooldown resource cost that deal damage",
        "description": "Whenever the power hits, you recover 1 unit of its cost. Additionally, it deals less dmg."
    },
    {
        "name": "Murderous Bursting",
        "target": "powers that deal damage",
        "description": "Whenever the power scores a killing blow, a burst of power is released around the corpse, making a wep atk against all foes adj to the corpse that deals substantial $physType dmg. Additionally, the power deals less dmg."
    },
    {
        "name": "Improved Shielding",
        "target": "powers that grant temporary hit points",
        "description": "The power grants more temp HP.",
        "meta": "Soul Feast"
    },
    {
        "name": "Shielding Revolution",
        "target": "powers that grant temporary hit points",
        "description": "The power grants more temp HP when a boss is within 60' of you."
    },
    {
        "name": "Shielding Recovery",
        "target": "powers with a non-cooldown resource cost that grant temporary hit points",
        "description": "Whenever the power grants you temp HP while a boss is within 60' of you, you also recover 1 unit of its cost. Additionally, the power grants less temp HP."
    },
    {
        "name": "Healing Shielding",
        "target": "powers that grant temporary hit points",
        "description": "The temp HP the power grants is converted into healing HP, but it grants less temp HP."
    },
    {
        "name": "Decaying Leeching",
        "target": "any power",
        "description": "Whenever the power hits, the target is inflicted with a DoT dealing barely any $physType dmg, stacking until CON save. Whenever this DoT ticks, you heal barely any HP."
    },
    {
        "name": "Murderous Splattering",
        "target": "powers that deal damage",
        "description": "Whenever the power scores a killing blow, a splatter of power erupts from the corpse, making a spell atk against all foes adj to it, dealing substantial $physType dmg on a hit. Additionally, the power deals less dmg."
    },
    {
        "name": "Powerful Siphoning",
        "target": "powers that grant temporary hit points",
        "description": "The power deals substantially more dmg, but grants less temp HP."
    },
    {
        "name": "Efficient Forking",
        "target": "powers with a specific number of targets above 1 and a non-cooldown resource cost that deal damage",
        "description": "The power's cost is reduced by 1 step and it can target 1 additional entity. Additionally, the power deals massively less dmg."
    },
    {
        "name": "Intense Duplication",
        "target": "powers with an instantaneous duration and a non-cooldown resource cost",
        "description": "Whenever you finish using the power, it is immediately reused. Additionally, the power deals more dmg and its cost is increased by 1 step."
    },
    {
        "name": "Ailed Shredding",
        "target": "powers that apply debuffs",
        "description": "The power's debuffs are converted into '+1 phys dmg taken for 1 round'."
    },
    {
        "name": "Virulence",
        "target": "any power",
        "description": "Whenever you use the power, your hits for the next round inflict a DoT dealing $nonPhysType dmg, stacking until CON save. Additionally, whenever you use the power, you are inflicted with a DoT dealing slight {type} dmg, stacking until CON save."
    },
    {
        "name": "Merciful Defence",
        "target": "any power",
        "description": "Whenever the power hits, all of your debuffs on the target are removed and you gain a massive amount of phys and $dmgType barrier until the end of your next turn for each."
    },
    {
        "name": "Rapid Efficiency",
        "target": "powers with a non-cooldown resource cost that deal damage",
        "description": "The power's usage time and resource cost are both reduced by 1 step, but it deals massively reduced damage."
    },
    {
        "name": "Decay",
        "target": "any power",
        "description": "Whenever the power hits, the target is inflicted with a DoT dealing slight $nonPhysType dmg, stacking until CHA save."
    },
    {
        "name": "Sacrificial Control",
        "target": "any power",
        "description": "Whenever you score a killing blow with the power against a debuffed target, your minions gain substantially increased dmg until the end of their next turn."
    },
    {
        "name": "True Decay",
        "target": "powers that inflict DoTs",
        "description": "The power's DoTs ignore damage resistances."
    },
    {
        "name": "Soul Conversion",
        "target": "any power",
        "description": "Whenever you score a killing blow with the power against a debuffed target, they are reanimated as a Soul Wisp, a CR 2 undead minion, that disappears on combat end."
    },
    {
        "name": "Flexible Eruption",
        "target": "powers with self-burst areas that require targets to be debuffed in some way and deal damage",
        "description": "The power no longer requires its targets to be debuffed in any way and its self-burst areas are converted into cones with length equal to the bursts' ranges. Additionally, the power deals less damage."
    },
    {
        "name": "Telekinetic Haste",
        "target": "powers that move objects and deal damage",
        "description": "The power can move objects double its usual distance. Additionally, whenever you use the power, you gain +10' speed until the end of your next turn. Additionally, the power deals less damage."
    },
    {
        "name": "Blunt Shielding",
        "target": "powers that grant temporary hit points and deal damage",
        "description": "The power grants substantially more temp HP, but deals less damage."
    },
    {
        "name": "Accuracy",
        "target": "any power",
        "description": "The power has +1 Accuracy.",
        "meta": "Multishot"
    },
    {
        "name": "Enduring Torment",
        "target": "powers that deal damage",
        "description": "The power's debuffs and DoTs have their durations increased by 1 step, but the power's dmg is massively reduced."
    },
    {
        "name": "Prolonged Affliction",
        "target": "any power",
        "description": "Whenever the power hits, all debuffs on the target have their remaining durations reset to their maximum duration."
    },
    {
        "name": "Shotgunning",
        "target": "powers with cone areas that deal damage",
        "description": "The power's cone areas affect targets adj to their origin twice and any debuffs they inflict have +1 to their DCs, but the power deals substantially less dmg."
    },
    {
        "name": "Focus",
        "target": "any power",
        "description": "The power deals more dmg if you haven't moved since the start of your last turn."
    },
    {
        "name": "Prepared Motion",
        "target": "any power",
        "description": "After using the power when you haven't moved since the start of your last turn, gain +10' sp until the end of your next turn."
    },
    {
        "name": "Pure Decay",
        "target": "any power",
        "description": "Any debuffs the power inflicts are converted into individual stacks of a DoT dealing slight $nonPhysType, stacking until CON save."
    },
    {
        "name": "Repeating",
        "target": "any power",
        "description": "Every 2 times you use the power, it is repeated once at no additional cost."
    },
    {
        "name": "Impatience",
        "target": "powers that change over their duration",
        "description": "The power starts as if it had been active for 1 round already."
    },
    {
        "name": "Fervour",
        "target": "powers that deal damage",
        "description": "The power's usage time is reduced by 1 step and you gain +10' sp until the end of your next turn whenever you use it, but it deals substantially less dmg."
    },
    {
        "name": "Close Eruption",
        "target": "powers with cone areas of size 30' or larger",
        "description": "The power's cone areas deal substantially more dmg against creatures adj to their origins, and less dmg against creatures 30+' away from their origins."
    },
    {
        "name": "Splintering",
        "target": "powers with cone areas and a non-cooldown resource cost",
        "description": "On making a proj atk, the power is also used in the same direction. The power also has +1 to its debuff DCs and has its resource cost increased by 1 step."
    },
    {
        "name": "Focused Eruption",
        "target": "powers with cone areas",
        "description": "The power's cone areas deal substantially more dmg but are smaller."
    },
    {
        "name": "Heavy Power",
        "target": "any power",
        "description": "The power's cone areas deal massively more dmg, but its usage time is increased by 1 step."
    },
    {
        "name": "Shoving Eruption",
        "target": "powers with cone areas",
        "description": "Whenever the power's cone areas hit, the target is pushed 10' away from the cone's origin."
    },
    {
        "name": "Desperate Eruption",
        "target": "powers with cone areas and a non-cooldown resource cost",
        "description": "The power can be used with no cost if you cannot afford its cost, but when you do so it can only target a single creature within its original area."
    },
    {
        "name": "Volleying",
        "target": "powers that fire a single projectile",
        "description": "The power's proj is converted into a 15'-wide line with a length equal to the proj's range.",
        "meta": "Runebolt"
    },
    {
        "name": "Accurate Fanning",
        "target": "powers that fire a single projectile and deal damage",
        "description": "The power's proj is converted into a cone with length equal to the original proj's range and has +1 Accuracy, but deals less dmg."
    },
    {
        "name": "Infused Volleying",
        "target": "powers that fire a single projectile",
        "description": "While in a pers area, the power's proj is converted into a 25'-wide line with a length equal to the original proj's range."
    },
    {
        "name": "Prismatic Recovery",
        "target": "powers with multiple damage type options and a non-cooldown resource cost",
        "description": "Whenever the power hits with its first dmg type option, you heal a slight amount of HP. With its second option, you gain temp HP. With its third option, you recover 1 unit of its resource cost but deal less dmg."
    },
    {
        "name": "Dedication",
        "target": "powers with a non-cooldown resource cost and an Accuracy component",
        "description": "If the last 3 powers you used were the power, the power ignores dmg res and immunity, deals barely more dmg, heals you for barely any HP, grants you a slight amount of temp HP, and recovers 1 unit of its resource cost. Additionally, the power has -2 Accuracy."
    },
    {
        "name": "Infusion",
        "target": "powers that fire projectiles",
        "description": "Whenever the power's projs pass through a pers area, they come out dealing substantially more dmg and with +1 Accuracy. Additionally, the power's usage time is increased by 1 step."
    },
    {
        "name": "Supported Force",
        "target": "any power",
        "description": "The power deals additional $physType dmg while you are adj to another player character."
    },
    {
        "name": "Runecrafting",
        "target": "powers with a non-cooldown resource cost that fire projectiles",
        "description": "If you don't have an active runestone, instead of firing projs, the power lays a tiny runestone on an unoccupied space you can see within the original proj's range. If you already have an active runestone, the power's projs are fired from the runestone instead of you (using the stone's LoS) and deal massively more dmg with +2 Accuracy. At the end of combat, the runestone expires and you lose 1 unit of the power's resource cost."
    },
    {
        "name": "Infused Projection",
        "target": "powers that summon entities that can deal your damage remotely",
        "description": "1/rnd, when you use the power while buffed, all buffs on you are consumed to give the summoned entity substantially more dmg and increase its reach by 5' while it is dealing your dmg."
    },
    {
        "name": "Channeled Projection",
        "target": "powers that require concentration",
        "description": "On turn start while concentrating on the power, your nearest summoned entity that can deal your damage remotely gains increased dmg for its next activation."
    },
    {
        "name": "Detonating Missiles",
        "target": "powers that fire projectiles",
        "description": "Whenever the power's projs hit either a creature, obj, or structure, they explode, making a spell atk against all foes adj to the collision point (other than a hit creature) that deals 1d4 dmg of the proj's base type."
    },
    {
        "name": "Infused Explosions",
        "target": "powers with sphere areas",
        "description": "The power's sphere areas have more area if you have barrier specifically for their base dmg types."
    },
    {
        "name": "Warding Recovery",
        "target": "powers with a non-cooldown resource cost that deal damage",
        "description": "Whenever the power hits, you recover 1 unit of its cost and gain temp HP whenever you use a limited power until the end of your next turn. Additionally, the power deals substantially less dmg."
    },
    {
        "name": "Supported Precision",
        "target": "powers that apply buffs",
        "description": "While buffed by the power, your other powers have +1 crit range."
    },
    {
        "name": "Supported Adaptation",
        "target": "powers that apply buffs",
        "description": "While buffed by the power, you treat all increased dmg taken on creatures as always matching your dmg."
    },
    {
        "name": "Supported Prismatism",
        "target": "powers that deal damage",
        "description": "While offensively buffed, the power's hits inflict a DoT dealing slight $nonPhysType dmg, stacking until DEX save. While buffed by an aura, the power's hits give slightly increased $nonPhysType dmg taken until the end of your next turn. While defensively buffed, the power's hits inflict a DoT dealing slight $nonPhysType dmg, stacking until CON save. Additionally, the power deals substantially less dmg."
    },
    {
        "name": "Incubating Chaos",
        "target": "any power",
        "description": "Whenever the power hits, the next limited power you use triggers a Wild Magic Surge."
    },
    {
        "name": "True Power",
        "target": "any power",
        "description": "The power's base dmg is converted to true. Additionally, it deals more dmg."
    },
    {
        "name": "Consistency",
        "target": "any power",
        "description": "The power always deals the same base dmg type as the base dmg type of the last power you used. Additionally, it deals more dmg."
    },
    {
        "name": "Swiftness",
        "target": "powers that deal damage",
        "description": "The power's usage time is reduced by 1 step and whenever you use it, you gain +10' sp for 1 round. Additionally, its dmg is substantially reduced."
    },
    {
        "name": "True Divinity",
        "target": "any power",
        "description": "The power's base dmg is converted to true. Additionally, whenever your party uses (and accepts the results of) a shrine, the power gains +1 dmg."
    },
    {
        "name": "Monochromaticism",
        "target": "powers with multiple damage type options",
        "description": "Upon upgrading the power, choose one of its dmg type options - it always uses that dmg type, but its dmg is increased."
    },
    {
        "name": "Desperate Command",
        "target": "powers that apply buffs",
        "description": "While the power is buffing a minion, it gains +1 buff effectiveness while the minion is bloodied.",
        "meta": "Dread Shade"
    },
    {
        "name": "Draining Explosions",
        "target": "powers that apply buffs",
        "description": "Minions buffed by the power lose barely any passive regen and if they die while buffed, the buff explodes and you make a spell atk against all foes adj to the corpse that deals massive $nonPhysType dmg."
    },
    {
        "name": "Massive Command",
        "target": "powers that apply buffs",
        "description": "The power has more area that only affects minions."
    },
    {
        "name": "Ethereal Persistence",
        "target": "powers that create persistent areas that deal damage",
        "description": "The power's pers areas no longer deal dmg to minions, have their durations increased by 1 step, and are substantially smaller. Additionally, any increases to the pers areas' dmg are converted into increased dmg taken by minions inside."
    },
    {
        "name": "Quickening Command",
        "target": "powers that apply buffs",
        "description": "Minions buffed by the power have their power usage times decreased by 1 step, but they deal less dmg."
    },
    {
        "name": "Powerful Command",
        "target": "powers that apply buffs",
        "description": "The power has more area that only affects minions and grants minions buffed by it more dmg, but the minions lose barely any passive regen."
    },
    {
        "name": "Borrowed Blessings",
        "target": "powers that apply buffs",
        "description": "Whenever the power's buffs end, foes and minions adj to the buffed creature are cursed with increased global dmg taken until CHA save."
    },
    {
        "name": "Sacrificial Command",
        "target": "powers that apply buffs",
        "description": "Whenever a minion buffed by the power dies, another minion within 60' of it of your choice also dies, exploding. You make a spell atk against all foes adj to this corpse dealing massive B dmg."
    },
    {
        "name": "Shared Command",
        "target": "powers that apply buffs",
        "description": "While the power is buffing a minion and not you, you also receive all effects of the buff. Additionally, the buff has -1 effectiveness."
    },
    {
        "name": "Commanding Beacons",
        "target": "powers that apply buffs",
        "description": "While the power is buffing a foe, it does not grant that foe any of its effects, but instead radiates an aura that grants its effects to all minions within 60' of that foe. Additionally, the buff's duration is reduced by 1 step and it has +1 effectiveness."
    },
    {
        "name": "Decaying Command",
        "target": "powers that apply buffs",
        "description": "Minions buffed by the power inflict a DoT on hit dealing slight $nonPhysType dmg, stacking until CHA save."
    },
    {
        "name": "Afflicted Persistence",
        "target": "powers that create persistent areas",
        "description": "At the start of each of your turns, the power's pers areas inflict a DoT dealing $nonPhysType dmg, stacking until CHA save, to all foes and minions within their areas."
    },
    {
        "name": "Blinding Command",
        "target": "powers that apply buffs",
        "description": "Minions buffed by the power have their power usage times decreased by 1 step and are blinded."
    },
    {
        "name": "Commanding Persistence",
        "target": "powers that create persistent areas",
        "description": "The power's pers areas deal slightly less dmg to minions, and any minions inside them deal slight additional $nonPhysType dmg with hits."
    },
    {
        "name": "Focused Command",
        "target": "powers that apply buffs in an area",
        "description": "The power can now only buff a single minion within its area, but while the minion is buffed by the power, it deals massively more dmg."
    },
    {
        "name": "Keen Command",
        "target": "powers with no cooldown that apply buffs",
        "description": "Minions buffed by the power always crit, but the power now can only be used once per combat."
    },
    {
        "name": "Totemic Command",
        "target": "powers that apply buffs",
        "description": "Minions buffed by the power have their sp reduced to 0 and continuously taunt all foes within 60' of them. Additionally, they have +2 AC."
    },
    {
        "name": "Ethereal Decay",
        "target": "powers that create persistent areas",
        "description": "The power's pers areas no longer deal dmg to minions, but instead inflict a DoT dealing $nonPhysType dmg, stacking until CON save, on them on each tick."
    },
    {
        "name": "Undying Command",
        "target": "powers that apply buffs",
        "description": "Undead minions buffed by the power deal more dmg."
    },
    {
        "name": "Inverted Command",
        "target": "powers that apply buffs in an area",
        "description": "The power's area is larger, but its buffs no longer apply to minions inside its area. Instead, relevant minions outside its area are affected."
    },
    {
        "name": "Stable Empowerment",
        "target": "powers that apply buffs and require concentration",
        "description": "You can concentrate on the power twice, but it has -1 buff effectiveness."
    },
    {
        "name": "Hastening Command",
        "target": "powers that apply buffs",
        "description": "Whenever you buff a minion with the power, they have their power usage times reduced by 1 step for 1 round. Additionally, the power has -1 buff effectiveness."
    },
    {
        "name": "Decaying Haste",
        "target": "powers that apply buffs",
        "description": "Minions buffed by the power have +20' sp, but are inflicted with a DoT dealing slight $nonPhysType dmg, stacking until DEX save, at the start of each of your turns"
    },
    {
        "name": "Necromantic Command",
        "target": "powers that apply buffs",
        "description": "Whenever a minion buffed by the power dies, you summon a CR 1/4 energy zombie minion from its corpse that deals $nonPhysType dmg. Additionally, the power has -1 buff effectiveness."
    },
    {
        "name": "Synergistic Empowerment",
        "target": "powers that apply buffs",
        "description": "Whenever you use the power, the duration of another of your buffs of your choice is refreshed. Additionally, the power has -1 buff effectiveness."
    },
    {
        "name": "Draining Armour",
        "target": "powers that apply buffs",
        "description": "Minions buffed by the power have massively more phys barrier and deal more dmg, but have barely reduced passive regen."
    },
    {
        "name": "Lingering Decay",
        "target": "powers that apply buffs",
        "description": "Whenever the power's buffs expire, a foe of your choice adj to the buff's target is inflicted with a DoT dealing slight $nonPhysType dmg, stacking until CHA save."
    },
    {
        "name": "Empowering Summons",
        "target": "powers that summon minions",
        "description": "The power's minions' buffs have +1 effectiveness.",
        "meta": "Summon Frenzy Totem"
    },
    {
        "name": "Berserking",
        "target": "any power",
        "description": "Whenever you use the power, you gain the following effects for 1rnd: increased dmg, the usage times of your melee atks are reduced by 1 step, and you take substantially increased dmg."
    },
    {
        "name": "Summoned Power",
        "target": "any power",
        "description": "Whenever you use the power, your minions add additional $physType dmg to their melee hits for 1rnd."
    },
    {
        "name": "Manifestation",
        "target": "any power",
        "description": "Whenever you use the power, your crystal has a chance to flare."
    },
    {
        "name": "Manifested Empowerment",
        "target": "powers that summon minions",
        "description": "While you have an active minion from the power, whenever your crystal flares, you and allies within 60' of you gain +1 crit range for 1rnd."
    },
    {
        "name": "Duplicated Manifestation",
        "target": "powers that summon minions",
        "description": "While you have an active minion from the power, your crystals flare an additional time whenever they flare."
    },
    {
        "name": "Massive Manifestation",
        "target": "powers that summon minions",
        "description": "While you have an active minion from the power, the areas of your crystal flares are substantially larger."
    },
    {
        "name": "Empowered Decaying [next - Revitalising Totem]",
        "target": "powers that summon minions",
        "description": "Creatures buffed by the power's minions inflict a DoT on hit, dealing slight $nonPhysType dmg, stacking until CON save."
    }
]