[
    {
        "name": "Prismatic Power",
        "target": "powers that deal $dmgType damage",
        "description": "The power deals additional $dmgType {must be different} damage."
    },
    {
        "name": "Cleaving",
        "target": "powers with an Accuracy component",
        "description": "Whenever the power's Accuracy component succeeds, you may replicate its effects to another creature of your choice adjacent to the target."
    },
    {
        "name": "Sacrificial Channeling",
        "target": "powers that require concentration",
        "description": "The power no longer requires concentration, but while it is active, all damage you take is slightly increased."
    },
    {
        "name": "Totems",
        "target": "powers that don't require concentration",
        "description": "Instead of its usual effect, the power summons a totem in an unoccupied space that you can see within 60' of you. The totem is a CR 1/2 minion with 0 speed that has only one action, which is to use the original power. The power now requires concentration."
    },
    {
        "name": "Reaping",
        "target": "powers with melee range that deal damage",
        "description": "The power's reach is increased by 5' and it deals more damage against bloodied targets. Additionally, whenever the power scores a killing blow, roll a d4 to determine which of the following buffs to gain until you take a long rest: 1 - +1 Accuracy; 2 - increased max/current HP; 3 - +1 Defence; 4 - more damage."
    },
    {
        "name": "Cruelty",
        "target": "powers that deal damage and do not apply DoTs",
        "description": "The power cannot apply DoTs, but it deals more damage against targets affected by a DoT."
    },
    {
        "name": "Desperation",
        "target": "powers that deal damage",
        "description": "While you are bloodied, the power deals more damage."
    },
    {
        "name": "Monochromatic Power",
        "target": "powers that deal $dmgType damage",
        "description": "The power deals more damage, but can only deal {type} damage."
    },
    {
        "name": "Potent Decay",
        "target": "powers that apply DoTs",
        "description": "The power's DoTs deal more damage."
    },
    {
        "name": "Triggering Execution",
        "target": "any power",
        "description": "Whenever the power scores a killing blow, you may immediately use another power that has a usage time of 1 action or faster as a free action."
    },
    {
        "name": "Triggering Thorns",
        "target": "powers with a usage time of 1 action or faster",
        "description": "Whenever you substantially fail a saving throw or are substantially hit by an attack, you may immediately use the power as a free action."
    },
    {
        "name": "Decay",
        "target": "powers that hit",
        "description": "Whenever the power hits, the target gains a DoT dealing slight $dmgType damage, stacking until CON save."
    },
    {
        "name": "Prismatic Conversion",
        "target": "powers that deal $dmgType damage",
        "description": "The power's base damage is converted to $dmgType {must be different} and it deals more damage."
    },
    {
        "name": "Focused Decay",
        "target": "powers that hit",
        "description": "Whenever the power hits, the target gains a DoT dealing $dmgType damage, stacking until CON save. Additionally, the power deals less damage."
    },
    {
        "name": "Sacrificial Empowerment",
        "target": "powers with a resource cost that apply buffs",
        "description": "The power's resource cost is replaced with a hit point cost equal to 6 times the original value. Additionally, your first hit of each turn (you can choose which hit in the case of multiple instantaneous hits) while you are buffed by the power applies a DoT dealing barely any $dmgType damage, stacking until CON save."
    },
    {
        "name": "Balanced Decay",
        "target": "powers that hit and apply DoTs",
        "description": "The power deals slightly more hit damage and slightly more damage with its DoTs."
    },
    {
        "name": "Untouched Power",
        "target": "powers that deal damage",
        "description": "The power deals substantially more damage while you are on full HP."
    },
    {
        "name": "Focused Stability",
        "target": "powers with a resource cost that require concentration",
        "description": "Your concentration on the power cannot be broken against your will and its effectiveness is increased by 4 steps, but its resource cost is increased by 1 step and its duration is reduced by 1 step."
    },
    {
        "name": "Power",
        "target": "powers that deal damage",
        "description": "The power deals more $dmgType damage."
    },
    {
        "name": "Ascendance",
        "target": "powers that upcast",
        "description": "The power is automatically upcast 1 level."
    },
    {
        "name": "Protected Sapping",
        "target": "powers that apply debuffs",
        "description": "Whenever the power debuffs a creature, you gain damage barrier for the remainder of combat."
    },
    {
        "name": "Stability",
        "target": "powers that require concentration",
        "description": "Your concentration on the power cannot be broken against your will."
    },
    {
        "name": "Penetration",
        "target": "powers that deal damage",
        "description": "The power ignores $dmgType resistance."
    },
    {
        "name": "Mass",
        "target": "powers with an area that deal damage",
        "description": "The power deals substantially more damage and has more area, but its usage time is increased by 1 step."
    },
    {
        "name": "Volatile Summons",
        "target": "powers that summon damageable minions",
        "description": "Whenever the power's minions take damage, they unleash an explosion of energy, making a spell attack against all foes adjacent to them that deals substantial $dmgType damage."
    },
    {
        "name": "Protection",
        "target": "powers that hit",
        "description": "Whenever the power hits, you gain a substantial amount of damage barrier for 1 round."
    },
    {
        "name": "Selflessness",
        "target": "powers that can apply buffs to you",
        "description": "The power cannot apply buffs to you, but it has +1 buff effectiveness."
    },
    {
        "name": "Delegated Channeling",
        "target": "powers that require concentration",
        "description": "Your concentration on the power cannot be broken against your will and its effectiveness is increased by 1 step, but it can only remain active while you have an active minion. Each of your active minions have a DoT while the power is active that deals $dmgType damage."
    },
    {
        "name": "Endurance",
        "target": "powers with a non-instantaneous duration that deal damage",
        "description": "The power's duration is increased by 1 step, but it deals less damage."
    },
    {
        "name": "Keen Incubation",
        "target": "powers with a resource cost that make attacks",
        "description": "The power's resource cost is reduced by 1 step and whenever you use it during combat, it gains +1 crit range, stacking until the end of combat. Additionally, the power has -3 crit range."
    },
    {
        "name": "Transfiguration",
        "target": "powers governed by $ability",
        "description": "The power's governing ability becomes $ability {must be different}."
    },
    {
        "name": "Propulsion",
        "target": "powers that hit",
        "description": "Whenever the power hits, the target is pushed 10' away from you."
    },
    {
        "name": "Bursting",
        "target": "powers with a non-instantaneous duration that deal damage",
        "description": "The power's duration is reduced by 1 step, but it deals massively more damage."
    },
    {
        "name": "Leeching",
        "target": "powers that hit",
        "description": "Whenever the power hits, you heal a slight amount of HP."
    },
    {
        "name": "Sacrifice",
        "target": "powers with a resource cost",
        "description": "The power's resource cost is replaced with a hit point cost equal to 5 times the original value."
    },
    {
        "name": "Shattering",
        "target": "powers that hit and deal damage",
        "description": "Whenever the power hits, the target becomes sluggish and they take a slight amount of additional damage from all sources for 1 round. Additionally, the power deals less damage."
    },
    {
        "name": "Intentionality",
        "target": "powers that deal damage",
        "description": "The power's usage time is increased by 1 step, but it deals massively more damage."
    },
    {
        "name": "Explosive Power",
        "target": "powers that deal damage",
        "description": "The power splashes damage."
    },
    {
        "name": "Potent Summons",
        "target": "powers that summon minions",
        "description": "The power's minions have +1 Accuracy and +1 Defence, but they deal less damage."
    },
    {
        "name": "Alacrity",
        "target": "powers that deal damage",
        "description": "The power's usage time is reduced by 1 step, but it deals less damage."
    },
    {
        "name": "Barraging",
        "target": "powers tht hit and deal damage",
        "description": "Whenever the power hits, it gains a slight amount of additional $dmgType damage, stacking until you go a full round without the power hitting."
    },
    {
        "name": "Ebbing",
        "target": "powers that hit and deal damage",
        "description": "Every other time the power hits, it deals more damage and debilitates for 1 round."
    },
    {
        "name": "Eruption",
        "target": "powers that hit",
        "description": "The power's first hit of each turn (you can choose which hit in the case of multiple instantaneous hits) erupts with energy. Make an attack against all foes adjacent to the target that deals $dmgType damage."
    },
    {
        "name": "Crippling",
        "target": "powers that hit",
        "description": "Whenever the power hits, the target is $condition for 1 round."
    },
    {
        "name": "Recoil",
        "target": "powers that hit",
        "description": "Whenever the power hits, it gains a slight amount of additional $dmgType damage for the remainder of combat and you immediately take {type} damage. Additionally, the power's hits debilitate the target for 1 round."
    },
    {
        "name": "Sudden Empowerment",
        "target": "powers with a cooldown that apply buffs",
        "description": "The power's cooldown is increased by 1 step, but its usage time is reduced by 1 step. Additionally, it has +1 buff effectiveness."
    },
    {
        "name": "Volatility",
        "target": "powers that deal damage",
        "description": "The power deals more damage, and its damage is now based on d20s."
    },
    {
        "name": "Added Power",
        "target": "powers that deal damage",
        "description": "The power deals additional $dmgType damage."
    },
    {
        "name": "Accuracy",
        "target": "powers with an Accuracy component",
        "description": "The power has +1 Accuracy."
    },
    {
        "name": "Efficiency",
        "target": "powers with a cooldown that deal damage",
        "description": "The power's cooldown is reduced by 1 step and its usage time is reduced by 1 step, but it deals massively less damage."
    },
    {
        "name": "Explosions",
        "target": "single-target powers with a non-melee range",
        "description": "Instead of affecting its target, the power now affects all creatures of your choice in a 10'-radius sphere centred on the target."
    },
    {
        "name": "Precision",
        "target": "powers with an Accuracy component that deal damage",
        "description": "The power has +2 Accuracy, but deals less damage."
    },
    {
        "name": "Armour Penetration",
        "target": "powers that make attacks",
        "description": "The power has +1 AB and whenever it is blocked, the target gets -1 AC for 1 round."
    },
    {
        "name": "Keen Triggering",
        "target": "powers with an Accuracy component",
        "description": "Whenever the power crits, you may immediately use another power that has a usage time of 1 action or faster as a free action."
    },
    {
        "name": "Vengeful Triggering",
        "target": "powers with a usage time of 1 action or faster",
        "description": "Whenever you are reduced to 0 HP, you may immediately use the power as a free action."
    },
    {
        "name": "Chaining",
        "target": "powers that fire a single projectile and can hit",
        "description": "The first time the power's projectile hits whenever the power is used, you can immediately fire the projectile again from the target to a new target."
    },
    {
        "name": "Empowerment",
        "target": "powers that hit and deal damage",
        "description": "Whenever the power hits, you gain increased damage and +1 crit range for the remainder of combat. Additionally, the power deals less damage."
    },
    {
        "name": "Proximity",
        "target": "powers that deal damage",
        "description": "The power deals more damage against targets adjacent to you."
    },
    {
        "name": "Keen Cruelty",
        "target": "powers with Accuracy components",
        "description": "Whenever the power crits, any DoTs it inflicts from that deal substantially more damage."
    },
    {
        "name": "Execution",
        "target": "powers that deal damage",
        "description": "The power deals more damage against bloodied targets."
    },
    {
        "name": "Forking",
        "target": "powers that fire a single projectile",
        "description": "The first time the power's projectile hits whenever the power is used, it splits into 2 and fires in a v-shape behind the target."
    },
    {
        "name": "Fanning",
        "target": "powers that fire a single projectile",
        "description": "The power's projectile is converted into a cone with range equal to the original projectile's. Additionally, the power deals less damage."
    },
    {
        "name": "Volleying",
        "target": "powers that fire a single projectile",
        "description": "The power's projectile is converted into a 25'-wide line with range equal to the original projectile's. Additionally, the power deals less damage."
    },
    {
        "name": "Exploitation",
        "target": "powers that hit and deal damage",
        "description": "Whenever the power hits a debuffed target, the target is staggered for 1 round."
    },
    {
        "name": "Prepared Execution",
        "target": "powers that hit",
        "description": "Whenever the power hits, the target becomes staggered for 1 round. Additionally, whenever the power scores a killing blow against a debuffed target, you gain barely any increased global damage for the remainder of combat."
    },
    {
        "name": "Marking",
        "target": "powers that hit",
        "description": "Whenever the power hits, the target is marked to take slightly increased damage from all sources for 1 round."
    },
    {
        "name": "Recouperation",
        "target": "powers with a resource cost that hit and deal damage",
        "description": "Whenever the power hits, it refunds 1 unit of its resource cost. Additionally, it deals less damage."
    },
    {
        "name": "Mastered Triggering",
        "target": "powers with a usage time of 1 action or faster",
        "description": "Whenever you cast a spell of your highest available level or use a maneuver of your highest available degree, you may immediately use the power as a free action."
    },
    {
        "name": "Cruel Triggering",
        "target": "powers with a usage time of 1 action or faster that apply debuffs",
        "description": "Whenever you hit with another power, you may immediately use the power as a free action. Additionally, the power has -1 debuff effectiveness."
    },
    {
        "name": "Echoing",
        "target": "powers with a usage time of 1 action or faster",
        "description": "Whenever you use the power, you may use it again as a free action at the start of your next turn."
    },
    {
        "name": "Stillness",
        "target": "powers that deal damage",
        "description": "The power deals more damage if you haven't moved since the start of your last turn."
    },
    {
        "name": "Keenness",
        "target": "powers that make attacks and deal damage",
        "description": "Whenever the power crits, it gains +1 crit range and substantially increased crit damage for 1 round."
    },
    {
        "name": "Piercing",
        "target": "powers that fire a single projectile",
        "description": "The power's projectile is converted into a 5'-wide line with the same range as the original projectile. Additionally, the power deals less damage."
    },
    {
        "name": "Powerful Proximity",
        "target": "powers with a non-melee range",
        "description": "The power deals substantially more damage against targets adjacent to you, but less damage against targets 10+' away from you."
    },
    {
        "name": "Returning",
        "target": "powers with line areas and usage times of 1 action or faster",
        "description": "After using the power, you may use it again as a free action at the start of your next turn, but it starts from the original usage's end point and points towards your location at the time of the repeat."
    },
    {
        "name": "Intense Decay",
        "target": "powers that apply DoTs with ongoing DCs to end them",
        "description": "The power's DoTs with ongoing DCs to end them deal substantially more damage, but have -1 to their ongoing DCs."
    },
    {
        "name": "Charges",
        "target": "powers with a cooldown",
        "description": "The power can be used 1 additional time during its cooldown window, but its cooldown is increased by 1 step."
    },
    {
        "name": "Clumsy Power",
        "target": "powers with an Accuracy component that deal damage",
        "description": "The power deals substantially more damage, but has -1 Accuracy."
    },
    {
        "name": "Cruel Power",
        "target": "powers that deal damage",
        "description": "The power deals more damage against targets with a DoT."
    },
    {
        "name": "Decaying Vulnerability",
        "target": "powers that hit",
        "description": "Whenever the power hits, the target takes increased DoT damage for 1 round."
    },
    {
        "name": "Enabled Power",
        "target": "any power",
        "description": "Whenever you use the power, you gain slightly increased global damage for 1 round."
    },
    {
        "name": "Meek Power",
        "target": "powers with a spell level or maneuver degree",
        "description": "The power deals substantially more damage for each spell slot level or maneuver degree it is below your highest. Additionally, the power's resource cost is increased by 1."
    },
    {
        "name": "Cruel Presence",
        "target": "powers that apply debuffs and don't require concentration",
        "description": "Instead of applying its debuffs normally, the power now constantly applies its debuffs to all creatures of your choice within 60 feet of you for the debuff's duration. Additionally, the power now requires concentration and has +1 debuff effectiveness."
    },
    {
        "name": "Cruel Vulnerability",
        "target": "powers that apply debuffs",
        "description": "Creatures debuffed by the power take slightly increased damage from all sources."
    },
    {
        "name": "Crippled Triggering",
        "target": "powers with a usage time of 1 action or faster that deal damage",
        "description": "Whenever you are debuffed, you may immediately use the power as a free action. Additionally, the power deals less damage."
    },
    {
        "name": "Channeled Triggering",
        "target": "powers with a usage time of 1 action or faster that deal damage",
        "description": "Whenever you start your turn concentrating on an effect, you may immediately use the power as a free action. Additionally, the power deals less damage."
    },
    {
        "name": "Vulnerable Decay",
        "target": "powers that hit and deal damage",
        "description": "Whenever the power hits, the target gains a DoT dealing slight $dmgType damage, stacking until CON save. While affected by this DoT, the target takes increased {dmgType} damage. Additionally, the power deals less damage."
    },
    {
        "name": "Focus",
        "target": "powers with areas that deal damage",
        "description": "The power's areas deal substantially more damage and are smaller."
    },
    {
        "name": "Amateur Power",
        "target": "powers that make attacks and deal damage",
        "description": "The power deals substantially more damage, but has -1 crit range."
    },
    {
        "name": "Cruel Persistence",
        "target": "single-target powers that apply debuffs",
        "description": "Instead of applying its debuffs normally, the power now forms a 15'x15' persistent area centred on the target that lasts for the debuff's duration and constantly applies the debuff to all creatures of your choice within the area. Additionally, the power has -1 debuff effectiveness."
    },
    {
        "name": "Consumption",
        "target": "powers with a resource cost that deal damage",
        "description": "Whenever the power scores a killing blow, you heal a slight amount of HP and recover 1 unit of the power's cost. Additionally, the power deals less damage."
    },
    {
        "name": "Penetrating Summons",
        "target": "powers that summon minions",
        "description": "The power's minions ignore resistances."
    },
    {
        "name": "Merciful Power",
        "target": "powers that deal damage and apply debuffs",
        "description": "The power deals substantially more damage, but has -1 debuff effectiveness."
    },
    {
        "name": "Powerful Penetration",
        "target": "powers that deal damage",
        "description": "The power ignores resistances."
    },
    {
        "name": "Cruel Execution",
        "target": "powers that deal damage",
        "description": "Whenever the power scores a killing blow, all debuffs on the target spread to creatures of your choice adjacent to the target."
    },
    {
        "name": "Shielding",
        "target": "powers that hit",
        "description": "Whenever the power hits, you gain temporary HP."
    },
    {
        "name": "Learning",
        "target": "powers that deal damage",
        "description": "Whenever the power scores a killing blow, you gain 1 experience."
    },
    {
        "name": "Berserking Summons",
        "target": "powers that summon minions",
        "description": "The power's minions have +2 Accuracy and -1 Defence."
    },
    {
        "name": "Morning Summons",
        "target": "powers that summon minions",
        "description": "The power's minions have +1 crit range and deal substantially increased crit damage during the first round of their existence."
    },
    {
        "name": "Bound Decay",
        "target": "powers that apply buffs",
        "description": "While the power is buffing another creature, the line between you and the buffed creature is a persistent area that deals slight $dmgType DoT damage to creatures of your choice."
    },
    {
        "name": "Decaying Power",
        "target": "powers that deal damage",
        "description": "The power deals additional $dmgType damage against targets affected by a DoT."
    },
    {
        "name": "Explosive Cruelty",
        "target": "powers that apply debuffs",
        "description": "Whenever the power's debuffs end, the creature that was debuffed immediately takes $dmgType DoT damage."
    },
    {
        "name": "Coverage",
        "target": "powers with areas",
        "description": "The power's areas are larger."
    },
    {
        "name": "Expert Power",
        "target": "powers that make attacks and deal damage",
        "description": "The power deals substantially more critical damage."
    },
    {
        "name": "Mastery",
        "target": "powers that make attacks",
        "description": "The power has +1 crit range."
    },
    {
        "name": "Unstable Summons",
        "target": "powers that summon minions",
        "description": "The power's minions lose a massive amount of HP at the start of each of their turns, but project a 5' persistent aura that deals substantial $dmgType DoT damage."
    },
    {
        "name": "Channeling",
        "target": "powers that require concentration",
        "description": "While concentrating on the power, you have a substantial amount of damage barrier."
    },
    {
        "name": "Powerful Execution",
        "target": "powers that deal damage",
        "description": "Whenever the power scores a killing blow, you gain slightly increased global damage for the remainder of combat."
    },
    {
        "name": "Stable Coverage",
        "target": "powers with areas",
        "description": "The power's areas are larger if you haven't moved since the start of your last turn."
    },
    {
        "name": "Glittering Execution",
        "target": "powers that deal damage",
        "description": "Whenever the power scores a killing blow, you add 1 loot roll to the combat's rewards."
    },
    {
        "name": "Cautious Summons",
        "target": "powers that summon minions",
        "description": "The power's minions have +2 Defence and -1 Accuracy."
    },
    {
        "name": "Powerful Summons",
        "target": "powers that summon minions",
        "description": "The power's minions deal more damage."
    },
    {
        "name": "Bulky Summons",
        "target": "powers that summon minions",
        "description": "The power's minions have massively more maximum HP."
    },
    {
        "name": "Swift Summons",
        "target": "powers that summon minions",
        "description": "The power's minions have +15' speed."
    },
    {
        "name": "Focused Cruelty",
        "target": "powers that apply debuffs and deal damage",
        "description": "The power has +2 debuff effectiveness, but deals less damage."
    },
    {
        "name": "Focused Power",
        "target": "powers with multiple individual targets",
        "description": "The power can target 1 fewer target, but it deals substantially more damage."
    },
    {
        "name": "Mastered Chaining",
        "target": "powers that make attacks",
        "description": "Whenever the power crits during combat, it gains +1 crit range for the remainder of combat."
    },
    {
        "name": "Cruel Summons",
        "target": "powers that summon minions",
        "description": "The power's minions deal more damage against debuffed targets."
    },
    {
        "name": "Sacrificial Power",
        "target": "powers that deal damage",
        "description": "Whenever you use the power, you lose a massive amount of HP and the power deals a substantial amount of additional $dmgType damage."
    },
    {
        "name": "Conductivity",
        "target": "powers that hit",
        "description": "The power's hits count as both weapon and spell hits."
    },
    {
        "name": "Necromancy",
        "target": "powers that deal damage",
        "description": "Whenever the power scores a killing blow, a CR 1/4 undead minion that deals reduced damage is raised from their corpse. It lasts until long rest."
    },
    {
        "name": "Oppressive Persistence",
        "target": "powers that create persistent areas which deal damage",
        "description": "At the start of each of your turns, the power's persistent areas tick. Additionally, the power's persistent areas deal less damage."
    },
    {
        "name": "Chromatic Power",
        "target": "powers that deal damage",
        "description": "The power deals slightly more damage for each different type of damage it deals."
    },
    {
        "name": "Potent Cruelty",
        "target": "powers that apply debuffs",
        "description": "The power has +1 debuff effectiveness."
    },
    {
        "name": "Preparation",
        "target": "powers with no cooldown that deal damage",
        "description": "The power deals substantially more damage the first time it is used each combat, but less damage otherwise."
    }
]