[
    {
        "name": "Equipped Summons",
        "target": "Powers that summon minions",
        "description": "The minions gain the affixes of your $equipSlot.",
        "meta": "manifest armour"
    },
    {
        "name": "Shredding Summons",
        "target": "Powers that summon minions",
        "description": "When the minions hit with melee atks, their target's phys res is slightly reduced until the end of the minion's next turn."
    },
    {
        "name": "Berserking Summons",
        "target": "Powers that summon minions that can take phys dmg",
        "description": "The minions deal substantially more damage, but have slightly less HP and barely reduced phys res."
    },
    {
        "name": "Exsanguinating Summons",
        "target": "Powers that summon minions",
        "description": "When the minions hit with melee atks dealing $physType dmg, their target is inflicted with a DoT dealing slight {physType} dmg, stacking until CON save (minion's DC)."
    },
    {
        "name": "Phlebotomising Summons",
        "target": "Powers that summon minions",
        "description": "The minions deal more $physType damage over time."
    },
    {
        "name": "Sapping Summons",
        "target": "Powers that summon minions",
        "description": "When the minions are hit, the offender is slowed until CON save (minion's DC)."
    },
    {
        "name": "Charging Summons",
        "target": "Powers that summon minions",
        "description": "As an action, the minions can move up to their speed. During this movement, they can move through hostile creatures' spaces. For each creature they move through, they may attack them, dealing half dmg as $physType on a hit and pushing them 5' in a direction of their choice."
    },
    {
        "name": "Rugged Summons",
        "target": "Powers that summon minions",
        "description": "The minions gain +1 to saves vs debuffs"
    },
    {
        "name": "Taunting Summons",
        "target": "Powers that summon minions",
        "description": "At the end of the minions' turns, all adj creatures of their choice are taunted by the minion until the end of the minion's next turn."
    },
    {
        "name": "Whirling Summons",
        "target": "Powers that summon minions",
        "description": "1/combat, as an action, the minions can move up to half their speed. During this movement, they can move through hostile creatures' spaces. For each creature they either move through or through an adj space of, they may make a melee wep atk against them, dealing slightly less dmg as $physType on a hit."
    },
    {
        "name": "Empowered Summons",
        "target": "Powers that summon minions",
        "description": "The minions add $nonPhysType dmg to their hits."
    },
    {
        "name": "Decaying Summons",
        "target": "Powers that summon minions",
        "description": "When the minions hit with melee atks, their target is inflicted with a DoT dealing slight $nonPhysType dmg, stacking until DEX save (minion's DC)."
    },
    {
        "name": "Dracotouched Summons",
        "target": "Powers that summon minions",
        "description": "1/combat, as a bonus action, the minions breathe a cone of magical energy in a 15' cone, making a spell atk against all foes inside, dealing less dmg as $nonPhysType on a hit."
    },
    {
        "name": "Destructive Summons",
        "target": "Powers that summon minions",
        "description": "The limited features of the minions deal slightly more dmg and have slightly larger AoE sizes."
    },
    {
        "name": "Overcharged Summons",
        "target": "Powers that summon minions",
        "description": "The limited features of the minions have their cooldowns increased by 1 step, but inflict a DoT dealing $nonPhysType dmg, stacking until DEX save (minion's DC), on hit"
    },
    {
        "name": "Reflective Summons",
        "target": "Powers that summon minions",
        "description": "The minions gain substantial dmg thorns."
    },
    {
        "name": "Regenerating Summons",
        "target": "Powers that summon minions",
        "description": "The minions gain barely any passive regen."
    },
    {
        "name": "Bulky Summons",
        "target": "Powers that summon minions",
        "description": "The minions gain more maximum hit points."
    },
    {
        "name": "Reparable Summons",
        "target": "Powers that summon minions",
        "description": "The minions gain a slight amount of incoming healing."
    },
    {
        "name": "Solid Summons",
        "target": "Powers that summon minions",
        "description": "The minions gain slightly more dmg for each phys dmg type they are either resistant or immune to."
    },
    {
        "name": "Efficiency",
        "target": "Powers that can deal dmg and have a non-cooldown resource cost",
        "description": "The power's cost is 1 step lower, but it deals less dmg.",
        "meta": "glacier (start breaking point)"
    },
    {
        "name": "Massive Power",
        "target": "Powers that have multiple areas",
        "description": "The power's largest area deals substantially more dmg."
    },
    {
        "name": "Assassination",
        "target": "Powers that can deal dmg",
        "description": "The power deals substantially more dmg against bosses."
    },
    {
        "name": "Focused Power",
        "target": "Powers that have multiple areas",
        "description": "The power's smallest area deals substantially more dmg."
    },
    {
        "name": "Spread Power",
        "target": "Powers that have multiple areas",
        "description": "The power deals more AoE dmg."
    },
    {
        "name": "Focused Area",
        "target": "Powers that have multiple areas",
        "description": "The power's areas all conform to the same shape and area as one of the original areas of your choice, but it no longer deals any extra crit dmg."
    },
    {
        "name": "Keen Shielding",
        "target": "Powers that can crit",
        "description": "Whenever the power crits, you gain a substantial amount of temp HP."
    },
    {
        "name": "Dull Criticals",
        "target": "Powers with an atk roll",
        "description": "The power has +3 crit range, but no longer deals any extra crit dmg."
    },
    {
        "name": "Keen Recovery",
        "target": "Powers that have a non-cooldown resource cost",
        "description": "Whenever the power crits, its resource cost is refunded."
    },
    {
        "name": "Murderous Recovery",
        "target": "Powers that have a non-cooldown resource cost",
        "description": "Whenever the power scores a killing blow, its resource cost is refunded."
    },
    {
        "name": "Dull Infliction",
        "target": "Powers that can deal dmg and can apply debuffs",
        "description": "The power deals less dmg, but any debuffs it can apply have +2 to their DCs."
    },
    {
        "name": "Sapping",
        "target": "Powers that can hit",
        "description": "Whenever the power hits, the target becomes sluggish until the end of your next turn."
    },
    {
        "name": "Focused Sapping",
        "target": "Powers that have multiple areas that can hit",
        "description": "Whenever the power's smallest area hits, the target becomes sluggish until the end of your next turn."
    },
    {
        "name": "Cruelty",
        "target": "Powers that can deal dmg and can apply debuffs",
        "description": "Any debuffs the power can apply have +1 to their DCs, and the power deals slightly more dmg to debuffed targets."
    },
    {
        "name": "Massive Infliction",
        "target": "Powers that have multiple areas that can hit",
        "description": "Whenever the power's largest area hits, it deals more dmg and the target becomes sluggish until the end of your next turn."
    },
    {
        "name": "Spread Infliction",
        "target": "Powers that have multiple areas that can hit",
        "description": "Whenever the power hits, it deals slightly more dmg and the target become sluggish until the end of your next turn."
    },
    {
        "name": "Whirling Energy",
        "target": "Powers that have a non-persistent area",
        "description": "After the area resolves, it leaves a vortex of energy, a pers area that lasts until the end of your next turn, making spell atks that deal slight $nonPhysType dmg."
    },
    {
        "name": "Lingering Infliction",
        "target": "Any power",
        "description": "If you have used the power since the start of your last turn, your DoTs deal barely more dmg and your debuff DCs have a +1 bonus."
    },
    {
        "name": "Focused Whirling",
        "target": "Powers that have multiple non-persistent areas",
        "description": "Whenever the power's smallest area resolves it leaves a vortex of energy, a pers area that lasts until the end of your next turn, making spell atks that deal $nonPhysType dmg."
    },
    {
        "name": "Persistent Power",
        "target": "Any power with a persistent area",
        "description": "The power's persistent areas have slightly more dmg and slightly more area."
    },
    {
        "name": "Massive Energy",
        "target": "Powers that have multiple non-persistent areas",
        "description": "Whenever the power's largest area resolves it leaves a vortex of energy, a pers area that lasts until the end of your next turn, making spell atks that deal slight $nonPhysType dmg. Additionally, any buffs triggered from the power have slightly more effectiveness."
    },
    {
        "name": "Spread Energy",
        "target": "Powers that have multiple non-persistent areas",
        "description": "Whenever the power's areas resolve, they leave vortices of energy, pers areas that last until the end of your next turn, making spell atks that deal barely any $nonPhysType dmg. Additionally, any buffs triggered from the power have barely more duration."
    },
    {
        "name": "Focused Efficiency",
        "target": "Powers that have multiple areas and a non-cooldown resource cost",
        "description": "The power's cost is 1 step lower, but its largest area deals substantially less dmg."
    },
    {
        "name": "Major Spread",
        "target": "Powers that have multiple areas and a non-cooldown resource cost",
        "description": "The power's areas deal massively more dmg, but its cost is 1 step higher."
    },
    {
        "name": "Keen Power",
        "target": "Powers that make atk rolls",
        "description": "The power deals barely more dmg and has +1 crit range.",
        "meta": "ice barrage"
    },
    {
        "name": "Slow Power",
        "target": "Powers that deal dmg",
        "description": "The power deals substantially more dmg, has +1 Accuracy, and has its usage time increased by 1 action step."
    },
    {
        "name": "Fragmentation",
        "target": "Powers that fire non-piercing projectiles",
        "description": "Whenever the power's projs hit, they explode in a 15' cone originating from the opposite side of the target. The cone makes a spell atk against all foes, dealing slight $nonPhysType dmg on a hit."
    },
    {
        "name": "Focused Energy",
        "target": "Powers with a cooldown and a non-instantaneous duration",
        "description": "The power deals more dmg and its cooldown is reduced by 1 step, but its duration is reduced by 1 step."
    },
    {
        "name": "Slow Splitting",
        "target": "Powers with a non-cooldown resource cost that fire projectiles",
        "description": "The power fires 3 additional projs, each aiming 45 degrees in a different direction of your choice from the original projs, but its usage time is increased by 1 action step, its resoure cost is increased by 1 step, and it deals less dmg."
    },
    {
        "name": "Spread",
        "target": "Powers with cone areas",
        "description": "The power's cones are 5' wider at all distances."
    },
    {
        "name": "Piercing",
        "target": "Powers that fire projectiles",
        "description": "The power's projectiles are converted to line AoEs but it deals less dmg."
    },
    {
        "name": "Decaying Penetration",
        "target": "Powers with line areas",
        "description": "Each creature hit by the power's lines gets a DoT dealing slight $nonPhysType dmg, stacking until CON save."
    },
    {
        "name": "Endurance",
        "target": "Powers with non-instantaneous durations that can deal damage",
        "description": "The power's duration increases by 1 step, but it deals less dmg."
    },
    {
        "name": "Clumsy Power",
        "target": "Powers that have Accuracy components",
        "description": "The power deals substantially more dmg but has -1 Accuracy."
    },
    {
        "name": "Building Assassination",
        "target": "Powers that can hit",
        "description": "Whenever the power hits a boss, it gains dmg for the remainder of its duration."
    },
    {
        "name": "Building Power",
        "target": "Powers with non-instantaneous durations",
        "description": "Each turn of the power's duration, it gains slightly more dmg."
    },
    {
        "name": "Unstable Speed",
        "target": "Powers that do not require concentration and can deal damage",
        "description": "The power's usage time is reduced by 2 action steps, but it now requires concentration and deals less dmg."
    },
    {
        "name": "Swift Channelling",
        "target": "Powers that require reactivation each round and can deal damage",
        "description": "The power's reactivation time is reduced by 1 action step, but it now deals less dmg."
    },
    {
        "name": "Shielding",
        "target": "Powers that can hit",
        "description": "Whenever the power hits, you gain temp HP."
    },
    {
        "name": "Tiring Exertion",
        "target": "Powers with non-instantaneous durations that can deal damage",
        "description": "For the power's duration, you project a 5' aura that inflicts sluggish on foes until the end of their turn, but the power deals less damage."
    },
    {
        "name": "Intensity",
        "target": "Powers with non-instantaneous durations",
        "description": "The power deals massively more damage, but its duration is reduced by 1 step."
    },
    {
        "name": "Focused Channelling",
        "target": "Powers with non-instantaneous durations that require reactivation each round",
        "description": "The power's reactivation time is reduced by 1 action step, but you are slowed for its duration."
    },
    {
        "name": "Charged Shielding",
        "target": "Powers with cooldowns that can have targeted directions",
        "description": "If the power is directed at a non-self target, it projects a 10'-wide magical barrier for the combat that completely blocks projs, in the space in front of you in the targeted direction. The power's cooldown also increases by 1 step."
    },
    {
        "name": "Charged Obstacles",
        "target": "Powers that form objs or structs and can deal dmg",
        "description": "Any objs or structs formed by the power have their durations extended by 2 steps, but the power's cooldown is increased by 1 step and it deals less damage."
    },
    {
        "name": "Empowering Obstacles",
        "target": "Powers that form objs or structs",
        "description": "While an obj or struct formed by the power is active, you deal slightly more $nonPhysType dmg and have slightly more {nonPhysType} res."
    },
    {
        "name": "Volatile Obstacles",
        "target": "Powers that form objs or structs and can deal dmg",
        "description": "When an obj or struct formed by the power expires, it erupts in a staggering explosion. All foes adj to the entity are staggered until the end of your next turn. The power deals massively less damage."
    },
    {
        "name": "Building Ailments",
        "target": "Powers with non-instantaneous durations that deal damage",
        "description": "For each turn of the power's duration, any debuffs it can apply have +1 to their related DCs. The power deals less damage."
    },
    {
        "name": "Explosive Power",
        "target": "Powers that can hit",
        "description": "Whenever the power hits, a nova erupts from the target, attacking all foes within 5' of the target (including them), dealing 1d4 $nonPhysType spell dmg on a hit. The power deals substantially less dmg."
    },
    {
        "name": "Ailments",
        "target": "Any power",
        "description": "Any debuffs the power can apply have +1 to their related DCs."
    },
    {
        "name": "Empowering Ailments",
        "target": "Any power",
        "description": "Whenever the power inflicts a debuff, you deal more spell dmg until the end of your next turn."
    },
    {
        "name": "Sudden Eruption",
        "target": "Powers that require reactivation each round and do not have a cone AoE",
        "description": "The power's duration is now instantaneous and only activates on casting, but now affects a cone area with length equal to the original range or area length. It also deals substantially more dmg."
    },
    {
        "name": "Inflicting Eruption",
        "target": "Powers with cone AoEs",
        "description": "Any debuffs the power can apply have +1 to their related DCs, and the power deals barely more dmg."
    },
    {
        "name": "Cruel Power",
        "target": "Any power",
        "description": "The power deals more dmg to debuffed targets."
    },
    {
        "name": "Keen Cruelty",
        "target": "Any power",
        "description": "The power has +1 crit range against debuffed targets."
    },
    {
        "name": "Speed",
        "target": "Powers that can deal dmg",
        "description": "The power's usage time is reduced by 1 step, but it deals less dmg.",
        "meta": "fireball"
    },
    {
        "name": "Focused Speed",
        "target": "Powers that have multiple individual targets",
        "description": "The power's usage time is reduced by 1 step and it deals slightly more dmg for each additional individual target it has above 1, but it now only has 1 individual target."
    },
    {
        "name": "Channeling",
        "target": "Powers with an instantaneous duration and a non-self/melee range",
        "description": "The power's duration becomes 'Concentration, up to 1 minute', and you can reactivate its effect as its usage time throughout the duration. Its range is also halved."
    },
    {
        "name": "Overcharged Penetration",
        "target": "Powers with a non-cooldown resource cost that require concentration and fire projectiles",
        "description": "The power's projectiles are converted to 5'-wide line AoEs and deal more dmg, but its cost is increased by 1 step."
    },
    {
        "name": "Efficient Channeling",
        "target": "Powers with a non-cooldown resource cost that require concentration and deal dmg",
        "description": "The power's cost is 1 step lower, but it deals less dmg."
    },
    {
        "name": "Protective Channeling",
        "target": "Powers that require concentration",
        "description": "While concentrating on the power, you have barely more phys res and slightly more $nonPhysType res."
    },
    {
        "name": "Distance",
        "target": "Powers with a non-self/melee range",
        "description": "The power's range is doubled."
    },
    {
        "name": "Efficient Power",
        "target": "Powers with a non-cooldown resource cost",
        "description": "The power's cost is 1 step lower and it deals barely more dmg."
    },
    {
        "name": "Shredding",
        "target": "Any power",
        "description": "Whenever the power hits, the target's $nonPhysType res is reduced."
    },
    {
        "name": "Unstable Focus",
        "target": "Powers that have multiple individual targets",
        "description": "If all of the power's individual targets are the same, a burst of energy erupts around the target, making a spell atk against all foes within 5' of the target (including them), dealing slight $nonPhysType dmg."
    },
    {
        "name": "Reliable Explosions",
        "target": "Powers with sphere areas that trigger from hits",
        "description": "The power's sphere areas still trigger even if the required effects do not hit."
    },
    {
        "name": "Telekinesis",
        "target": "Powers that fire projectiles",
        "description": "The power's projectiles have +1 Accuracy."
    },
    {
        "name": "Decay",
        "target": "Any power",
        "description": "Whenever the power hits, the target is inflicted with a DoT dealing slight $nonPhysType dmg, stacking until DEX save."
    },
    {
        "name": "Spreading Decay",
        "target": "Any power",
        "description": "Whenever the power hits, the target is inflicted with a DoT dealing barely any $nonPhysType dmg, stacking until DEX save. Whenever this DoT ticks, it spreads to all creatures of your choice adj to the afflicted creature."
    },
    {
        "name": "Powerful Decay",
        "target": "Powers that inflict DoTs",
        "description": "The power's DoTs deal more dmg."
    },
    {
        "name": "Penetration",
        "target": "Any power",
        "description": "The power ignores dmg res."
    },
    {
        "name": "Precision",
        "target": "Powers that make atk rolls",
        "description": "The power has +1 crit range."
    },
    {
        "name": "Volatile Destruction",
        "target": "Any power",
        "description": "Whenever the power hits, it deals slight additional $nonPhysType dmg. Additionally, its crits deal more dmg."
    },
    {
        "name": "Distant Power",
        "target": "Powers with a non-self/melee range",
        "description": "The power's range is doubled and it deals barely more dmg."
    },
    {
        "name": "Overcharged Eruption",
        "target": "Powers with a non-cooldown resource cost that fire a single projectile",
        "description": "The power's proj is converted into a cone with a length equal to the proj's range and deals more dmg, but its cost is increased by 1 step."
    },
    {
        "name": "Keen Lag",
        "target": "Powers that make atk rolls",
        "description": "The power has +3 crit range, but its usage time is increased by 1 step."
    },
    {
        "name": "Dull Debilitation",
        "target": "Any power",
        "description": "The power can no longer crit, but whenever it usually would, it debilitates the target until CON save."
    },
    {
        "name": "Stacked Focus",
        "target": "Powers with cone areas",
        "description": "The power's cone areas are now lines of the same length that activate twice over the same area, but its usage time is increased by 1 step."
    },
    {
        "name": "Blunt Power",
        "target": "Powers with line areas",
        "description": "The power deals massively more dmg, but its line areas are converted to non-piercing projs with range equal to the line's length.",
        "meta": "marrow shards"
    },
    {
        "name": "Leeching Empowerment",
        "target": "Any power",
        "description": "Whenever you deal $physType dmg having used the power since the start of your last turn, heal a slight amount of HP."
    },
    {
        "name": "Blunt Eruption",
        "target": "Powers with line areas that have a non-cooldown resource cost",
        "description": "The power's line areas are converted to non-piercing projs with range equal to the line's length and deal less dmg, and its cost is increased by 1 step. Additionally, whenever these projs hit, they splinter into a 15' cone AoE from the other side of the target, a spell atk dealing massive phys dmg."
    },
    {
        "name": "Erupting Power",
        "target": "Powers with cone areas",
        "description": "The power's cone areas deal more dmg."
    },
    {
        "name": "Massive Blasting",
        "target": "Any power",
        "description": "The power's cone areas are longer."
    },
    {
        "name": "Erupting Exsanguination",
        "target": "Powers with cone areas",
        "description": "Whenever the power's cone areas hit, the target is inflicted with a DoT dealing slight $physType dmg, stacking until CON save."
    },
    {
        "name": "Erupting Cruelty",
        "target": "Powers with cone areas",
        "description": "The power's cone areas deal more dmg against debuffed targets."
    },
    {
        "name": "Keen Eruption",
        "target": "Powers with cone areas that make atk rolls",
        "description": "The power's cone areas have +1 crit range."
    },
    {
        "name": "Destructive Eruption",
        "target": "Powers with cone areas",
        "description": "The power's cone areas deal more crit dmg."
    },
    {
        "name": "Overcharged Splintering",
        "target": "Powers with line areas and a non-cooldown resource cost",
        "description": "Whenever the power's line areas end, they release a 15' long cone from that point in the same direction as the line, a spell atk against foes dealing substantial $physType dmg. The power's line areas have their lengths halved and its cost is increased by 1 step."
    },
    {
        "name": "Targeted Conclusion",
        "target": "Powers with line areas and a non-cooldown resource cost",
        "description": "The power's line areas are always of a length of your choice, up to their original length, and deal substantially more dmg. The power's cost is increased by 1 step."
    },
    {
        "name": "Close Power",
        "target": "Powers with a non-self/melee range",
        "description": "The power deals substantially more dmg but its range is halved."
    },
    {
        "name": "Keen Destruction",
        "target": "Powers that make atk rolls",
        "description": "The power has +1 crit range and deals barely more crit dmg."
    },
    {
        "name": "Destruction",
        "target": "Any power",
        "description": "The power deals more crit dmg."
    },
    {
        "name": "Sacrificial Destruction",
        "target": "Any power",
        "description": "The power deals substantially more crit dmg, but whenever it crits you lose a slight amount of HP."
    },
    {
        "name": "Keen Support",
        "target": "Any power",
        "description": "If you have an active minion when you use the power, you gain +1 crit range until the end of your next turn. This does not stack."
    },
    {
        "name": "Overcharged Exsanguination",
        "target": "Powers with a non-cooldown resource cost that can deal damage",
        "description": "Whenever the power hits, the target is inflicted with a DoT that deals substantial $physType dmg, stacking until CON save. The power's cost is increased by 1 step and it deals less dmg."
    },
    {
        "name": "Delayed Leeching",
        "target": "Any power",
        "description": "Whenever the power hits, you heal HP at the start of your next turn."
    },
    {
        "name": "Healing",
        "target": "Powers that heal",
        "description": "The power heals more HP."
    },
    {
        "name": "Efficient Healing",
        "target": "Powers with a non-cooldown resource cost that heal",
        "description": "The power's cost is reduced by 1 step, but it heals less HP."
    },
    {
        "name": "Sacrificial Power",
        "target": "Any power",
        "description": "If you have an active minion when you use the power, the power deals massively more dmg but kills all of your minions."
    },
    {
        "name": "Duplication",
        "target": "Powers that can deal dmg",
        "description": "Whenever you use the power, it is used again at no additional cost, but its dmg is substantially reduced."
    },
    {
        "name": "Reckless Power",
        "target": "Any power",
        "description": "The power deals substantially more dmg to foes, but massively more dmg to allies."
    },
    {
        "name": "Feasting",
        "target": "Any power",
        "description": "Whenever you reduce an ally to 0 HP with the power, you heal HP."
    },
    {
        "name": "Bloodthirsty Empowerment",
        "target": "Any power",
        "description": "Whenever you deal $physType dmg have delivered a KB with the power since the start of your last turn, heal a slight amount of HP."
    },
    {
        "name": "Keen Empowerment",
        "target": "Any power",
        "description": "If you have delivered a KB with the power since the start of your last turn, you have +1 crit range."
    },
    {
        "name": "Armour Shredding [marrow shards done]",
        "target": "Any power",
        "description": "Whenever the power hits, the target gets slightly reduced phys res until the end of your next turn."
    }
]