{
    "uncommon": [
        {
            "name": "Alchemy Jug",
            "description": "https://5e.tools/items.html#alchemy%20jug_dmg"
        },
        {
            "name": "Bag of Holding",
            "description": "https://5e.tools/items.html#bag%20of%20holding_dmg"
        },
        {
            "name": "Bag of Tricks",
            "description": "https://5e.tools/items.html#bag%20of%20tricks_dmg"
        },
        {
            "name": "Broom of Flying",
            "description": "https://5e.tools/items.html#broom%20of%20flying_dmg"
        },
        {
            "name": "Cloak of the Manta Ray",
            "description": "https://5e.tools/items.html#cloak%20of%20the%20manta%20ray_dmg"
        },
        {
            "name": "Decanter of Endless Water",
            "description": "https://5e.tools/items.html#decanter%20of%20endless%20water_dmg"
        },
        {
            "name": "Deck of Illusions",
            "description": "https://5e.tools/items.html#deck%20of%20illusions_dmg"
        },
        {
            "name": "Driftglobe",
            "description": "https://5e.tools/items.html#driftglobe_dmg"
        },
        {
            "name": "Dust of Disappearance",
            "description": "https://5e.tools/items.html#dust%20of%20disappearance_dmg"
        },
        {
            "name": "Dust of Dryness",
            "description": "https://5e.tools/items.html#dust%20of%20dryness_dmg"
        },
        {
            "name": "Dust of Sneezing and Choking",
            "description": "https://5e.tools/items.html#dust%20of%20sneezing%20and%20choking_dmg"
        },
        {
            "name": "Elemental Gem",
            "description": "https://5e.tools/items.html#elemental%20gem_dmg"
        },
        {
            "name": "Eversmoking Bottle",
            "description": "https://5e.tools/items.html#eversmoking%20bottle_dmg"
        },
        {
            "name": "Eyes of Minute Seeing",
            "description": "https://5e.tools/items.html#eyes%20of%20minute%20seeing_dmg"
        },
        {
            "name": "Silver Raven Figurine",
            "description": "https://5e.tools/items.html#figurine%20of%20wondrous%20power%2c%20silver%20raven_dmg"
        },
        {
            "name": "Gem of Brightness",
            "description": "https://5e.tools/items.html#gem%20of%20brightness_dmg"
        },
        {
            "name": "Goggles of Night",
            "description": "https://5e.tools/items.html#goggles%20of%20night_dmg"
        },
        {
            "name": "Immovable Rod",
            "description": "https://5e.tools/items.html#immovable%20rod_dmg"
        },
        {
            "name": "Keoghtom's Ointment",
            "description": "https://5e.tools/items.html#keoghtom's%20ointment_dmg"
        },
        {
            "name": "Lantern of Revealing",
            "description": "https://5e.tools/items.html#lantern%20of%20revealing_dmg"
        },
        {
            "name": "Oil of Slipperiness",
            "description": "https://5e.tools/items.html#oil%20of%20slipperiness_dmg"
        },
        {
            "name": "Philter of Love",
            "description": "https://5e.tools/items.html#philter%20of%20love_dmg"
        },
        {
            "name": "Pipes of Haunting",
            "description": "https://5e.tools/items.html#pipes%20of%20haunting_dmg"
        },
        {
            "name": "Potion of Animal Friendship",
            "description": "https://5e.tools/items.html#potion%20of%20animal%20friendship_dmg"
        },
        {
            "name": "Potion of Fire Breath",
            "description": "https://5e.tools/items.html#potion%20of%20fire%20breath_dmg"
        },
        {
            "name": "Potion of Hill Giant Strength",
            "description": "https://5e.tools/items.html#potion%20of%20hill%20giant%20strength_dmg"
        },
        {
            "name": "Potion of Growth",
            "description": "https://5e.tools/items.html#potion%20of%20growth_dmg"
        },
        {
            "name": "Potion of Greater Healing",
            "description": "https://5e.tools/items.html#potion%20of%20greater%20healing_dmg"
        },
        {
            "name": "Potion of Poison",
            "description": "https://5e.tools/items.html#potion%20of%20poison_dmg"
        },
        {
            "name": "Potion of Resistance",
            "description": "https://5e.tools/items.html#potion%20of%20resistance_dmg"
        },
        {
            "name": "Potion of Water Breathing",
            "description": "https://5e.tools/items.html#potion%20of%20water%20breathing_dmg"
        },
        {
            "name": "Quiver of Ehlonna",
            "description": "https://5e.tools/items.html#quiver%20of%20ehlonna_dmg"
        },
        {
            "name": "Rope of Climbing",
            "description": "https://5e.tools/items.html#rope%20of%20climbing_dmg"
        },
        {
            "name": "Saddle of the Cavalier",
            "description": "https://5e.tools/items.html#saddle%20of%20the%20cavalier_dmg"
        },
        {
            "name": "Sending Stones",
            "description": "https://5e.tools/items.html#sending%20stones_dmg"
        },
        {
            "name": "Wind Fan",
            "description": "https://5e.tools/items.html#wind%20fan_dmg"
        },
        {
            "name": "Glamerweave",
            "description": "https://5e.tools/items.html#uncommon%20glamerweave_erlw"
        },
        {
            "name": "Wheel of Wind and Water",
            "description": "https://5e.tools/items.html#wheel%20of%20wind%20and%20water_erlw"
        },
        {
            "name": "Dust of Deliciousness",
            "description": "https://5e.tools/items.html#dust%20of%20deliciousness_egw"
        },
        {
            "name": "Spellwrought Tattoo Needle (2nd)",
            "description": "https://5e.tools/items.html#spellwrought%20tattoo%20(2nd%20level)_tce"
        },
        {
            "name": "Spellwrought Tattoo Needle (3rd)",
            "description": "https://5e.tools/items.html#spellwrought%20tattoo%20(3rd%20level)_tce"
        },
        {
            "name": "Air Charm",
            "description": "https://a5e.tools/node/806"
        },
        {
            "name": "Blackbird Pie",
            "description": "https://a5e.tools/node/841"
        },
        {
            "name": "Bottle of Fizz",
            "description": "https://a5e.tools/node/849"
        },
        {
            "name": "Box of Party Tricks",
            "description": "https://a5e.tools/node/852"
        },
        {
            "name": "Charcoal Stick of Aversion",
            "description": "https://a5e.tools/node/867"
        },
        {
            "name": "Clockwork Calendar",
            "description": "https://a5e.tools/node/877"
        },
        {
            "name": "Inspiring Pahu",
            "description": "https://a5e.tools/node/984"
        },
        {
            "name": "Jarred Brain",
            "description": "https://a5e.tools/node/1004"
        },
        {
            "name": "Clockwork Tools",
            "description": "This exquisitely designed set of thieves' tools are enchanted to guide even the clumsiest of felons to success. While using these thieves' tools you are proficient with them, and you gain an expertise die on checks made to pick locks or disable devices such as traps. In addition, these thieves' tools fold down into a single smooth rosewood handle that appears to be a finely polished piece of wood, and you gain an expertise die on checks made to conceal them."
        },
        {
            "name": "Describing Gremlins",
            "description": "https://a5e.tools/node/894"
        },
        {
            "name": "Diary of a Mentally Unhinged Adventurer",
            "description": "https://a5e.tools/node/1147"
        },
        {
            "name": "Earth Charm",
            "description": "https://a5e.tools/node/907"
        },
        {
            "name": "Efficient Quiver",
            "description": "https://a5e.tools/node/909"
        },
        {
            "name": "Family Scrapbook",
            "description": "https://a5e.tools/node/926"
        },
        {
            "name": "Fire Charm",
            "description": "https://a5e.tools/node/932"
        },
        {
            "name": "Gallow Hand",
            "description": "https://a5e.tools/node/943"
        },
        {
            "name": "Glasses of Rodentius",
            "description": "https://a5e.tools/node/951"
        },
        {
            "name": "Gremlin Translator",
            "description": "https://a5e.tools/node/960"
        },
        {
            "name": "Guide to Respecting Social Mores",
            "description": "https://a5e.tools/node/961"
        },
        {
            "name": "Instrument of Irresistable Symphonies",
            "description": "https://a5e.tools/node/986"
        },
        {
            "name": "Ironweed Rope",
            "description": "https://a5e.tools/node/1001"
        },
        {
            "name": "Luminescent Gum",
            "description": "https://a5e.tools/node/1015"
        },
        {
            "name": "Peal of Power",
            "description": "https://a5e.tools/node/1066"
        },
        {
            "name": "Message Stones",
            "description": "https://a5e.tools/node/1031"
        },
        {
            "name": "Meteorological Map",
            "description": "https://a5e.tools/node/1033"
        },
        {
            "name": "Perfume Vile",
            "description": "https://a5e.tools/node/1069"
        },
        {
            "name": "Portraiture Gremlin",
            "description": "https://a5e.tools/node/1080"
        },
        {
            "name": "Pumpkin Bomb",
            "description": "https://a5e.tools/node/1102"
        },
        {
            "name": "Restorative Ointment",
            "description": "https://a5e.tools/node/1106"
        },
        {
            "name": "Second-light Lantern",
            "description": "https://a5e.tools/node/1149"
        },
        {
            "name": "Seeds of Necessity",
            "description": "https://a5e.tools/node/1151"
        },
        {
            "name": "Skeleton Key",
            "description": "https://a5e.tools/node/1160"
        },
        {
            "name": "Skull Liqueur",
            "description": "https://a5e.tools/node/1161"
        },
        {
            "name": "Spindle of Spinning",
            "description": "https://a5e.tools/node/1171"
        },
        {
            "name": "Stick Awl",
            "description": "https://a5e.tools/node/1188"
        },
        {
            "name": "Tome of Triumphant Tavern Keeping",
            "description": "https://a5e.tools/node/1206"
        },
        {
            "name": "Water Charm",
            "description": "https://a5e.tools/node/1239"
        },
        {
            "name": "Dust of Corrosion",
            "description": "https://5e.tools/items.html#dust%20of%20corrosion_wbtw"
        },
        {
            "name": "Pixie Dust",
            "description": "https://5e.tools/items.html#pixie%20dust_wbtw"
        },
        {
            "name": "Potion of Advantage",
            "description": "https://5e.tools/items.html#potion%20of%20advantage_wbtw"
        },
        {
            "name": "Aeriad Bracers",
            "description": "Leather cuffs padded with driftbloom tufts are kept stiff with shafts and fletching of arrows, all wound with driftbloom strands. This grants the wearer a measure of control over objects in flight. While you are wearing the bracers, you descend 60 feet per round and take no damage from falling. While falling, you can also glide 5 feet horizontally without provoking opportunity attacks for every 10 feet you descend."
        },
        {
            "name": "Alacritous Camera",
            "description": "This resembles a photochemical camera with a large alchemical flash hood, save that the interior contains a crystalog amid a complex assortment of arcanotechnological clockwork gears, wires, and spark plugs. As an action, you can loudly snap a high-resolution, full-color photograph with this camera. It comes with an alchemical light bulb for flash photography, which the item’s magic replenishes after a minute. This is not a subtle process, due to the loud sounds of the machinery within that imprint the image into the crystalog. This camera uses no plates. Rather, by concentrating on the crystalog you can see with your mind’s eye the images it has taken. It can store up to eight images at a time. Over the course of 1 hour, which can be performed as part of a short rest, you can magically transfer and ink a photograph onto a suitably large sheet of paper, canvas, or similar surface. The input can also be copied into an asomatous canvas projector. If a light cantrip is targeted on the crystalog, that washes out the existing images, clearing it to take more pictures after one minute. Though expensive and loud, these cameras are finding immense interest among the fields of entertainment, journalism, crime scene investigation, and espionage."
        },
        {
            "name": "Asomatous Canvas Projector",
            "description": "This inches-wide, rounded cube packs in an incredible amount of arcanotechnological components. A nozzle on one side can project a vibrant, animated illusion. Asomatous canvas projectors have become popular across Lanjyr for civic color, theatrical entertainment, animated artwork and advertisements, and more. While the figment sheds light, it is nowhere as luminous as that of arctech everbright lamps and actual electric incandescent filament bulbs. Some talented artists have experimented with sets of multiple cubes intended to be played in sequence, creating an animated and audible story in five-minute segments; these exhibits have been called kinetograms. By touching the cube as an action and thinking upon a desired figment (or transferring an image from an alacritous camera), the user can set the cube to memorize the figment and then project it when the desired conditions are met, just as if casting a programmed illusion spell. The common wall projector can produce a 5-foot cube of image out to a range of 10 feet, while the uncommon stage projector can fill a 30-foot cube out to a range of 120 feet. This functions in many respects as a programmed illusion. However, the figment lasts indefinitely, sheds light as bright as a torch, and has a distinctly washed out, somewhat grainy and flickering character (similar to what we’d recognize as early silent films) that makes it completely obvious to even a common lizard that it’s an illusion. Since anyone can adjust the cube’s programming, asomatous canvas projectors are normally kept under literal lock and key, often in bronze filigreed boxes with a gap just large enough to allow the invisible strands of illusory magic to pour through. Unsurprisingly, these cubes are prime targets for pranksters and protestors."
        },
        {
            "name": "Bracer of Liberty",
            "description": "Dozens of links from the chains of slaves were shattered apart and half-melted into this bracelet, which pulses with potent psychic energies. If the wearer loses control of their will, the links sear with retaliatory heat and bring the wearer to their senses, as designed by the original creator, the late gnoll executore Glaucia Evora. Executore heralds prefer to lend these items to their comrades, as such heralds prefer to confront challenges of willpower on their own merits. While you are wearing the bracer, whenever you start your turn charmed you may choose to take 1d6 fire damage. If you do, you can act until the start of your next turn as if you are not charmed. If you have immunity to fire damage, the bracer provides no protection."
        },
        {
            "name": "Countermagical Handcuffs",
            "description": "Colloquially called ‘mage cuffs,’ these steel handcuffs let law enforcement agencies, criminal groups, rebels, conspirators, and others restrain prisoners who might otherwise use magic to slip away. When they were first mass produced in 517 aov, incarceration reformists breathed collective sighs of relief as the need for stringent and often cruel countermagical security features was greatly reduced. Engraved runes and mystical geometries create Example Planarite—Earth One basic earth planarite is adamant, a dark rock that can be worked into metal to create adamantine. Urim is most renowned for its gold, but meteoric astrium is a metal infused with earth and space energy, which floats in tandem with other metal at distances from a quarter inch to up to a yard, allowing for novel gear patterns that won’t collide as easily. planar conduits to Urim, selected for its enhancement of the metaphysical concept of barriers. Urim’s planar energies pour into the steel, reinforcing it under certain conditions. Normally, these act as nothing more than regular manacles. If placed upon either a willing creature, or a creature at 0 hit points, a soft and aureate light begins to limn the handcuffs, signifying that they have been magically reinforced until the next time they are removed. While so magically reinforced, all DCs associated with circumventing the manacles increase to 30. Additionally, whenever the wearer uses any non-permanent magical effects (including but not limited to spells, charming gazes, frightening auras, invisibility, shapechanging, telepathy, teleportation, the Incorporeal Movement trait, legendary actions, or lair actions), they take 4d6 psychic damage and must make a Constitution saving throw or else the magic they attempted fails to happen. Similar to concentration, the DC is 10 or half the damage the wearer takes, whichever is higher. If someone attempts to break the cuffs, the wielder takes damage as if they tried to use magic. The cuffs have 30 hit points, and either resistance or immunity to most types of damage. The cuffs’ damage is nonlethal, and cannot kill the wearer. The cuffs, however, only have three charges each hour, so a very committed prisoner might manage to power through an escape attempt. For the most magically powerful foes, greater bindings that use similar principles might be employed. The uncommon ‘magebinding jacket’ deals 10d6 psychic damage to a wearer who uses magic, and also keeps them restrained. It too only has three charges per hour, but as yet no prisoner has ever been known to fight past more than two. Courtesy of Urim’s aureate energy, the jacket has 50 hit points. Some devoted incarceration facilities have countermagic cells, which function as magebinding jackets for anyone inside, but have no limit to the number of charges."
        },
        {
            "name": "Gatecrasher Charm",
            "description": "This delicate arrangement of arctech clockwork gears of rusted iron is assembled from the reflection of real-world metals found in the Bleak Gate. Its gears constantly, silently spin despite their corrosion. While the charm is on your person and you are on the Waking or in the Dreaming, as a bonus action, you can mentally will this charm to irreparably break itself apart. After a screech of rusted iron, the gears shatter and slice open planar fabrics like a can opener. This functions as a plane shift spell for the Bleak Gate, except that this magic affects only you, and you arrive in the exact spot that is an analog for your current location. When you enter the Bleak Gate, the magic of the charm continues to resonate in your mind and soul for the next 10 minutes. At any point during this time, as a bonus action, you can focus on the fleeting remnant of magic and return to the plane where you used this charm, appearing in a spot analogous to your current location. Rare versions of this charm are contingent. When you finish a short or long rest with the charm on your person, you can define or redefine a circumstance which triggers the charm. The charm breaks itself apart immediately after the circumstance is met for the first time, whether you want it to or not. This functions as the conventional activation above, and indeed, you can still break the charm normally if necessary."
        },
        {
            "name": "Malice Focus +1",
            "description": "This tiny talisman rapidly infuses the psychic energies of your own thoughts and emotions into your body, letting you wield such power to augment your attacks. While the talisman is on your person, you gain a bonus to the attack rolls and the damage rolls you make with unarmed strikes and natural weapons. The bonus is determined by the focus’s rarity. Such attacks gain all of the benefits of using magic weapons."
        },
        {
            "name": "Personal Revision Hourglass",
            "description": "A person’s past can bring many benefits: connections, knowledge, insights. This arcanotechnological hourglass’s array of glyph-engraved gears ensure that it always rotates in such a way as to keep accurate track of time by the minute. Its sands are filled with relicite planarite from Teykfa and a drop of witchoil, and they let the bearer briefly call forth a version of themselves that might have been. As an action, you can activate this geared hourglass, causing it to oscillate rapidly. You think of a background, such as criminal or folk hero. You temporarily acquire some benefits of that background other than ability score increases. For instance, you might gain a proficiency, a criminal connection or the local fame of a folk hero. You specify the broad strokes, but the Narrator fills in any finer details. You keep your original real background, but also exist somehow simultaneously as this other version of yourself. This benefit lasts until you sleep. If you desire, this may also slightly alter your appearance, matching your new background. You’re still identifiable as you, but might acquire a scar or remove one, change hairstyle or become slightly more attractive. You are instinctively aware of the alterations that were necessary to complete this change, and they are usually unobtrusive. You acquire nothing else; for instance, gaining the noble’s background does not give you any more wealth or properties than you originally had. However, people are subtly affected by this alternate reality and will treat you in keeping with your new background. After this action, the hourglass’s clockwork screeches to a halt, but returns to its normal function at the start of the next new moon. After an aggressive campaign by an alliance of arcanoscience scholars of Pardwight University, folk skyseers, Beran philosophers, and Drakran economists, the nations of Risur, Ber, and Drakr all banned this device, warning of perilous consequences. However, followers of the Clergy – especially Ottoplismists – see it as an ideal representation of perfecting oneself, albeit temporarily. Elsewhere they are seen as curiosities only."
        },
        {
            "name": "Sending Wind",
            "description": "This invisible orb is woven of Caeloon planarite in windy, gaseous form. The sphere can be carried in your palm, or it can be left to float at any location, invisible except to those who know to look for it. Each orb is attuned to up to five tokens, which usually take the form of metal or wooden feathers. While holding one of these tokens, you can cast sending without components to one or more creatures carrying another token, as long as both you and your recipients are within thirty miles of the orb. The message takes time to be delivered, carried by an unseen breeze that travels at twenty miles an hour. The recipient can choose to send a reply, which also takes time to fly back. Each token can cast sending this way no more than once per hour."
        },
        {
            "name": "Emerald Pen",
            "description": "https://5e.tools/items.html#emerald%20pen_ftd"
        },
        {
            "name": "Spectral Camera",
            "description": "Favored by those who deal with hauntings, a spectral camera can capture the image of spirits on film. Any creature with incorporeal movement or on the Ethereal Plane (visible or not) that passes in front of the camera’s open aperture (up to 30 feet away) will trigger the camera to immediately take a monochrome picture. This has no effect on creatures affected by an invisibility spell. You can also take a picture manually as a reaction. Once a picture is taken, you must spend an action to prepare the camera for another. Unlike physical objects, incorporeal beings do not need to stay still to appear on the resulting photo, though the entire process takes 1 minute to complete. Such photos do not need to be developed and show ghostly subjects in crisp detail, while all mundane aspects (chairs, corporeal creatures, etc.) are at best mildly blurry. Each picture taken with a spectral camera costs 2 gp in materials, which are significantly rarer than those for a mundane photograph. (300 gp, 15 lbs.)"
        },
        {
            "name": "Bouquet of Wisdom",
            "description": "This stunningly-crafted bouquet contains 2d10 magically-fresh flowers - most commonly roses. As an action, you may pluck one from the bouquet while concentrating on your intent. The flower may function as a scroll of Identify, Detect Poison and Disease, or Detect Magic. The effect lasts for 1 minute, after which the flower withers and dies. If the bouquet is made up of seven roses or more, you can burn it to cast a Divination spell, revealing the answer to the question asked in the sweetly-scented smoke. Doing so destroys the bouquet."
        },
        {
            "name": "Cravat of Strangling",
            "description": "This red silk cravat appears to be - and, technically, is - extremely luxurious. While holding it, you can change its colour or pattern as a bonus action. Unfortunately, it is also cursed. When you put it on, it immediately tightens. You must make a DC 14 CON save each round or begin to suffocate. On subsequent turns, you or an ally may make a DC 15 Aths check to attempt to remove it. Doing so has a 50% chance of destroying the cravat. Attempts to cut, burn, or magically rip it off deal half damage to the wearer and half to the cravat (10 HP), which only releases its hold once destroyed."
        }
    ],
    "rare": [
        {
            "name": "Bag of Beans",
            "description": "https://5e.tools/items.html#bag%20of%20beans_dmg"
        },
        {
            "name": "Bead of Force",
            "description": "https://5e.tools/items.html#bead%20of%20force_dmg"
        },
        {
            "name": "Bowl of Commanding Water Elementals",
            "description": "https://5e.tools/items.html#bowl%20of%20commanding%20water%20elementals_dmg"
        },
        {
            "name": "Brazier of Commanding Fire Elementals",
            "description": "https://5e.tools/items.html#brazier%20of%20commanding%20fire%20elementals_dmg"
        },
        {
            "name": "Cape of the Mountebank",
            "description": "https://5e.tools/items.html#cape%20of%20the%20mountebank_dmg"
        },
        {
            "name": "Censer of Controlling Air Elementals",
            "description": "https://5e.tools/items.html#censer%20of%20controlling%20air%20elementals_dmg"
        },
        {
            "name": "Chime of Opening",
            "description": "https://5e.tools/items.html#chime%20of%20opening_dmg"
        },
        {
            "name": "Daern's Instant Fortress",
            "description": "https://5e.tools/items.html#daern's%20instant%20fortress_dmg"
        },
        {
            "name": "Dimensional Shackles",
            "description": "https://5e.tools/items.html#dimensional%20shackles_dmg"
        },
        {
            "name": "Elixir of Health",
            "description": "https://5e.tools/items.html#elixir%20of%20health_dmg"
        },
        {
            "name": "Bronze Griffin Figurine",
            "description": "https://5e.tools/items.html#figurine%20of%20wondrous%20power%2c%20bronze%20griffon_dmg"
        },
        {
            "name": "Ebony Fly Figurine",
            "description": "https://5e.tools/items.html#figurine%20of%20wondrous%20power%2c%20ebony%20fly_dmg"
        },
        {
            "name": "Golden Lion Figurines",
            "description": "https://5e.tools/items.html#figurine%20of%20wondrous%20power%2c%20golden%20lions_dmg"
        },
        {
            "name": "Ivory Goat Figurines",
            "description": "https://5e.tools/items.html#figurine%20of%20wondrous%20power%2c%20ivory%20goats_dmg"
        },
        {
            "name": "Marble Elephant Figurine",
            "description": "https://5e.tools/items.html#figurine%20of%20wondrous%20power%2c%20marble%20elephant_dmg"
        },
        {
            "name": "Onyx Dog Figurine",
            "description": "https://5e.tools/items.html#figurine%20of%20wondrous%20power%2c%20onyx%20dog_dmg"
        },
        {
            "name": "Serpentine Owl Figurine",
            "description": "https://5e.tools/items.html#figurine%20of%20wondrous%20power%2c%20serpentine%20owl_dmg"
        },
        {
            "name": "Folding Boat",
            "description": "https://5e.tools/items.html#folding%20boat_dmg"
        },
        {
            "name": "Heward's Handy Haversack",
            "description": "https://5e.tools/items.html#heward's%20handy%20haversack_dmg"
        },
        {
            "name": "Horn of Blasting",
            "description": "https://5e.tools/items.html#horn%20of%20blasting_dmg"
        },
        {
            "name": "Silver Horn of Valhalla",
            "description": "https://5e.tools/items.html#horn%20of%20valhalla%2c%20silver_dmg"
        },
        {
            "name": "Brass Horn of Valhalla",
            "description": "https://5e.tools/items.html#horn%20of%20valhalla%2c%20brass_dmg"
        },
        {
            "name": "Horseshoes of Speed",
            "description": "https://5e.tools/items.html#horseshoes%20of%20speed_dmg"
        },
        {
            "name": "Iron Bands of Bilarro",
            "description": "https://5e.tools/items.html#iron%20bands%20of%20bilarro_dmg"
        },
        {
            "name": "Oil of Etherealness",
            "description": "https://5e.tools/items.html#oil%20of%20etherealness_dmg"
        },
        {
            "name": "Portable Hole",
            "description": "https://5e.tools/items.html#portable%20hole_dmg"
        },
        {
            "name": "Potion of Clairvoyance",
            "description": "https://5e.tools/items.html#potion%20of%20clairvoyance_dmg"
        },
        {
            "name": "Potion of Diminution",
            "description": "https://5e.tools/items.html#potion%20of%20diminution_dmg"
        },
        {
            "name": "Potion of Gaseous Form",
            "description": "https://5e.tools/items.html#potion%20of%20gaseous%20form_dmg"
        },
        {
            "name": "Potion of Frost Giant Strength",
            "description": "https://5e.tools/items.html#potion%20of%20frost%20giant%20strength_dmg"
        },
        {
            "name": "Potion of Fire Giant Strength",
            "description": "https://5e.tools/items.html#potion%20of%20fire%20giant%20strength_dmg"
        },
        {
            "name": "Potion of Superior Healing",
            "description": "https://5e.tools/items.html#potion%20of%20superior%20healing_dmg"
        },
        {
            "name": "Potion of Heroism",
            "description": "https://5e.tools/items.html#potion%20of%20heroism_dmg"
        },
        {
            "name": "Potion of Invulnerability",
            "description": "https://5e.tools/items.html#potion%20of%20invulnerability_dmg"
        },
        {
            "name": "Potion of Mind Reading",
            "description": "https://5e.tools/items.html#potion%20of%20mind%20reading_dmg"
        },
        {
            "name": "Quaal's Feather Token",
            "description": "https://5e.tools/items.html#quaal's%20feather%20token_dmg"
        },
        {
            "name": "Rope of Entanglement",
            "description": "https://5e.tools/items.html#rope%20of%20entanglement_dmg"
        },
        {
            "name": "Scroll of Protection",
            "description": "https://5e.tools/items.html#scroll%20of%20protection_dmg"
        },
        {
            "name": "Stone of Controlling Earth Elementals",
            "description": "https://5e.tools/items.html#stone%20of%20controlling%20earth%20elementals_dmg"
        },
        {
            "name": "Mizzium Mortar",
            "description": "https://5e.tools/items.html#mizzium%20mortar_ggr"
        },
        {
            "name": "Potion of Maximum Power",
            "description": "https://5e.tools/items.html#potion%20of%20maximum%20power_egw"
        },
        {
            "name": "Flying Chariot",
            "description": "https://5e.tools/items.html#flying%20chariot_mot"
        },
        {
            "name": "Potion of Aqueous Form",
            "description": "https://5e.tools/items.html#potion%20of%20aqueous%20form_mot"
        },
        {
            "name": "Spellwrought Tattoo Needle (4th)",
            "description": "https://5e.tools/items.html#spellwrought%20tattoo%20(4th%20level)_tce"
        },
        {
            "name": "Spellwrought Tattoo Needle (5th)",
            "description": "https://5e.tools/items.html#spellwrought%20tattoo%20(5th%20level)_tce"
        },
        {
            "name": "Iron Bands of Binding",
            "description": "https://a5e.tools/node/999"
        },
        {
            "name": "Cord of Spirit Stealing",
            "description": "https://a5e.tools/node/881"
        },
        {
            "name": "Elemental Quiver",
            "description": "https://a5e.tools/node/912"
        },
        {
            "name": "Impossible Cube",
            "description": "https://a5e.tools/node/981"
        },
        {
            "name": "Madam Yolanda's Prison",
            "description": "https://a5e.tools/node/1019"
        },
        {
            "name": "Orb of Chaotic Assault",
            "description": "https://a5e.tools/node/1051"
        },
        {
            "name": "Orb of the Dragon Breaker",
            "description": "https://a5e.tools/node/1053"
        },
        {
            "name": "Poisoner's Almanac",
            "description": "https://a5e.tools/node/1078"
        },
        {
            "name": "Pouch of Emergency Healing",
            "description": "https://a5e.tools/node/1098"
        },
        {
            "name": "Spirit Lantern",
            "description": "https://a5e.tools/node/1172"
        },
        {
            "name": "Black Chromatic Rose",
            "description": "https://5e.tools/items.html#black%20chromatic%20rose_wbtw"
        },
        {
            "name": "Blue Chromatic Rose",
            "description": "https://5e.tools/items.html#blue%20chromatic%20rose_wbtw"
        },
        {
            "name": "Green Chromatic Rose",
            "description": "https://5e.tools/items.html#green%20chromatic%20rose_wbtw"
        },
        {
            "name": "Red Chromatic Rose",
            "description": "https://5e.tools/items.html#red%20chromatic%20rose_wbtw"
        },
        {
            "name": "White Chromatic Rose",
            "description": "https://5e.tools/items.html#white%20chromatic%20rose_wbtw"
        },
        {
            "name": "Aeriad Bracers",
            "description": "Leather cuffs padded with driftbloom tufts are kept stiff with shafts and fletching of arrows, all wound with driftbloom strands. This grants the wearer a measure of control over objects in flight. While you are wearing the bracers, you descend 60 feet per round and take no damage from falling. While falling, you can also glide 5 feet horizontally without provoking opportunity attacks for every 10 feet you descend. Additionally, the rare version of this item grants you a +2 bonus to damage rolls with ranged weapons."
        },
        {
            "name": "Autonomous Mechanical Carriage",
            "description": "Adamant and aether are wrought into a two-inch-diameter arctech disc reminiscent of a carriage’s wheel. The wealthy and the powerful use this bauble for intracity transportation when they worry of bullets flying from dangerous streets. As an action, you can throw this disc onto the ground. It instantaneously and spectacularly assembles itself into a horseless carriage of darkwood, steel plate armor, magically hardened glass windows, and fine leather upholstery. Some versions of this figurine build complex arcanotechnological wheels, while others construct mechanical equine legs, which are just as effective. The carriage can accommodate up to nine Medium passengers inside. While its windows are closed, creatures entirely inside the carriage have total cover. Outside of a combat encounter, the carriage can travel at up to 20 miles per hour, though the general lack of paved roadways outside of cities limits its range. The carriage navigates autonomously; it stops or swerves to avoid hazards, and follows simple telepathic directions. One creature in the driver’s seat can use its action to manually direct the carriage, or to make it attack. The carriage appears at full hit points and acts as a Huge animated object with AC 18, but will not attack unless directed by a driver. If no creatures or foreign objects are inside the carriage, any creature can use an action to touch the carriage and transform it back into a disc."
        },
        {
            "name": "Blood of the Hollow Widow",
            "description": "Those whom the new fey titan of the High Bayou known as the Hollow Widow recognizes as friends or family might be gifted with this beautiful pendant of durable glass. Encased within is a tiny quantity of blood, a living icon of the titaness and a conduit of her power, however humble. While you are wearing the pendant: * Arachnids default to being friendly to you unless given a reason to feel otherwise. * While in contact with a web, you know the exact location of any other creature in contact with the same web. * As a bonus action, you can extrude and detach from your wrist a thick web strand that functions as a rope of climbing. If you use this bonus action again, the previous rope disappears. * Librarians presume you and those you travel with have permission to access library facilities, even subscription libraries, as long as you’re not disruptive. * You know the exact distance, direction, name, and rough description of the nearest library, be it public, subscription, or even ruined and abandoned. * Additionally, during a long rest, you can meditate on objects or locations in your vicinity. You drift into sleep and dream, and when you awake you recall vivid visions about history. You can choose from the two following options up to eight times during each long rest. * You learn how an object’s owner acquired and lost the object, as well as the most recent significant event involving the object and that owner. If the object was owned by another creature in the past week, you can select this option again to learn the same information about that creature. * You see visions of recent events in your immediate vicinity (a room, street, tunnel, clearing, or the like, up to a 50-foot cube), going back up to a week. For each time you select this option, you learn about one significant event, beginning with the most recent. Significant events typically involve powerful emotions, such as battles and betrayals, marriages and murders, births and funerals. However, they might also include more mundane events that are nevertheless important in your current situation."
        },
        {
            "name": "Gatecrasher Charm",
            "description": "This delicate arrangement of arctech clockwork gears of rusted iron is assembled from the reflection of real-world metals found in the Bleak Gate. Its gears constantly, silently spin despite their corrosion. While the charm is on your person and you are on the Waking or in the Dreaming, as a bonus action, you can mentally will this charm to irreparably break itself apart. After a screech of rusted iron, the gears shatter and slice open planar fabrics like a can opener. This functions as a plane shift spell for the Bleak Gate, except that this magic affects only you, and you arrive in the exact spot that is an analog for your current location. When you enter the Bleak Gate, the magic of the charm continues to resonate in your mind and soul for the next 10 minutes. At any point during this time, as a bonus action, you can focus on the fleeting remnant of magic and return to the plane where you used this charm, appearing in a spot analogous to your current location. Rare versions of this charm are contingent. When you finish a short or long rest with the charm on your person, you can define or redefine a circumstance which triggers the charm. The charm breaks itself apart immediately after the circumstance is met for the first time, whether you want it to or not. This functions as the conventional activation above, and indeed, you can still break the charm normally if necessary."
        },
        {
            "name": "Malice Focus +2",
            "description": "This tiny talisman rapidly infuses the psychic energies of your own thoughts and emotions into your body, letting you wield such power to augment your attacks. While the talisman is on your person, you gain a bonus to the attack rolls and the damage rolls you make with unarmed strikes and natural weapons. The bonus is determined by the focus’s rarity. Such attacks gain all of the benefits of using magic weapons."
        },
        {
            "name": "Symbol of Sanguine Alleviation",
            "description": "This crimson crystalline fish hook of Ostean planarite was first crafted by hierarchs of the Clergy, renowned for their restorative magics. Non-Clericist symbols are simply medallions of three concentric rings; the inner rings float in place, unconnected to the rest of the symbol. While you are wearing the symbol, as an action, you can choose one living creature within 5 feet. You must spend 1 Hit Die to no effect, causing blood to arc from your pores and orifices and into those of the selected creature; if you chose yourself, the blood recirculates around your body externally. The recipient gains the benefits of a fifth level cure wounds spell and a lesser restoration spell. Once the symbol has conferred healing, it cannot do so again until the next dawn."
        },
        {
            "name": "Bicycle Bell of Flight",
            "description": "This beautifully-filigreed bell can turn into a mundane bicycle of Small or Medium size (chosen at the time of creation) when you activate it as an action. Returning the bicycle to bell form also requires an action. While riding this bicycle, you can ring its bell to gain a flying speed of 50 feet and the ability to hover. You can use the bike to fly for 2 hours, expending at least 10 minutes worth of time with each use. If you are flying when the time runs out, you fall at a rate of 60 feet and take no damage from landing. The bell regains 1 hour of flying time for every 12 hours it is not in use, regardless of which form it is in. CURSE: While far from malicious, the magic of the bell is exuberant to a fault. While you are using its flying speed it frequently rings of its own accord, giving you disadvantage on Stealth checks."
        },
        {
            "name": "Chariot a la Calabaza",
            "description": "The original Chariot was created by a powerful wizard with a penchant for transmutation and riding in style. It is pulled by 2 spectral stallions with flowing manes and tails, who function as per the Phantom Steed spell. As an action, you may speak the command word to transform the chariot into a pumpkin 2' in diameter. Speaking the command word again transforms the pumpkin into a carriage and resummons the horses. While in pumpkin form, the chariot is, in truth, a pumpkin, except that it does not naturally decay. Attempts to carve, smash, or draw upon the pumpkin are reflected onto the chariot's form when it reappears, although the horses seem to remain unscathed regardless of such events."
        },
        {
            "name": "Unparalleled Pianoforte",
            "description": "This elegant pianoforte has been painted white, with gold filigree adorning its lid and the tops of its keys. Originally commissioned by a noble with particularly musically-incompetent children. It allows you to add an expertise die to Performance attempts to play it, and this die increases by one step if you have proficiency in Performance. If you succeed at a DC 17 Performance check while playing this instrument, you may choose up to 6 creatures within 30' that can hear the pianoforte. For the next hour, these creatures have a d8 Bardic Inspiration die which can be spent on any 1 attack roll, ability check, or saving throw."
        }
    ],
    "very rare": [
        {
            "name": "Bag of Devouring",
            "description": "https://5e.tools/items.html#bag%20of%20devouring_dmg"
        },
        {
            "name": "Carpet of Flying",
            "description": "https://5e.tools/items.html#carpet%20of%20flying%2c%205%20ft.%20%c3%97%207%20ft._dmg"
        },
        {
            "name": "Efreeti Bottle",
            "description": "https://5e.tools/items.html#efreeti%20bottle_dmg"
        },
        {
            "name": "Obsidian Steed Figurine",
            "description": "https://5e.tools/items.html#figurine%20of%20wondrous%20power%2c%20obsidian%20steed_dmg"
        },
        {
            "name": "Bronze Horn of Valhalla",
            "description": "https://5e.tools/items.html#horn%20of%20valhalla%2c%20bronze_dmg"
        },
        {
            "name": "Horseshoes of a Zephyr",
            "description": "https://5e.tools/items.html#horseshoes%20of%20a%20zephyr_dmg"
        },
        {
            "name": "Manual of Bodily Health",
            "description": "https://5e.tools/items.html#manual%20of%20bodily%20health_dmg"
        },
        {
            "name": "Manual of Gainful Exercise",
            "description": "https://5e.tools/items.html#manual%20of%20gainful%20exercise_dmg"
        },
        {
            "name": "Manual of Golems",
            "description": "https://5e.tools/items.html#manual%20of%20golems_dmg"
        },
        {
            "name": "Manual of Quickness of Action",
            "description": "https://5e.tools/items.html#manual%20of%20quickness%20of%20action_dmg"
        },
        {
            "name": "Mirror of Life Trapping",
            "description": "https://5e.tools/items.html#mirror%20of%20life%20trapping_dmg"
        },
        {
            "name": "Nolzur's Marvelous Pigments",
            "description": "https://5e.tools/items.html#nolzur's%20marvelous%20pigments_dmg"
        },
        {
            "name": "Oil of Sharpness",
            "description": "https://5e.tools/items.html#oil%20of%20sharpness_dmg"
        },
        {
            "name": "Potion of Flying",
            "description": "https://5e.tools/items.html#potion%20of%20flying_dmg"
        },
        {
            "name": "Potion of Cloud Giant Strength",
            "description": "https://5e.tools/items.html#potion%20of%20cloud%20giant%20strength_dmg"
        },
        {
            "name": "Potion of Supreme Healing",
            "description": "https://5e.tools/items.html#potion%20of%20supreme%20healing_dmg"
        },
        {
            "name": "Potion of Invisibility",
            "description": "https://5e.tools/items.html#potion%20of%20invisibility_dmg"
        },
        {
            "name": "Potion of Longevity",
            "description": "https://5e.tools/items.html#potion%20of%20longevity_dmg"
        },
        {
            "name": "Potion of Speed",
            "description": "https://5e.tools/items.html#potion%20of%20speed_dmg"
        },
        {
            "name": "Potion of Vitality",
            "description": "https://5e.tools/items.html#potion%20of%20vitality_dmg"
        },
        {
            "name": "Rod of Security",
            "description": "https://5e.tools/items.html#rod%20of%20security_dmg"
        },
        {
            "name": "Tome of Clear Thought",
            "description": "https://5e.tools/items.html#tome%20of%20clear%20thought_dmg"
        },
        {
            "name": "Tome of Leadership and Influence",
            "description": "https://5e.tools/items.html#tome%20of%20leadership%20and%20influence_dmg"
        },
        {
            "name": "Tome of Understanding",
            "description": "https://5e.tools/items.html#tome%20of%20understanding_dmg"
        },
        {
            "name": "Speaking Stone",
            "description": "https://5e.tools/items.html#speaking%20stone_erlw"
        },
        {
            "name": "Arcane Cannon",
            "description": "https://5e.tools/items.html#arcane%20cannon_egw"
        },
        {
            "name": "Dispelling Stone",
            "description": "https://5e.tools/items.html#dispelling%20stone_egw"
        },
        {
            "name": "Potion of Possibility",
            "description": "https://5e.tools/items.html#potion%20of%20possibility_egw"
        },
        {
            "name": "Reincarnation Dust",
            "description": "https://5e.tools/items.html#reincarnation%20dust_egw"
        },
        {
            "name": "Absurdist Web",
            "description": "https://a5e.tools/node/803"
        },
        {
            "name": "Grappling Gun",
            "description": "https://a5e.tools/node/959"
        },
        {
            "name": "Manual of Guardians",
            "description": "https://a5e.tools/node/1024"
        },
        {
            "name": "Red Cloak of Riding",
            "description": "https://a5e.tools/node/1105"
        },
        {
            "name": "Ornithopter of Flying",
            "description": "https://5e.tools/items.html#ornithopter%20of%20flying_wbtw"
        },
        {
            "name": "Butcher's Corset",
            "description": "Strung tightly against the spine, this corset composed of stiff Ostean planarite allows for control over one’s own severed limbs. While you are wearing the corset: * No parts of your body can be individually severed unless you allow such. Any ‘debilitation’ of a body part such as from a savant’s surgical flourish goes away at the end of your turn. * During your turn, without an action, you can harmlessly detach one or both of your arms, or reattach any number of your body parts sharing your space if they were severed while you were wearing this corset. As an action, you can teleport any number of your severed body parts back onto your body if they are within three miles. Any clothing, armor, and accessories are detached or reattached with the limbs. * During your turn, if you are not incapacitated and both of your arms are severed, they are entitled to their own movement. Both of your arms function as a single unit, and they have a sympathetic link to you. For most mechanical purposes, you occupy both your actual space and the Tiny space of the arms. Your arms typically have the same AC as you, and only your arms benefit from a shield. You and your arms share temporary effects, and your arms have a fly (hover) speed equal to your highest speed. Your arms ignore the prone condition. Your arms can lift, carry, and otherwise manipulate the environment as you normally would. You can use your arms to take actions and reactions as normal, though if you’re unable to see your target you still suffer disadvantage on your attacks."
        },
        {
            "name": "Hurricane Violin",
            "description": "This violin’s wooden body has a streak of white, reminiscent of a lightning bolt, and a skilled musician can control the wind with a pull of the instrument’s bow. While this was originally a unique relic, since the Great Eclipse, Governor Hana ‘Gale’ Soliogn has commissioned an arctech replica of this violin. The replica’s body is carved from remains of ships wrecked in Yerasol storms, but has gaps of empty space held in place by frames of metallic astrium, and floating fan blades inside the frame spin and amplify sounds as the performance grows. Strings of driftbloom strands from Caeloon let a single performer play the parts of multiple violinists. You can use the violin as a spellcasting focus and a holy symbol. You can use an action to play the violin and immediately cast control weather or banishment (save DC 18), neither needing components. To maintain concentration on either spell cast this way, you must continue playing the violin with both hands without releasing it. You can still cast another spell as long as it requires no material components, weaving the somatic and verbal components into your performance. Once the violin has invoked control weather this way, it cannot do so again until the next dawn. The violin can invoke banishment this way no more than once per hour."
        },
        {
            "name": "Malice Focus +3",
            "description": "This tiny talisman rapidly infuses the psychic energies of your own thoughts and emotions into your body, letting you wield such power to augment your attacks. While the talisman is on your person, you gain a bonus to the attack rolls and the damage rolls you make with unarmed strikes and natural weapons. The bonus is determined by the focus’s rarity. Such attacks gain all of the benefits of using magic weapons."
        },
        {
            "name": "Mavishan Cube",
            "description": "This radiant, azure cube crafted of planarite of space-aspected Mavisha can be consumed as part of a one-hour ritual to create a ship-spirit, which usually is as powerful as a Challenge 10 creature. Please see the bestiary entry on ship-spirits for more details."
        },
        {
            "name": "Portable Wayfarer's Lantern",
            "description": "This arcanotechnological lantern of adamantine and bulletproof glass is a smaller refinement of the first design of a wayfarer’s engine, which inspired all manner of planarite alchemy. The lantern’s arcanotechnological stabilizers allow you to hang it on your hip. The lantern functions as a regular lantern, but it sheds bright light out to 15 feet and dim light out to 30 feet. As a bonus action, you can use one hand to manipulate the lantern in one of the following ways: * Push a button to adjust a shutter over the lantern. This can cause it to shed light in all directions (bright to 15 feet, dim to 30 feet), to function as a bullseye lantern (bright in a 60-foot cone, dim another 60 feet), or to block all light. While the lantern’s magical effects normally go through obstacles, the lantern’s shutter does block or aim the light’s effect. * Push a button to set the lantern to indiscriminate mode, glyph-only mode, or no-glyph-only mode. * Draw a writing implement and use it to scribe a glyph onto a small sketching surface embedded atop the lantern. As an action, you can use one hand to draw one ounce of planarite worth 25 gp that has been processed into oil form (such as unensouled witchoil), pour it into the lantern’s special reservoir, and then push a button to activate the lantern’s most powerful function. The lantern immediately burns up the planarite, and you choose one of the following: * Using Dreaming or Bleak Gate planarite, you form a link to that plane. The oil burns for up to five minutes, during which time the brightly-lit area overlaps with an equivalent space on the destination plane. Each creature that is illuminated by the lamp gradually transitions to the destination plane, seeing the original plane become less solid as the destination becomes more real. Once a creature has spent at least 1 continuous minute in the illuminated area, it fully transitions, and it receives no saving throw to resist this. * The lantern burns for five minutes, and creatures and objects undergo a magical effect based on the planarite’s plane for as long as they are in the area. Certain combinations of planarite might produce particularly exotic effects. Depending on the lantern’s settings, this can affect either all creatures in the path of the light, creatures carrying a specific glyph, or creatures not carrying a specific glyph. If it affects only creatures carrying a specific glyph, while this planar light shines, only those creatures can see the lantern and its illumination. The effect varies based on the source of the planarite oil. ] The Dreaming: Vibrant, varicolored incandescence distorts memories. When the five minutes of light end, creatures that were in the light at any point must make a DC 18 Wisdom saving throw. On a failure, a creature forgets everything it had witnessed while within the light. ] The Bleak Gate: Like the “sun” of the Bleak Gate, this is not so much light as it is an eerie-looking devouring of darkness. If a creature that has a shadow or is made of darkness ends its turn in the light, the creature spawns a shadow that single-mindedly attacks the creature. The shadow lacks Sunlight Weakness, and has advantage on attack rolls, ability checks, and saving throws. The shadow cannot exist outside of the radius of the lantern’s light, and disappears once the five minutes of oil finishes burning. Once a creature has spawned a shadow this way, it cannot spawn another shadow from the same lantern for 5 minutes. ] Vona, the Sun: Helical rays expose all that is true and suppress invisibility and illusion. Creatures and objects in the light can be observed by viewers, even viewers outside of the light, as if the viewers had true seeing with indefinite range. This light does not count as true sunlight. ] Caeloon, the Paper Wind: Soothing green shine grants hope in the hour of need. If a creature is actively participating in combat and at half of its hit points (rounded up) or fewer, it can gain a powerful d10 expertise die on one roll. After doing so, it cannot gain the benefit again for five minutes. ] Urim, the Shattered Golden Chain: An aureate glow enforces a stalwart barrier of inertia. Creatures cannot teleport into, out of, or within the light. Creatures must spend twice as much movement as they otherwise would in order to move into, out of, or within the light. ] Jiese, the Fires of Industry: Red lantern flame bolsters cunning in all forms. Creatures gain an expertise die (1d4) on Intelligence, Wisdom, Deception, Sleight of Hand, and Stealth checks. ] Ostea, the Beating Heart: Blood-red brilliance bolsters vitality. Creatures have advantage on Constitution saving throws, and they cannot fail death saving throws. When damage reduces a creature to 0 hit points, the creature can choose to go to 1 hit point; once a creature avails of this, it cannot do so again from the same lantern for 5 minutes. ] Av, the Planes of Dreams and Reflections: Pale, white refulgence grants ingress into dreamscapes. As an action, a creature can cause themselves to fall asleep, and then cast their mind into the dreamscape of a naturally-slumbering creature also within the light. This journey only lasts so long as the lantern light glow, and the nature of the dreamscape is up to the Narrator. A creature that “dies” in the dreamscape wakes up; they suffer a level of strife, but all the damage they suffered in the dreamscape goes away unless it was psychic damage. If the dreamer awakens, those inside the dreamscape “die” this same way. ] Amrou, the Salt Waste: Pallid light transmutes subjects into pillars of salt. If a creature ends its turn in the light, it must make a DC 18 Constitution saving throw or be petrified while it remains in the light. It can repeat the saving throw at the end of each of its turns. Once a creature succeeds on this saving throw, it is immune to the same effect from the same lantern for 5 minutes. ] Iratha Ket, the Graveyard Revel: Bone-white refulgence inspires subjects to perform and dance. Creatures gain an expertise die (d4) on Performance checks. If a creature sings, its lyrics, however contrived, can be universally understood by any creature with a language, even if the listener is outside of the light. Creatures never provoke opportunity attacks, as they dance out of the way. ] Mavisha, the Mysterious Deep: An ocean-blue glow disrupts divinations and shrouds subjects. Creatures are under the effects of mind blank and nondetection. As an action, a creature can magically turn invisible until it attacks or casts a spell, or until its concentration ends (as if concentrating on a spell); any equipment the creature wears or carries is invisible with it. This protection, however, feels like being deep underwater, and when the five minutes end, any creature that spent at least one round in it gains one level of fatigue. ] Ascetia, the Hidden Jungle: Lush green illumination brings history to the fore. Each creature can touch another creature’s head and share a vivid memory one time during the five minutes of light. ] Teykfa, the Ticking Pendulum: A dun radiance grants an awareness of time, yet physically stretches out the seconds. Creatures know the exact time of day, down to the second. A creature that ends its turn in the light must make a DC 18 Wisdom saving throw or suffer the effects of slow while it remains in the light. Once a creature succeeds on this saving throw, it is immune to the same effect from the same lantern for 5 minutes. Once the lantern has consumed planarite this way, it takes 8 hours for the light’s energy to fully fade. Buring planarite oil from a different plane during this time produces no magical effect."
        },
        {
            "name": "Spirit-Trapping Camera",
            "description": "Not to be mistaken for a simple spectral camera, this plain-looking but obviously finely-made piece gives off a subtle but reassuring feeling of peace. As an action, you can use one charge to focus the camera’s lens on a single creature within 30 feet and take its picture. If the targeted creature is an undead or a fiend, it must make a DC 17 Charisma saving throw or be instantly captured in a glass photographic plate. If the target is not an undead or fiendish creature the charge is wasted. Any other creatures shown in the photograph are unaffected, even if they are undead or fiends. The spirit-trapping camera can produce as many plates as it has charges, though each must be removed as a bonus action before you can use another charge. A trapped creature can be released by breaking the plate or it can be sent to its final judgment (in the case of an undead creature) or back to its native plane (in the case of a fiend) by immersing the plate in holy water for 1 hour, at which point it disappears. Creatures banished in this way cannot return to the plane they were sent away from for a year and a day by any means short of divine intervention. If neither of these actions are performed within 24 hours of the photograph being taken, the creature is banished as above, though it has no limitations on returning. The spirit-trapping camera has 3 charges and regains 1 each dawn. When the last charge is expended, roll a d20. On a 1, it becomes a mundane photochemical camera (see Adventures in ZEITGEIST or a5e.tools)."
        }
    ],
    "legendary": [
        {
            "name": "Apparatus of Kwalish",
            "description": "https://5e.tools/items.html#apparatus%20of%20kwalish_dmg"
        },
        {
            "name": "Cubic Gate",
            "description": "https://5e.tools/items.html#cubic%20gate_dmg"
        },
        {
            "name": "Deck of Many Things",
            "description": "https://5e.tools/items.html#deck%20of%20many%20things_dmg"
        },
        {
            "name": "Iron Horn of Valhalla",
            "description": "https://5e.tools/items.html#horn%20of%20valhalla%2c%20iron_dmg"
        },
        {
            "name": "Iron Flask",
            "description": "https://5e.tools/items.html#iron%20flask_dmg"
        },
        {
            "name": "Potion of Storm Giant Strength",
            "description": "https://5e.tools/items.html#potion%20of%20storm%20giant%20strength_dmg"
        },
        {
            "name": "Sovereign Glue",
            "description": "https://5e.tools/items.html#sovereign%20glue_dmg"
        },
        {
            "name": "Sphere of Annihilation",
            "description": "https://5e.tools/items.html#sphere%20of%20annihilation_dmg"
        },
        {
            "name": "Universal Solvent",
            "description": "https://5e.tools/items.html#universal%20solvent_dmg"
        },
        {
            "name": "Well of Many Worlds",
            "description": "https://5e.tools/items.html#well%20of%20many%20worlds_dmg"
        },
        {
            "name": "Luxon Beacon",
            "description": "https://5e.tools/items.html#luxon%20beacon_egw"
        },
        {
            "name": "Pyxis of Pandemonium",
            "description": "https://5e.tools/items.html#pyxis%20of%20pandemonium_mot"
        },
        {
            "name": "Potion of Dragon's Majesty",
            "description": "https://5e.tools/items.html#potion%20of%20dragon's%20majesty_ftd"
        },
        {
            "name": "Gold Canary Figurine of Wondrous Power",
            "description": "https://5e.tools/items.html#gold%20canary%20figurine%20of%20wondrous%20power_ftd"
        },
        {
            "name": "How to Make Fiends and Influence People",
            "description": "https://a5e.tools/node/977"
        },
        {
            "name": "Liquid Luck",
            "description": "https://a5e.tools/node/1009"
        },
        {
            "name": "Orb of Elsewhere",
            "description": "https://a5e.tools/node/1052"
        },
        {
            "name": "Absurdist Web",
            "description": "This knot of fey spider silk unfolds into a ten-foot square, occasionally unearthing a long-dead sparrow or a cricket that waves thanks before hopping away. This web functions similar to a portable hole, and can contain material that would fit in a 10-ft. cube. However, the user cannot see what is in the extradimensional space, and can only extract things they know are inside. Those attempting to divine the contents of the web via magic must succeed on a DC 28 Intelligence (Arcana) check. On a failure, the spell or effect is wasted, and the creature cannot attempt to divinatorily discover the contents of the web again until 24 hours have passed. A creature placed into the extradimensional space is placed into stasis for up to a month, needing neither food nor water, but still healing at a natural pace. If a living creature is not freed within a month, the creature is shunted from the absurdist web and appears beneath a large spider web 1d6 miles away. Food, drink, and unintelligent creatures placed in the web are consumed immediately by unseen entities, but dead sapient creatures are left alone and do not decay for up to one month. After that point, whatever etiquette fey spiders abide by treats them as fair game, and they are quickly devoured. Moving the web does not count as moving the body for the normal limit of three miles on resurrections and speaking with spirits. Word has it that this web has a profound connection to the Webway, a series of space-folding tunnels crafted and frequently used by the arachnids of the Dreaming. The new fey titan known as the Hollow Widow would doubtlessly know more of these webs and the Webway."
        }
    ]
}